<html><head><title>SCSSI : SCSSI : ITSEC v1.2 Assurance Conformit&eacute;</title></head>
<body bgcolor=#ffffff>

<TABLE >
<TR><TD WIDTH=161><A HREF="/index.html"><IMG SRC="/images/sigle2.gif" ALT="Retour Page de Garde" ALIGN="TOP" BORDER="0"></A>
</TD><TD WIDTH=100%><CENTER>PREMIER MINISTRE</CENTER>
<P>
<CENTER><B><FONT SIZE=5>Service Central</FONT></B> <B><FONT SIZE=5>de la S&eacute;curit&eacute; des Syst&egrave;mes d'Information</FONT></B></CENTER>
</TD>
</TR>

</TABLE><HR>
<!                      >
<!                      >
<!                      >

<TABLE>
<TR><TD BGCOLOR="#96c7f8" WIDTH=161 VALIGN="TOP">
<BR>
<TABLE WIDTH=161>
<TR><TD BGCOLOR="#ffffff" WIDTH=161 ALIGN="center"><B>DOCUMENTATION</B></TD></TR>
<TR><TD ALIGN="left"><SMALL>
<A HREF="/document/index.html">Index</A> de la documentation<BR><BR>
EVALUATION
</SMALL>

<UL=COMPACT type="square">
<SMALL>
<LI><A HREF="/document/certif.html">Critères d'évaluation</A>
<LI><A HREF="/document/certif.html">Schéma de certification</A>
<LI><A HREF="/document/docs/GARDE/garde.html">Guides GARDE</A>
<LI><A HREF="/document/certif.html">Certificats et PP</A>
</SMALL>
</UL>

<SMALL>REGLEMENTATION</SMALL>
<UL=COMPACT type="square">
<SMALL>
<LI><A HREF="/document/chiffre.html">Cryptologie</A>
<LI><A HREF="/document/tempest.html">Domaine tempest</A>
<LI><A HREF="/document/ssi.html">Systèmes d'information</A>
</SMALL>
</UL>

<SMALL>
<A HREF="/document/methodes.html">METHODES</A><BR><BR>
<A HREF="/document/fiches/index.html">FICHES DE SYNTHESE</A>
</SMALL>

</TD></TR></TABLE>
<HR>

<TABLE WIDTH=161>
<TR><TD BGCOLOR="#ffffff" WIDTH=161 ALIGN="center"><B>AILLEURS SUR LE SITE</B></TD></TR>
<TR><TD ALIGN="left"><UL=COMPACT type="square"><SMALL>
<LI><A HREF="/index.html">Retour à la page d'accueil</A>
<LI><A HREF="/present/index.html">Présentation du SCSSI</A>
<LI><A HREF="/pratiq/index.html">Informations pratiques</A>
<LI><A HREF="/rubriq/index.html">Rubriques</A>
<LI><A HREF="/courrier.html">Courrier des lecteurs</A>
</SMALL></TD></TR></TABLE>

<BR>
</TD>
<!                    >
<!                    >
<!                    >

<TD WIDTH=31></TD>
<TD WIDTH=100% VALIGN=TOP>
<TABLE WIDTH=100%><TR>
<TD BGCOLOR="#FF9933" VALIGN=MIDDLE>
<BR>
<H2><CENTER>SCSSI : ITSEC v1.2 Assurance Conformit&eacute;</H2>
<A HREF="/document/criteres.html">Index de la documentation sur les critères</A> | 
<A HREF="/document/index.html">Index général de la documentation</A>
<BR>
<A HREF="/document/docs/ITSEC/itsec.html">Sommaire</A> |
<A HREF="/document/docs/ITSEC/itsec-0.html">Introduction</A> |
<A HREF="/document/docs/ITSEC/itsec-1.html">Champ d'application</A> |
<A HREF="/document/docs/ITSEC/itsec-2.html">Fonctionnalité</A> 
<A HREF="/document/docs/ITSEC/itsec-3.html">Efficacité</A> |
<A HREF="/document/docs/ITSEC/itsec-4.html">Conformité</A> |
<A HREF="/document/docs/ITSEC/itsec-E1.html">Conformité E1</A> |
<A HREF="/document/docs/ITSEC/itsec-E2.html">Conformité E2</A> |
<A HREF="/document/docs/ITSEC/itsec-E3.html">Conformité E3</A> |
<A HREF="/document/docs/ITSEC/itsec-E4.html">Conformité E4</A> |
<A HREF="/document/docs/ITSEC/itsec-E5.html">Conformité E5</A> |
<A HREF="/document/docs/ITSEC/itsec-E6.html">Conformité E6</A>
<A HREF="/document/docs/ITSEC/itsec-5.html">Résultats de l'évaluation</A> |
<A HREF="/document/docs/ITSEC/itsec-6.html">Glossaire</A> |
<A HREF="/document/docs/ITSEC/itsec-A.html">Exemples de classes de Fonctionnalité</A> |
<A HREF="/document/docs/ITSEC/itsec-B.html">"Claims language"</A> |

<BR><BR>
<a href="itsec.html"><img alt="[Début]" border=0 src="/images/top.gif"></a> <a href="itsec-3.html"><img alt="[Précédente]" border=0 src="/images/prev.gif"></a> <a href="itsec-E1.html"><img alt="[Suivante]" border=0 src="/images/next.gif"></a> <a href="itsec-B.html"><img alt="[Fin]" border=0 src="/images/bottom.gif"></a>
<BR><BR>
</TD></TR></TABLE>
<a name="130951">
<center><h3> ASSURANCE - CONFORMITE</h3></center>
</a><a name="130804">
<h4> Introduction</h4>
</a>Le pr&eacute;sent chapitre expose les crit&egrave;res d'&eacute;valuation qui traitent de l'aspect conformit&eacute; de l'assurance pour une cible d'&eacute;valuation (TOE). La base d'&eacute;valuation est constitu&eacute;e par une cible de s&eacute;curit&eacute; d&eacute;finie conform&eacute;ment au chapitre &#32;2. La cible de s&eacute;curit&eacute; doit contenir les &eacute;l&eacute;ments n&eacute;cessaires sp&eacute;cifi&eacute;s au chapitre 2 pour un syst&egrave;me ou un produit, selon le cas. Elle doit comporter le niveau d'&eacute;valuation vis&eacute; ainsi que la cotation annonc&eacute;e de la r&eacute;sistance minimum des m&eacute;canismes. L'aspect efficacit&eacute; de l'assurance est couvert par les crit&egrave;res d&eacute;crits au chapitre 3.<p>

<a name="130806">
<h4> Caract&eacute;risation</h4>
</a>Il est d&eacute;fini sept niveaux d'&eacute;valuation correspondant &agrave; des degr&eacute;s de confiance dans la conformit&eacute; d'une TOE. E0 d&eacute;signe le niveau le plus bas et E6 le plus haut.<p>

Les sept niveaux d'&eacute;valuation peuvent &ecirc;tre <I>caract&eacute;ris&eacute;s</I> comme suit &#32;:<p>

Niveau E0<p>

Ce niveau repr&eacute;sente une assurance insuffisante.<p>

Niveau E1<p>

A ce niveau, il doit exister une cible de s&eacute;curit&eacute; et une description informelle de la conception g&eacute;n&eacute;rale de la TOE. Les tests fonctionnels doivent indiquer que la TOE satisfait &agrave; sa cible de s&eacute;curit&eacute;.<p>

Niveau E2<p>

Outre les exigences du niveau E1, il doit exister une description informelle de la conception d&eacute;taill&eacute;e. Les &eacute;l&eacute;ments de preuve des tests fonctionnels doivent &ecirc;tre &eacute;valu&eacute;s. Il doit exister un syst&egrave;me de gestion de configuration et un processus approuv&eacute; de diffusion.<p>

Niveau E3<p>

En plus des exigences du niveau E2, le code source et/ou les sch&eacute;mas descriptifs des mat&eacute;riels correspondants aux m&eacute;canismes de s&eacute;curit&eacute; doivent &ecirc;tre &eacute;valu&eacute;s. Les &eacute;l&eacute;ments de preuve des tests de ces m&eacute;canismes doivent &ecirc;tre &eacute;valu&eacute;s.<p>

Niveau E4<p>

En plus des exigences du niveau E3, il doit exister un mod&egrave;le formel sous-jacent de politique de s&eacute;curit&eacute; supportant la cible d'&eacute;valuation. Les fonctions d&eacute;di&eacute;es &agrave; la s&eacute;curit&eacute;, la conception g&eacute;n&eacute;rale et la conception d&eacute;taill&eacute;e doivent &ecirc;tre sp&eacute;cifi&eacute;es en style semi-formel.<p>

Niveau E5<p>

En plus des exigences du niveau E4, il doit exister une correspondance &eacute;troite entre la conception d&eacute;taill&eacute;e et le code source et/ou les sch&eacute;mas descriptifs des mat&eacute;riels.<p>

Niveau E6<p>

En plus des exigences du niveau E5, les fonctions d&eacute;di&eacute;es &agrave; la s&eacute;curit&eacute; ainsi que la conception g&eacute;n&eacute;rale doivent &ecirc;tre sp&eacute;cifi&eacute;es en style formel de mani&egrave;re coh&eacute;rente avec le mod&egrave;le formel sous-jacent de politique de s&eacute;curit&eacute;.<p>

<a name="130823">
<h4> R&eacute;sum&eacute; des exigences</h4>
</a>Les autres parties du chapitre contiennent les crit&egrave;res d&eacute;taill&eacute;s auxquels il faut satisfaire &agrave; chaque niveau d'&eacute;valuation de la conformit&eacute;, regroup&eacute;s sous des rubriques d&eacute;taill&eacute;es et r&eacute;p&eacute;t&eacute;es pour chacun des niveaux E1 &agrave; E6. Les principales diff&eacute;rences entre les niveaux r&eacute;sultent d'exigences suppl&eacute;mentaires concernant l'examen du processus de d&eacute;veloppement. Pour aider &agrave; comprendre ces diff&eacute;rences, les diagrammes ci-apr&egrave;s montrent la relation entre les &eacute;l&eacute;ments cl&eacute;s qui doivent &ecirc;tre fournis par le commanditaire et le niveau d'&eacute;valuation auquel ils sont exig&eacute;s pour la premi&egrave;re fois par l'&eacute;valuateur.<p>

<a name="130825">
<center><h4> CRITERES DE CONFORMITE PAR NIVEAU - PROCESSUS DE DEVELOPPEMENT<img src="itsec.4.anc2.gif"></h4></center>
</a><a name="130826">
<center><h4> CRITERES DE CONFORMITE PAR NIVEAU - ENVIRONNEMENT DE DEVELOPPEMENT<img src="itsec.4.anc1.gif"></h4></center>
</a><a name="130827">
<center><h4> CRITERES DE CONFORMITE PAR NIVEAU - EXPLOITATION<br><img src="itsec.4.anc.gif"></h4></center>
</a><a name="130828">
<h4> Approche utilis&eacute;e pour les descriptions</h4>
</a>Les crit&egrave;res d'&eacute;valuation servant &agrave; estimer la conformit&eacute; se r&eacute;partissent entre ceux qui concernent la mani&egrave;re dont une TOE est d&eacute;velopp&eacute;e (construction) et ceux qui portent sur la fa&ccedil;on dont elle sera utilis&eacute;e (exploitation). Pour chaque niveau d'&eacute;valuation, ces crit&egrave;res sont ensuite divis&eacute;s en phases et en aspects.<p>

Pour chaque aspect ou phase, on trouvera &#32;: l'identification de la documentation qui doit &ecirc;tre fournie pour examen, puis les exigences sur son contenu et sa pr&eacute;sentation ou les proc&eacute;dures et normes qu'elle doit d&eacute;finir, puis les &eacute;l&eacute;ments de preuve exig&eacute;s pour montrer que les crit&egrave;res en question ont &eacute;t&eacute; satisfaits, et enfin la pr&eacute;sentation des t&acirc;ches que doit assurer l'&eacute;valuateur.<p>

Par souci de clart&eacute;, comme les exigences diff&egrave;rent de fa&ccedil;on significative d'un niveau d'&eacute;valuation &agrave; l'autre, les crit&egrave;res pour chaque niveau sont expos&eacute;s s&eacute;par&eacute;ment. A chaque niveau, les crit&egrave;res nouveaux ou modifi&eacute;s sont indiqu&eacute;s en <strong>caract&egrave;res gras</strong>. De fa&ccedil;on g&eacute;n&eacute;rale, il y a besoin de davantage de rigueur et d'approfondissement dans les &eacute;l&eacute;ments de preuve fournis &agrave; mesure que le niveau d'&eacute;valuation s'&eacute;l&egrave;ve. Cela se refl&egrave;te dans l'usage progressif, aux diff&eacute;rents niveaux, des verbes "<I>pr&eacute;senter</I>" "<I>d&eacute;crire</I>" et "<I>expliquer</I>" pour traiter du contenu et de la pr&eacute;sentation de bon nombre de crit&egrave;res qui par ailleurs ne sont pas autrement modifi&eacute;s.<p>

Sauf pour E1, c'est au commanditaire qu'incombe la charge de fournir les &eacute;l&eacute;ments de preuve, puis ceux-ci sont v&eacute;rifi&eacute;s ou contr&ocirc;l&eacute;s par l'&eacute;valuateur. Il n'est impos&eacute; &agrave; l'&eacute;valuateur de fournir des &eacute;l&eacute;ments de preuve suppl&eacute;mentaires que lorsqu'une action ind&eacute;pendante est exig&eacute;e pour obtenir le degr&eacute; de confiance n&eacute;cessaire. Par exemple, il y a des exigences concernant des &eacute;l&eacute;ments de preuve pour des tests dynamiques, &agrave; la fois pour le commanditaire et l'&eacute;valuateur. L'exigence majeure est pour le commanditaire qui doit fournir des &eacute;l&eacute;ments de preuve, en particulier des plans et des r&eacute;sultats de tests, issus du processus de d&eacute;veloppement normal du syst&egrave;me ou du produit en question. L'exigence impos&eacute;e &agrave; l'&eacute;valuateur est de montrer qu'il a examin&eacute; les r&eacute;sultats fournis par le commanditaire, mais aussi qu'il a effectu&eacute; ses propres tests pour v&eacute;rifier la compl&eacute;tude, le niveau de d&eacute;tail et la fid&eacute;lit&eacute; des tests fournis par le commanditaire, et aussi pour prendre en compte tout cas d'incoh&eacute;rence ou d'erreur manifeste qu'il pourrait trouver dans les r&eacute;sultats de ces tests.<p>

Les tests ne repr&eacute;sentent qu'un aspect de l'assurance qualit&eacute;. Tout au long des crit&egrave;res, il est sous-entendu qu'un Programme d'Assurance Qualit&eacute; a &eacute;t&eacute; introduit et s'applique au cycle de vie complet de la TOE. Ce programme d'Assurance Qualit&eacute; doit couvrir la cr&eacute;ation, la maintenance et la destruction de tous les documents, programmes et mat&eacute;riels relatifs &agrave; la TOE. Les crit&egrave;res &eacute;tablis par ce document, peuvent guider les experts en assurance qualit&eacute; pour d&eacute;terminer si le programme est satisfaisant pour le niveau d'&eacute;valuation vis&eacute; pour la TOE.<p>

<a name="130834">
<h4> Structure des crit&egrave;res de conformit&eacute;</h4>
</a>Les paragraphes qui suivent d&eacute;crivent la structure et le contenu des crit&egrave;res qui seront utilis&eacute;s pour chaque niveau d'&eacute;valuation entre E1 et E6. Ils se rapportent &agrave; chaque niveau et ne sont pas r&eacute;p&eacute;t&eacute;s pour chacun d'entre eux. Dans chaque niveau d'&eacute;valuation, les paragraphes sont num&eacute;rot&eacute;s de la fa&ccedil;on suivante &#32;:<p>

	&lt;identificateur de niveau&gt;.&lt;num&eacute;ro de paragraphe &agrave; l'int&eacute;rieur du niveau&gt;<p>

Ainsi, par exemple, le troisi&egrave;me paragraphe du niveau E2 est num&eacute;rot&eacute; E2.3. Des paragraphes vides sont utilis&eacute;s en cas de besoin, afin que les paragraphes num&eacute;rot&eacute;s de fa&ccedil;on identique dans chacun des niveaux se rapportent aux m&ecirc;mes sujets.<p>

<a name="130838">
<h4> Construction - Le processus de d&eacute;veloppement</h4>
</a>Une des principales sources de confiance dans la conformit&eacute; des aspects li&eacute;s &agrave; la s&eacute;curit&eacute; d'une TOE est la compr&eacute;hension de la fa&ccedil;on dont elle a &eacute;t&eacute; d&eacute;velopp&eacute;e. Pour les besoins de ces crit&egrave;res, quatre phases sont identifi&eacute;es dans le processus de d&eacute;veloppement. Les facteurs qui contribuent au d&eacute;veloppement de la confiance sont identifi&eacute;s dans les crit&egrave;res pour chacune de ces phases dans l'ordre o&ugrave; elles se pr&eacute;sentent. Quelle que soit la fa&ccedil;on dont la TOE est effectivement produite, les &eacute;l&eacute;ments de preuve doivent &ecirc;tre pr&eacute;sent&eacute;s de fa&ccedil;on &agrave; correspondre avec ces phases.<p>

Phase 1 - Sp&eacute;cification des besoins<p>

Cette premi&egrave;re phase du processus de d&eacute;veloppement comprend la production d'une cible de s&eacute;curit&eacute; pour le syst&egrave;me ou le produit. Cette cible est la base de l'&eacute;valuation. Elle comprendra le niveau d'&eacute;valuation vis&eacute; et la cotation annonc&eacute;e de la r&eacute;sistance minimum des m&eacute;canismes.<p>

Phase 2 - Conception g&eacute;n&eacute;rale<p>

Cette phase du processus de d&eacute;veloppement couvre la d&eacute;finition et la conception d'ensemble de la TOE au plus haut niveau. Elle se pr&eacute;sente sous la forme d'une sp&eacute;cification descriptive de haut niveau qui identifie la structure de base de la TOE, ses interfaces externes et sa d&eacute;composition en composants principaux, mat&eacute;riels et logiciels. Cette sp&eacute;cification distinguera ce que fera la TOE (la description de haut niveau) et comment elle le fera (la conception de haut niveau). Il est particuli&egrave;rement important que la conception g&eacute;n&eacute;rale fournisse une s&eacute;paration claire et efficace entre les composants d&eacute;di&eacute;s &agrave; la s&eacute;curit&eacute; et les autres. Cette s&eacute;paration peut &ecirc;tre r&eacute;alis&eacute;e de fa&ccedil;on physique, ou en s'appuyant sur des m&eacute;canismes de protection fournis par du mat&eacute;riel ou des microprogrammes, ou par tout autre moyen. Une bonne conception permet &agrave; l'effort d'&eacute;valuation de se concentrer sur les secteurs limit&eacute;s de la TOE qui contribuent &agrave; la s&eacute;curit&eacute;, et de suivre facilement la r&eacute;alisation de la cible de s&eacute;curit&eacute; &agrave; mesure que la conception s'affine pour entrer de plus en plus dans les d&eacute;tails.<p>

Phase 3 - Conception d&eacute;taill&eacute;e<p>

Cette phase du processus de d&eacute;veloppement couvre l'affinement de la conception g&eacute;n&eacute;rale de la TOE vers un niveau de d&eacute;tail qui peut &ecirc;tre utilis&eacute; comme base pour la programmation et/ou la construction du mat&eacute;riel, c'est &agrave; dire toutes les &eacute;tapes de conception et de sp&eacute;cification en dessous de la sp&eacute;cification initiale de haut niveau. Les composants identifi&eacute;s au niveau le plus bas de la sp&eacute;cification sont appel&eacute;s "composants &eacute;l&eacute;mentaires" &#32;; c'est &agrave; partir des sp&eacute;cifications des composants &eacute;l&eacute;mentaires que le logiciel et/ou le mat&eacute;riel seront produits. Les composants d&eacute;di&eacute;s &agrave; la s&eacute;curit&eacute; seront identifi&eacute;s &agrave; ce niveau. Egalement &agrave; ce niveau, peuvent &ecirc;tre identifi&eacute;s certains composants non d&eacute;di&eacute;s &agrave; la s&eacute;curit&eacute;, mais dont la panne ou une mauvaise utilisation pourrait compromettre la s&eacute;curit&eacute;. Ces composants touchent &agrave; la s&eacute;curit&eacute; puisque leur fonctionnement correct est n&eacute;cessaire pour que la TOE puisse faire respecter la s&eacute;curit&eacute;. Des niveaux interm&eacute;diaires de sp&eacute;cification peuvent exister, en fonction de la m&eacute;thodologie de d&eacute;veloppement utilis&eacute;e et de la complexit&eacute; de la cible d'&eacute;valuation. Il est important que la transformation des sp&eacute;cifications de la TOE vers plus de d&eacute;tails et moins d'abstraction soit r&eacute;alis&eacute;e d'une fa&ccedil;on qui pr&eacute;serve correctement les intentions de la description de haut niveau.<p>

Phase 4 - R&eacute;alisation<p>

Cette phase du processus de d&eacute;veloppement couvre la r&eacute;alisation de la conception d&eacute;taill&eacute;e de la TOE sous forme de mat&eacute;riel et/ou de logiciel. Chacun des composants &eacute;l&eacute;mentaires est d'abord programm&eacute; ou fabriqu&eacute; &agrave; partir de ses sp&eacute;cifications. Ces composants &eacute;l&eacute;mentaires individuels doivent ensuite &ecirc;tre v&eacute;rifi&eacute;s et test&eacute;s par rapport &agrave; leurs sp&eacute;cifications. Ils sont ensuite int&eacute;gr&eacute;s les uns avec les autres de fa&ccedil;on ordonn&eacute;e jusqu'&agrave; ce que la TOE compl&egrave;te existe. Celle-ci doit ensuite &ecirc;tre v&eacute;rifi&eacute;e et test&eacute;e dans son ensemble par rapport &agrave; la cible de s&eacute;curit&eacute;. Il faut reconna&icirc;tre que le test d'un composant &eacute;l&eacute;mentaire ou d'une unit&eacute; plus importante par rapport &agrave; sa sp&eacute;cification peut seulement montrer des erreurs ou des &eacute;carts par rapport &agrave; la sp&eacute;cification, jamais l'absence d'erreurs. Par cons&eacute;quent, pour les degr&eacute;s de confiance sup&eacute;rieurs, il faudra compl&eacute;ter les tests par des analyses.<p>

Construction - L'environnement de d&eacute;veloppement<p>

L'environnement de d&eacute;veloppement comprend les mesures, les proc&eacute;dures et les normes utilis&eacute;es par le d&eacute;veloppeur au cours du d&eacute;veloppement, de la production et de la maintenance de la TOE.<p>

Aspect 1 - Gestion de configuration<p>

La gestion de configuration couvre les contr&ocirc;les impos&eacute;s par le d&eacute;veloppeur &agrave; ses processus de d&eacute;veloppement, de production et de maintenance &#32;; par exemple, pour garantir que chaque repr&eacute;sentation de la conception ou de sa r&eacute;alisation est produite et modifi&eacute;e de fa&ccedil;on contr&ocirc;l&eacute;e et qu'il peut &ecirc;tre montr&eacute; qu'elle correspond correctement aux repr&eacute;sentations pr&eacute;c&eacute;dentes sur lesquelles elle est bas&eacute;e. L'estimation de la gestion de configuration comportera la compr&eacute;hension des proc&eacute;dures de gestion de la qualit&eacute; du d&eacute;veloppeur. A la suite de la livraison de la premi&egrave;re version d'une TOE, il est presque in&eacute;vitable que des corrections de d&eacute;fauts ou des modifications destin&eacute;es &agrave; prendre en compte des changements d'objectifs imposeront la r&eacute;alisation et la diffusion de versions ult&eacute;rieures de la TOE. Il est donc n&eacute;cessaire de maintenir la gestion de configuration de la TOE et de la documentation associ&eacute;e apr&egrave;s la premi&egrave;re version et la premi&egrave;re livraison. La gestion de configuration est importante pour le d&eacute;veloppeur car c'est le moyen de garantir que la TOE n'est pas modifi&eacute;e d'une fa&ccedil;on qui pourrait invalider les r&eacute;sultats de l'&eacute;valuation.<p>

Aspect 2 - Langages de programmation et compilateurs<p>

Cet aspect ne s'applique qu'aux composants logiciels ou micro-programm&eacute;s. Il comprend des exigences relatives aux langages de programmation, aux outils de compilation et aux biblioth&egrave;ques de routines syst&egrave;me utilis&eacute;es pour d&eacute;velopper la TOE.<p>

Aspect 3 - S&eacute;curit&eacute; des d&eacute;veloppeurs<p>

La s&eacute;curit&eacute; des d&eacute;veloppeurs recouvre les mesures physiques, organisationnelles, techniques et relatives au personnel, qui sont utilis&eacute;es dans l'environnement de d&eacute;veloppement. Elle comprend la s&eacute;curit&eacute; physique des locaux de d&eacute;veloppement et le contr&ocirc;le de la fa&ccedil;on dont le personnel de d&eacute;veloppement a &eacute;t&eacute; choisi et habilit&eacute;. Son but est de prot&eacute;ger le d&eacute;veloppement d'une attaque d&eacute;lib&eacute;r&eacute;e et de maintenir la confidentialit&eacute; des informations de fa&ccedil;on appropri&eacute;e.<p>

Exploitation - La documentation d'exploitation<p>

La documentation d'exploitation fournit les principaux moyens par lesquels le d&eacute;veloppeur d'une TOE et ses clients communiquent. Sa facilit&eacute; &agrave; &ecirc;tre comprise, sa couverture et sa conformit&eacute; sont donc des facteurs importants pour une exploitation s&ucirc;re de la TOE. Cette documentation peut &ecirc;tre consid&eacute;r&eacute;e comme entrant dans l'une des deux cat&eacute;gories d'information suivantes &#32;: celle qui concerne l'utilisateur final (documentation utilisateur) et celle qui sert aux administrateurs (documentation d'administration).<p>

Aspect 1 - Documentation utilisateur<p>

La documentation utilisateur d'une TOE est l'ensemble des informations que fournit le d&eacute;veloppeur &agrave; l'usage de l'utilisateur final. Elle devrait aider celui-ci &agrave; comprendre les capacit&eacute;s de la TOE en mati&egrave;re de s&eacute;curit&eacute; et lui permettre de contribuer &agrave; maintenir la s&eacute;curit&eacute; en cours d'utilisation.<p>

Aspect 2 - Documentation d'administration<p>

La documentation d'administration est l'ensemble des informations sur la TOE que le d&eacute;veloppeur met &agrave; la disposition de l'administrateur. Elle peut comprendre des renseignements qui ne concernent pas les utilisateurs finals ou qui ne leur sont pas appropri&eacute;s. Cette documentation devrait aider l'administrateur &agrave; installer et &agrave; exploiter la TOE d'une mani&egrave;re qui soit s&ucirc;re.<p>

Exploitation - L'environnement d'exploitation<p>

L'environnement d'exploitation comprend les mesures, les proc&eacute;dures et les normes touchant &agrave; la livraison, l'installation et l'exploitation s&ucirc;res d'une TOE. Dans le cas d'un syst&egrave;me qui est d&eacute;j&agrave; en service, il est possible d'estimer les proc&eacute;dures d'exploitation r&eacute;elles. Dans les autres cas, on ne peut &eacute;valuer que celles qui sont propos&eacute;es.<p>

Aspect 1 - Livraison et configuration<p>

Cette section couvre les proc&eacute;dures servant &agrave; assurer la s&eacute;curit&eacute; au cours du transfert de la TOE ou de ses composants &agrave; l'utilisateur, aussi bien lors de la livraison initiale qu'&agrave; l'occasion d'une modification ult&eacute;rieure. Elle rassemble toutes les proc&eacute;dures ou op&eacute;rations particuli&egrave;res n&eacute;cessaires soit &agrave; la configuration de la TOE lors de son installation, soit &agrave; la d&eacute;monstration de l'authenticit&eacute; de la TOE livr&eacute;e. Ces proc&eacute;dures et ces mesures sont la base de la garantie que la protection offerte par cette TOE en mati&egrave;re de s&eacute;curit&eacute; n'est pas compromise du fait du transfert ou d'une interf&eacute;rence avec les caract&eacute;ristiques de s&eacute;curit&eacute; lors de l'installation et de la configuration sur le site de l'utilisateur.<p>

Aspect 2 - D&eacute;marrage et exploitation<p>

Cette section rassemble les proc&eacute;dures utilis&eacute;es par l'administrateur pour l'exploitation courante de la TOE de mani&egrave;re s&ucirc;re. Elle doit comporter non seulement le fonctionnement quotidien (comme le d&eacute;marrage du syst&egrave;me), mais aussi d'autres op&eacute;rations courantes telles que les sauvegardes et la maintenance indispensables, et des activit&eacute;s exceptionnelles comme le red&eacute;marrage et la restauration &agrave; la suite d'une panne. Presque toutes les TOE exigent une maintenance, soit pour tenir compte de modifications d'objectifs, soit pour traiter des d&eacute;fauts. Aussi ces proc&eacute;dures doivent-elles permettre d'effectuer les modifications, remplacements ou ajouts autoris&eacute;s &agrave; la TOE.<p>


<TABLE BGCOLOR="#FF9933"><TR><TD WIDTH=100%>
<CENTER>
<BR><A HREF="/document/criteres.html">Index de la documentation sur les critères</A> | 
<A HREF="/document/index.html">Index général de la documentation</A>
<BR>
<A HREF="/document/docs/ITSEC/itsec.html">Sommaire</A> |
<A HREF="/document/docs/ITSEC/itsec-0.html">Introduction</A> |
<A HREF="/document/docs/ITSEC/itsec-1.html">Champ d'application</A> |
<A HREF="/document/docs/ITSEC/itsec-2.html">Fonctionnalité</A> 
<A HREF="/document/docs/ITSEC/itsec-3.html">Efficacité</A> |
<A HREF="/document/docs/ITSEC/itsec-4.html">Conformité</A> |
<A HREF="/document/docs/ITSEC/itsec-E1.html">Conformité E1</A> |
<A HREF="/document/docs/ITSEC/itsec-E2.html">Conformité E2</A> |
<A HREF="/document/docs/ITSEC/itsec-E3.html">Conformité E3</A> |
<A HREF="/document/docs/ITSEC/itsec-E4.html">Conformité E4</A> |
<A HREF="/document/docs/ITSEC/itsec-E5.html">Conformité E5</A> |
<A HREF="/document/docs/ITSEC/itsec-E6.html">Conformité E6</A>
<A HREF="/document/docs/ITSEC/itsec-5.html">Résultats de l'évaluation</A> |
<A HREF="/document/docs/ITSEC/itsec-6.html">Glossaire</A> |
<A HREF="/document/docs/ITSEC/itsec-A.html">Exemples de classes de Fonctionnalité</A> |
<A HREF="/document/docs/ITSEC/itsec-B.html">"Claims language"</A> |

<BR><BR><a href="itsec.html"><img alt="[Début]" border=0 src="/images/top.gif"></a> <a href="itsec-3.html"><img alt="[Précédente]" border=0 src="/images/prev.gif"></a> <a href="itsec-E1.html"><img alt="[Suivante]" border=0 src="/images/next.gif"></a> <a href="itsec-B.html"><img alt="[Fin]" border=0 src="/images/bottom.gif"></a>
<BR><BR>
</TD></TR></TABLE>
</TD></TR></TABLE>
<HR>

<SMALL><A HREF="/courrier.html">
webmaster@scssi.gouv.fr</A>

- Copyright &copy 1999 Service Central de la Sécurité des Systèmes d'Information
<BR>Dernière mise à jour le 17/06/99 à 17:03:42
</SMALL>
</body>
</html>
