<html><head><title>SCSSI : SCSSI : ITSEC v1.2 Assurance Efficacit&eacute;</title></head>
<body bgcolor=#ffffff>

<TABLE >
<TR><TD WIDTH=161><A HREF="/index.html"><IMG SRC="/images/sigle2.gif" ALT="Retour Page de Garde" ALIGN="TOP" BORDER="0"></A>
</TD><TD WIDTH=100%><CENTER>PREMIER MINISTRE</CENTER>
<P>
<CENTER><B><FONT SIZE=5>Service Central</FONT></B> <B><FONT SIZE=5>de la S&eacute;curit&eacute; des Syst&egrave;mes d'Information</FONT></B></CENTER>
</TD>
</TR>

</TABLE><HR>
<!                      >
<!                      >
<!                      >

<TABLE>
<TR><TD BGCOLOR="#96c7f8" WIDTH=161 VALIGN="TOP">
<BR>
<TABLE WIDTH=161>
<TR><TD BGCOLOR="#ffffff" WIDTH=161 ALIGN="center"><B>DOCUMENTATION</B></TD></TR>
<TR><TD ALIGN="left"><SMALL>
<A HREF="/document/index.html">Index</A> de la documentation<BR><BR>
EVALUATION
</SMALL>

<UL=COMPACT type="square">
<SMALL>
<LI><A HREF="/document/certif.html">Critères d'évaluation</A>
<LI><A HREF="/document/certif.html">Schéma de certification</A>
<LI><A HREF="/document/docs/GARDE/garde.html">Guides GARDE</A>
<LI><A HREF="/document/certif.html">Certificats et PP</A>
</SMALL>
</UL>

<SMALL>REGLEMENTATION</SMALL>
<UL=COMPACT type="square">
<SMALL>
<LI><A HREF="/document/chiffre.html">Cryptologie</A>
<LI><A HREF="/document/tempest.html">Domaine tempest</A>
<LI><A HREF="/document/ssi.html">Systèmes d'information</A>
</SMALL>
</UL>

<SMALL>
<A HREF="/document/methodes.html">METHODES</A><BR><BR>
<A HREF="/document/fiches/index.html">FICHES DE SYNTHESE</A>
</SMALL>

</TD></TR></TABLE>
<HR>

<TABLE WIDTH=161>
<TR><TD BGCOLOR="#ffffff" WIDTH=161 ALIGN="center"><B>AILLEURS SUR LE SITE</B></TD></TR>
<TR><TD ALIGN="left"><UL=COMPACT type="square"><SMALL>
<LI><A HREF="/index.html">Retour à la page d'accueil</A>
<LI><A HREF="/present/index.html">Présentation du SCSSI</A>
<LI><A HREF="/pratiq/index.html">Informations pratiques</A>
<LI><A HREF="/rubriq/index.html">Rubriques</A>
<LI><A HREF="/courrier.html">Courrier des lecteurs</A>
</SMALL></TD></TR></TABLE>

<BR>
</TD>
<!                    >
<!                    >
<!                    >

<TD WIDTH=31></TD>
<TD WIDTH=100% VALIGN=TOP>
<TABLE WIDTH=100%><TR>
<TD BGCOLOR="#FF9933" VALIGN=MIDDLE>
<BR>
<H2><CENTER>SCSSI : ITSEC v1.2 Assurance Efficacit&eacute;</H2>
<A HREF="/document/criteres.html">Index de la documentation sur les critères</A> | 
<A HREF="/document/index.html">Index général de la documentation</A>
<BR>
<A HREF="/document/docs/ITSEC/itsec.html">Sommaire</A> |
<A HREF="/document/docs/ITSEC/itsec-0.html">Introduction</A> |
<A HREF="/document/docs/ITSEC/itsec-1.html">Champ d'application</A> |
<A HREF="/document/docs/ITSEC/itsec-2.html">Fonctionnalité</A> 
<A HREF="/document/docs/ITSEC/itsec-3.html">Efficacité</A> |
<A HREF="/document/docs/ITSEC/itsec-4.html">Conformité</A> |
<A HREF="/document/docs/ITSEC/itsec-E1.html">Conformité E1</A> |
<A HREF="/document/docs/ITSEC/itsec-E2.html">Conformité E2</A> |
<A HREF="/document/docs/ITSEC/itsec-E3.html">Conformité E3</A> |
<A HREF="/document/docs/ITSEC/itsec-E4.html">Conformité E4</A> |
<A HREF="/document/docs/ITSEC/itsec-E5.html">Conformité E5</A> |
<A HREF="/document/docs/ITSEC/itsec-E6.html">Conformité E6</A>
<A HREF="/document/docs/ITSEC/itsec-5.html">Résultats de l'évaluation</A> |
<A HREF="/document/docs/ITSEC/itsec-6.html">Glossaire</A> |
<A HREF="/document/docs/ITSEC/itsec-A.html">Exemples de classes de Fonctionnalité</A> |
<A HREF="/document/docs/ITSEC/itsec-B.html">"Claims language"</A> |

<BR><BR>
<a href="itsec.html"><img alt="[Début]" border=0 src="/images/top.gif"></a> <a href="itsec-2.html"><img alt="[Précédente]" border=0 src="/images/prev.gif"></a> <a href="itsec-4.html"><img alt="[Suivante]" border=0 src="/images/next.gif"></a> <a href="itsec-B.html"><img alt="[Fin]" border=0 src="/images/bottom.gif"></a>
<BR><BR>
</TD></TR></TABLE>
<a name="244063">
<center><h3> ASSURANCE - EFFICACITE</h3></center>
</a><a name="243882">
<h4> Introduction</h4>
</a>Le pr&eacute;sent chapitre pr&eacute;sente les crit&egrave;res d'&eacute;valuation qui traitent de l'aspect efficacit&eacute; de l'assurance pour une cible d'&eacute;valuation (TOE). La base de l'&eacute;valuation est la cible de s&eacute;curit&eacute; telle qu'elle est d&eacute;finie au chapitre 2, qui est &eacute;valu&eacute;e en m&ecirc;me temps pour l'efficacit&eacute;, selon les crit&egrave;res expos&eacute;s dans le pr&eacute;sent chapitre, et pour la conformit&eacute;, selon les crit&egrave;res expos&eacute;s au chapitre 4 qui lui succ&egrave;de.<p>

<a name="243884">
<h4> Description de l'approche</h4>
</a>L'estimation de l'efficacit&eacute; prend en compte les aspects suivants de la TOE &#32;:<p>

<ol>
<a name="243886">
<li>la pertinence des fonctions de la TOE d&eacute;di&eacute;es &agrave; la s&eacute;curit&eacute; pour contrer les menaces contre la s&eacute;curit&eacute; de la TOE identifi&eacute;es dans la cible de s&eacute;curit&eacute; &#32;;
</a><a name="243887">
<li>la capacit&eacute; des fonctions et des m&eacute;canismes de la TOE d&eacute;di&eacute;s &agrave; la s&eacute;curit&eacute; &agrave; se lier et &agrave; coop&eacute;rer pour former un ensemble int&eacute;gr&eacute; et efficace &#32;;
</a><a name="243888">
<li>la capacit&eacute; des m&eacute;canismes de s&eacute;curit&eacute; de la TOE &agrave; r&eacute;sister &agrave; une attaque directe &#32;;
</a><a name="243889">
<li>si des vuln&eacute;rabilit&eacute;s connues dans la <I>construction</I> de la TOE pourraient en pratique compromettre la s&eacute;curit&eacute; de la TOE &#32;;
</a><a name="243890">
<li>que la TOE ne peut pas &ecirc;tre configur&eacute;e ou utilis&eacute;e d'une mani&egrave;re qui n'est pas s&ucirc;re, mais qu'un <strong>administrateur</strong> ou un utilisateur final pourrait raisonnablement croire s&ucirc;re &#32;;
</a><a name="243891">
<li>si des vuln&eacute;rabilit&eacute;s connues dans l'<I>exploitation</I> de la TOE pourraient en pratique compromettre la s&eacute;curit&eacute; de la TOE.
</a></ol>
<p>

L'estimation de chacun des aspects de l'efficacit&eacute; identifi&eacute;s ci-dessus est effectu&eacute;e en utilisant la documentation fournie par le commanditaire ainsi que la documentation et les r&eacute;sultats provenant de l'&eacute;valuation de la conformit&eacute; de la TOE. Cela signifie que, bien que l'&eacute;valuation de l'efficacit&eacute; puisse se d&eacute;rouler en parall&egrave;le avec l'estimation de la conformit&eacute;, elle ne peut se terminer avant que les r&eacute;sultats finals de l'estimation de la conformit&eacute; ne soient disponibles.<p>

Pour &ecirc;tre pr&eacute;cis, l'estimation de l'efficacit&eacute; est bas&eacute;e sur une analyse des vuln&eacute;rabilit&eacute;s de la TOE. Cette analyse a pour objectif de rechercher tous les moyens possibles pour un utilisateur de la TOE de d&eacute;sactiver, de court-circuiter, d'alt&eacute;rer, de contourner, d'attaquer directement, ou de mettre autrement en &eacute;chec les fonctions et les m&eacute;canismes de la TOE d&eacute;di&eacute;s &agrave; la s&eacute;curit&eacute;. Au minimum, l'analyse de vuln&eacute;rabilit&eacute; du commanditaire doit prendre en compte toutes les informations sp&eacute;cifi&eacute;es dans la figure 4 pour le niveau d'&eacute;valuation en question (c'est &agrave; dire qu'il faut effectuer une recherche des vuln&eacute;rabilit&eacute;s en utilisant une partie de l'ensemble de la documentation fournie par le commanditaire pour le niveau d'&eacute;valuation consid&eacute;r&eacute;). Quand le niveau d'&eacute;valuation augmente, les crit&egrave;res de conformit&eacute; du chapitre 4 exigent que les informations sp&eacute;cifi&eacute;es dans la figure 4 soient fournies avec un niveau croissant de rigueur, comme l'indique l'emploi des verbes <I>pr&eacute;senter</I>, <I>d&eacute;crire</I> et <I>expliquer</I>.<p>

Tous les m&eacute;canismes de s&eacute;curit&eacute; critiques (c'est &agrave; dire les m&eacute;canismes dont la mise en d&eacute;faut pourrait cr&eacute;er une faiblesse dans la s&eacute;curit&eacute;), sont estim&eacute;s quant &agrave; leur capacit&eacute; &agrave; r&eacute;sister &agrave; une attaque directe. La r&eacute;sistance minimum de chaque <strong>m&eacute;canisme critique</strong> doit &ecirc;tre cot&eacute;e comme &eacute;tant <I>&eacute;l&eacute;mentaire</I>, <I>moyenne</I> ou <I>&eacute;lev&eacute;e</I>.<p>

Pour que la r&eacute;sistance minimum d'un m&eacute;canisme critique soit cot&eacute;e &eacute;l&eacute;mentaire, il doit &ecirc;tre manifeste qu'il fournit une protection contre une subversion accidentelle al&eacute;atoire, bien qu'il soit susceptible d'&ecirc;tre mis en &eacute;chec par des agresseurs comp&eacute;tents.<p>

Pour que la r&eacute;sistance minimum d'un m&eacute;canisme critique soit cot&eacute;e moyenne, il doit &ecirc;tre manifeste qu'il fournit une protection contre des agresseurs dont les opportunit&eacute;s ou les ressources sont limit&eacute;es.<p>

Pour que la r&eacute;sistance minimum d'un m&eacute;canisme critique soit cot&eacute;e &eacute;lev&eacute;e, il doit &ecirc;tre manifeste qu'il ne pourra &ecirc;tre mis en &eacute;chec que par des agresseurs disposant d'un haut degr&eacute; d'expertise, d'opportunit&eacute; et de ressources, le succ&egrave;s d'une attaque &eacute;tant jug&eacute; de nature exceptionnelle.<p>

Une TOE n'&eacute;chouera dans l'&eacute;valuation pour ce qui concerne l'efficacit&eacute; que si une vuln&eacute;rabilit&eacute; exploitable, d&eacute;couverte pendant l'&eacute;valuation de l'efficacit&eacute;, n'a pas &eacute;t&eacute; &eacute;limin&eacute;e avant la fin de l'&eacute;valuation. Cela comprend des m&eacute;thodes d'attaque directe ayant r&eacute;ussi, d&eacute;cel&eacute;es pendant l'estimation de la r&eacute;sistance minimum des m&eacute;canismes, qui invalideraient la cotation annonc&eacute;e. Si une telle vuln&eacute;rabilit&eacute; existe, la TOE se verra d&eacute;cerner le niveau global d'&eacute;valuation E0, indiquant qu'elle ne convient pas &agrave; l'emploi propos&eacute;.<p>

L'efficacit&eacute; de la TOE est toujours estim&eacute;e dans le contexte de la cible de s&eacute;curit&eacute; donn&eacute;e. Par exemple, un produit de s&eacute;curit&eacute; vendu pour &ecirc;tre incorpor&eacute; dans des syst&egrave;mes peut contenir des <strong>canaux cach&eacute;s</strong> connus. Pourtant, si la cible de s&eacute;curit&eacute; du syst&egrave;me n'a pas d'exigence de contr&ocirc;le d'acc&egrave;s pour la confidentialit&eacute;, la pr&eacute;sence de canaux cach&eacute;s dans le produit n'est pas &agrave; prendre en compte et n'affectera pas la capacit&eacute; de la TOE &agrave; satisfaire &agrave; sa cible de s&eacute;curit&eacute;, et ne provoquera pas l'&eacute;chec de l'&eacute;valuation. Pour des syst&egrave;mes pr&eacute;sentant des exigences de contr&ocirc;le d'acc&egrave;s pour la confidentialit&eacute;, la cible de s&eacute;curit&eacute; du syst&egrave;me peut sp&eacute;cifier les bandes passantes maximum admissibles des canaux cach&eacute;s. Si des canaux cach&eacute;s d&eacute;passant ces bandes passantes sont identifi&eacute;s, ou si aucune bande passante n'est r&eacute;ellement sp&eacute;cifi&eacute;e, l'&eacute;valuateur doit d&eacute;terminer si les canaux cach&eacute;s identifi&eacute;s font &eacute;chouer l'&eacute;valuation de la TOE sur la base d'une fonctionnalit&eacute; non pertinente.<p>

<a name="243900">
<h4> Syst&egrave;mes et produits</h4>
</a>Les exigences et options concernant le contenu de la cible de s&eacute;curit&eacute; d'une TOE sont diff&eacute;rentes, selon que la TOE est &eacute;valu&eacute;e comme un syst&egrave;me ou comme un produit. Ces diff&eacute;rences sont expos&eacute;es au chapitre 4 - Construction - Phase 1 - Sp&eacute;cifications des besoins, et expliqu&eacute;es plus en d&eacute;tail au chapitre &#32;2.<p>

<a name="243902">
<h4> Crit&egrave;res d'efficacit&eacute; - Construction</h4>
</a>Documentation<p>

Le commanditaire doit fournir la documentation suivante en compl&eacute;ment de celle qui est exig&eacute;e pour l'&eacute;valuation de la conformit&eacute; &#32;:<p>

<ul>
<li>analyse de pertinence,

<li>analyse de coh&eacute;sion,

<li>analyse de la r&eacute;sistance des m&eacute;canismes,

<li>liste des vuln&eacute;rabilit&eacute;s connues dans la construction.
</ul><a name="243909">
<h4> Aspect 1 - Pertinence de la fonctionnalit&eacute;</h4>
</a>D&eacute;finition<p>

Dans le cadre de la documentation exig&eacute;e pour l'&eacute;valuation de la conformit&eacute;, le commanditaire fournira une cible de s&eacute;curit&eacute;. Au cours de l'estimation de la conformit&eacute;, cette cible est examin&eacute;e sous l'angle de la couverture et de la coh&eacute;rence. En ce qui concerne cet aspect de l'efficacit&eacute;, la cible de s&eacute;curit&eacute; est utilis&eacute;e pour d&eacute;terminer si les fonctions et les m&eacute;canismes d&eacute;di&eacute;s &agrave; la s&eacute;curit&eacute; contreront effectivement les menaces pour la s&eacute;curit&eacute; de la TOE identifi&eacute;es dans la cible de s&eacute;curit&eacute;.<p>

Exigences concernant le contenu et la pr&eacute;sentation<p>

L'analyse de la pertinence doit &eacute;tablir un lien entre les fonctions et m&eacute;canismes d&eacute;di&eacute;s &agrave; la s&eacute;curit&eacute; et les menaces &eacute;num&eacute;r&eacute;es dans la cible de s&eacute;curit&eacute;, que leur conception vise &agrave; contrer.<p>

Exigences concernant les &eacute;l&eacute;ments de preuve<p>

L'analyse de la pertinence doit montrer comment les menaces sont contr&eacute;es par les fonctions et les m&eacute;canismes d&eacute;di&eacute;s &agrave; la s&eacute;curit&eacute;. Elle doit montrer qu'il n'existe aucune menace qui ne soit convenablement contr&eacute;e par une ou plusieurs des fonctions d&eacute;di&eacute;es &agrave; la s&eacute;curit&eacute; qui sont d&eacute;clar&eacute;es. L'analyse doit &ecirc;tre conduite en utilisant, au minimum, toutes les informations donn&eacute;es dans la figure 4 pour le niveau d'&eacute;valuation consid&eacute;r&eacute;.<p>

T&acirc;ches de l'&eacute;valuateur<p>

V&eacute;rifier que l'analyse de pertinence fournie satisfait &agrave; toutes les exigences concernant le contenu et la pr&eacute;sentation ainsi qu'&agrave; celles concernant les &eacute;l&eacute;ments de preuve. V&eacute;rifier que l'analyse a pris en compte toutes les informations donn&eacute;es dans la figure 4 pour le niveau consid&eacute;r&eacute;.<p>

<a name="243918">
<h4> Aspect 2 - Coh&eacute;sion de la fonctionnalit&eacute;</h4>
</a>D&eacute;finition<p>

Cet aspect de l'efficacit&eacute; examine la capacit&eacute; des fonctions et m&eacute;canismes d&eacute;di&eacute;s &agrave; la s&eacute;curit&eacute; &agrave; coop&eacute;rer pour former un ensemble int&eacute;gr&eacute; et efficace.<p>

Exigences concernant le contenu et la pr&eacute;sentation<p>

L'analyse de coh&eacute;sion doit fournir une analyse de toutes les relations potentielles entre les fonctions et m&eacute;canismes d&eacute;di&eacute;s &agrave; la s&eacute;curit&eacute;.<p>

Exigences concernant les &eacute;l&eacute;ments de preuve<p>

L'analyse de coh&eacute;sion doit montrer qu'il est impossible d'amener l'une des fonctions ou l'un des m&eacute;canismes d&eacute;di&eacute;s &agrave; la s&eacute;curit&eacute; &agrave; rentrer en conflit ou &agrave; se mettre en contradiction avec d'autres fonctions ou m&eacute;canismes d&eacute;di&eacute;s &agrave; la s&eacute;curit&eacute;. L'analyse doit &ecirc;tre conduite en utilisant, au minimum, toutes les informations donn&eacute;es dans la figure 4 pour le niveau consid&eacute;r&eacute;.<p>

T&acirc;ches de l'&eacute;valuateur<p>

V&eacute;rifier que l'analyse de coh&eacute;sion fournie satisfait &agrave; toutes les exigences concernant le contenu et la pr&eacute;sentation ainsi qu'&agrave; celles concernant les &eacute;l&eacute;ments de preuve. V&eacute;rifier que l'analyse a pris en compte toutes les informations donn&eacute;es dans la figure 4 pour le niveau consid&eacute;r&eacute;.<p>

<a name="243927">
<h4> Aspect 3 - R&eacute;sistance des m&eacute;canismes</h4>
</a>D&eacute;finition<p>

M&ecirc;me si un m&eacute;canisme d&eacute;di&eacute; &agrave; la s&eacute;curit&eacute; ne peut pas &ecirc;tre court-circuit&eacute;, d&eacute;sactiv&eacute;, alt&eacute;r&eacute; ou contourn&eacute;, il peut encore &ecirc;tre possible de le mettre en &eacute;chec par une attaque directe tirant profit d'insuffisances dans ses algorithmes, ses principes ou ses propri&eacute;t&eacute;s sous-jacents. Pour cet aspect de l'efficacit&eacute; la capacit&eacute; de ces m&eacute;canismes &agrave; contenir une telle attaque directe est estim&eacute;e. Cet aspect de l'efficacit&eacute; se distingue des autres en ce qu'il exige de prendre en consid&eacute;ration le niveau des ressources qui seraient n&eacute;cessaires &agrave; un agresseur pour r&eacute;ussir une attaque directe.<p>

Exigences concernant le contenu et la pr&eacute;sentation<p>

L'analyse de la r&eacute;sistance des m&eacute;canismes doit &eacute;num&eacute;rer tous les m&eacute;canismes d&eacute;di&eacute;s &agrave; la s&eacute;curit&eacute; de la TOE qui ont &eacute;t&eacute; identifi&eacute;s comme &eacute;tant critiques. Elle doit inclure une analyse des algorithmes, des principes ou des propri&eacute;t&eacute;s sous-jacents de ces m&eacute;canismes, ou y faire r&eacute;f&eacute;rence.<p>

Exigences concernant les &eacute;l&eacute;ments de preuve<p>

L'analyse de la r&eacute;sistance des m&eacute;canismes doit montrer que tous les m&eacute;canismes critiques satisfont &agrave; la cotation annonc&eacute;e de la r&eacute;sistance minimum des m&eacute;canismes, telle qu'elle est d&eacute;finie aux paragraphes 3.6 &agrave; 3.8 &#32;: dans le cas de m&eacute;canismes cryptographiques, ceci doit prendre la forme d'une d&eacute;claration de confirmation par l'organisme national appropri&eacute;. D'autres analyses doivent &ecirc;tre conduites en utilisant, au minimum, toutes les informations donn&eacute;es dans la figure 4 pour le niveau consid&eacute;r&eacute;.<p>

T&acirc;ches de l'&eacute;valuateur<p>

V&eacute;rifier que tous les m&eacute;canismes critiques ont bien &eacute;t&eacute; identifi&eacute;s comme tels. V&eacute;rifier que l'analyse fournie pour la r&eacute;sistance des m&eacute;canismes satisfait &agrave; toutes les exigences concernant le contenu et la pr&eacute;sentation ainsi qu'&agrave; celles concernant les &eacute;l&eacute;ments de preuve. V&eacute;rifier que l'analyse a pris en compte toutes les informations donn&eacute;es dans la figure 4 pour le niveau consid&eacute;r&eacute;. V&eacute;rifier que les sp&eacute;cifications ou les d&eacute;finitions de tous les m&eacute;canismes critiques correspondent &agrave; la cotation annonc&eacute;e de la r&eacute;sistance minimum. Effectuer des <strong>tests de p&eacute;n&eacute;tration</strong> l&agrave; o&ugrave; c'est n&eacute;cessaire pour confirmer ou infirmer la r&eacute;sistance minimum des m&eacute;canismes annonc&eacute;e.<p>

<a name="243936">
<h4> Aspect 4 - Estimation de la vuln&eacute;rabilit&eacute; &#32;de la construction</h4>
</a>D&eacute;finition<p>

Avant et pendant l'&eacute;tude des autres aspects de l'&eacute;valuation de la TOE, diverses vuln&eacute;rabilit&eacute;s dans la construction de la TOE (tels que des moyens de d&eacute;sactiver, court-circuiter, alt&eacute;rer ou contourner des fonctions et m&eacute;canismes d&eacute;di&eacute;s &agrave; la s&eacute;curit&eacute;) auront &eacute;t&eacute; identifi&eacute;es par le commanditaire et par l'&eacute;valuateur. Pour cet aspect de l'efficacit&eacute;, ces vuln&eacute;rabilit&eacute;s connues sont estim&eacute;es pour d&eacute;terminer si elles peuvent dans la pratique compromettre la s&eacute;curit&eacute; de la TOE telle qu'elle est sp&eacute;cifi&eacute;e dans la cible de s&eacute;curit&eacute;.<p>

Exigences concernant le contenu et la pr&eacute;sentation<p>

La liste des vuln&eacute;rabilit&eacute;s connues fournie par le commanditaire doit identifier toutes les vuln&eacute;rabilit&eacute;s dans la construction de la TOE, dont il a connaissance. Elle doit identifier chaque vuln&eacute;rabilit&eacute; connue, fournir une analyse de son impact potentiel et identifier les mesures propos&eacute;es ou fournies pour parer ses cons&eacute;quences.<p>

Exigences concernant les &eacute;l&eacute;ments de preuve<p>

L'analyse de l'impact potentiel de chacune des vuln&eacute;rabilit&eacute;s connues doit montrer que la vuln&eacute;rabilit&eacute; en question ne peut pas &ecirc;tre exploit&eacute;e dans l'environnement pr&eacute;vu pour la TOE, parce que &#32;:<p>

<ul>
<li>la vuln&eacute;rabilit&eacute; est convenablement couverte par d'autres m&eacute;canismes de s&eacute;curit&eacute; non compromis, ou

<li>il peut &ecirc;tre montr&eacute; que la vuln&eacute;rabilit&eacute; ne rel&egrave;ve pas de la cible de s&eacute;curit&eacute;, qu'elle n'existera pas dans la pratique, ou qu'elle pourra &ecirc;tre convenablement contr&eacute;e par des mesures de s&eacute;curit&eacute; techniques, relatives au personnel, organisationnelles ou physiques, document&eacute;es, et ext&eacute;rieures &agrave; la TOE. Ces mesures de s&eacute;curit&eacute; externes doivent avoir &eacute;t&eacute; d&eacute;finies dans la documentation appropri&eacute;e (ou doivent lui avoir &eacute;t&eacute; ajout&eacute;es).
</ul>L'analyse doit &ecirc;tre conduite en utilisant, au minimum, toutes les informations donn&eacute;es dans la figure 4 pour le niveau consid&eacute;r&eacute;.<p>

T&acirc;ches de l'&eacute;valuateur<p>

V&eacute;rifier que la liste des vuln&eacute;rabilit&eacute;s dans la construction qui sont connues satisfait &agrave; toutes les exigences indiqu&eacute;es ci-dessus concernant le contenu et la pr&eacute;sentation ainsi qu'&agrave; celles concernant les &eacute;l&eacute;ments de preuve. V&eacute;rifier que l'analyse de l'impact potentiel de chacune des vuln&eacute;rabilit&eacute;s a pris en compte toutes les informations donn&eacute;es dans la figure 4 pour le niveau consid&eacute;r&eacute;. Effectuer une analyse ind&eacute;pendante de vuln&eacute;rabilit&eacute;, en prenant en compte &agrave; la fois les vuln&eacute;rabilit&eacute;s de construction &eacute;num&eacute;r&eacute;es et toute autre d&eacute;couverte pendant l'&eacute;valuation. V&eacute;rifier que toutes les combinaisons de vuln&eacute;rabilit&eacute;s connues ont &eacute;t&eacute; prises en compte. V&eacute;rifier que les analyses d'impact potentiel des vuln&eacute;rabilit&eacute;s ne contiennent pas d'hypoth&egrave;ses non document&eacute;es ou d&eacute;raisonnables concernant l'environnement pr&eacute;vu. V&eacute;rifier que toutes les hypoth&egrave;ses et toutes les exigences concernant des mesures de s&eacute;curit&eacute; externes ont &eacute;t&eacute; convenablement document&eacute;es. Effectuer des tests de p&eacute;n&eacute;tration pour confirmer ou infirmer que les vuln&eacute;rabilit&eacute;s connues sont r&eacute;ellement exploitables en pratique.<p>

<a name="243948">
<h4> Crit&egrave;res d'efficacit&eacute; - Exploitation</h4>
</a>Documentation<p>

Le commanditaire doit fournir la documentation suivante en compl&eacute;ment de celle qui est exig&eacute;e pour l'&eacute;valuation de la conformit&eacute; &#32;:<p>

<ul>
<li>analyse de la facilit&eacute; d'emploi,

<li>liste des vuln&eacute;rabilit&eacute;s en exploitation connues.
</ul><a name="243953">
<h4> Aspect 1 - Facilit&eacute; d'emploi</h4>
</a>D&eacute;finition<p>

Cet aspect de l'efficacit&eacute; examine si la TOE peut &ecirc;tre configur&eacute;e ou utilis&eacute;e d'une mani&egrave;re qui n'est pas s&ucirc;re, mais qu'un administrateur ou un utilisateur final pourrait raisonnablement croire s&ucirc;re.<p>

Exigences concernant le contenu et la pr&eacute;sentation<p>

L'analyse de la facilit&eacute; d'emploi doit identifier les modes d'exploitation possibles de la TOE, y compris l'exploitation &agrave; la suite d'une panne ou d'une erreur d'exploitation, leurs cons&eacute;quences et leurs implications sur le maintien de l'exploitation s&ucirc;re.<p>

Exigences concernant les &eacute;l&eacute;ments de preuve<p>

L'analyse de la facilit&eacute; d'emploi doit montrer que toute erreur humaine ou autre dans l'exploitation, qui d&eacute;sactive ou rend inop&eacute;rantes des fonctions ou des m&eacute;canismes d&eacute;di&eacute;s &agrave; la s&eacute;curit&eacute;, sera facilement d&eacute;tectable. Elle doit montrer que, dans le cas o&ugrave; il est possible de configurer la TOE ou de faire en sorte qu'elle puisse &ecirc;tre exploit&eacute;e de fa&ccedil;on non s&ucirc;re (c'est &agrave; dire que les fonctions et les m&eacute;canismes d&eacute;di&eacute;s &agrave; la s&eacute;curit&eacute; ne satisfont pas &agrave; la cible de s&eacute;curit&eacute;), alors qu'un utilisateur final ou un administrateur pourraient raisonnablement la croire s&ucirc;re, alors cet &eacute;tat de fait sera &eacute;galement d&eacute;tectable. L'analyse doit &ecirc;tre conduite en utilisant, au minimum, toutes les informations donn&eacute;es dans la figure 4 pour le niveau consid&eacute;r&eacute;.<p>

T&acirc;ches de l'&eacute;valuateur<p>

V&eacute;rifier que l'analyse de la facilit&eacute; d'emploi fournie satisfait &agrave; toutes les exigences concernant le contenu et la pr&eacute;sentation ainsi qu'&agrave; celles concernant les &eacute;l&eacute;ments de preuve. V&eacute;rifier que l'analyse a pris en compte toutes les informations donn&eacute;es dans la figure 4 pour le niveau consid&eacute;r&eacute;. V&eacute;rifier que l'analyse ne contient pas d'hypoth&egrave;ses non document&eacute;es ou d&eacute;raisonnables concernant l'environnement pr&eacute;vu. V&eacute;rifier que toutes les hypoth&egrave;ses et exigences concernant des mesures de s&eacute;curit&eacute; externes (telles que des contr&ocirc;les externes organisationnels, physiques ou relatifs au personnel) ont &eacute;t&eacute; convenablement document&eacute;es. Ex&eacute;cuter &agrave; nouveau toutes les proc&eacute;dures de configuration et d'installation pour v&eacute;rifier que la TOE peut &ecirc;tre configur&eacute;e et utilis&eacute;e de fa&ccedil;on s&ucirc;re, en n'utilisant comme guide que la documentation de l'utilisateur et la documentation de l'administrateur. Effectuer d'autres tests quand c'est n&eacute;cessaire pour confirmer ou infirmer l'analyse de la facilit&eacute; d'emploi.<p>

<a name="243962">
<h4> Aspect 2 - Estimation de la vuln&eacute;rabilit&eacute; &#32;en exploitation</h4>
</a>D&eacute;finition<p>

Avant et pendant l'&eacute;tude des autres aspects de l'&eacute;valuation de la TOE, diverses vuln&eacute;rabilit&eacute;s dans l'exploitation de la TOE auront &eacute;t&eacute; identifi&eacute;es par le commanditaire et par l'&eacute;valuateur. Pour cet aspect de l'efficacit&eacute; ces vuln&eacute;rabilit&eacute;s connues sont estim&eacute;es pour d&eacute;terminer si elles pourraient dans la pratique compromettre la s&eacute;curit&eacute; de la TOE telle qu'elle est sp&eacute;cifi&eacute;e dans la cible de s&eacute;curit&eacute;.<p>

Exigences concernant le contenu et la pr&eacute;sentation<p>

La liste des vuln&eacute;rabilit&eacute;s connues fournie par le commanditaire doit identifier toutes les vuln&eacute;rabilit&eacute;s dont il a connaissance dans l'exploitation de la TOE. Elle doit identifier chaque vuln&eacute;rabilit&eacute; connue, fournir une analyse de son impact potentiel, et identifier les mesures propos&eacute;es ou fournies pour en parer les cons&eacute;quences.<p>

Exigences concernant les &eacute;l&eacute;ments de preuve<p>

L'analyse de l'impact potentiel de chacune des vuln&eacute;rabilit&eacute;s connues doit montrer que la vuln&eacute;rabilit&eacute; en question ne peut pas &ecirc;tre exploit&eacute;e dans l'environnement pr&eacute;vu pour la TOE, parce que &#32;:<p>

<ul>
<li>la vuln&eacute;rabilit&eacute; est convenablement couverte par d'autres m&eacute;canismes externes de s&eacute;curit&eacute; non compromis, ou

<li>il peut &ecirc;tre montr&eacute; que la vuln&eacute;rabilit&eacute; ne rel&egrave;ve pas de la cible de s&eacute;curit&eacute; ou ne sera pas exploitable en pratique.
</ul>L'analyse doit &ecirc;tre conduite en utilisant, au minimum, toutes les informations donn&eacute;es dans la figure 4 pour le niveau consid&eacute;r&eacute;. Toutes les mesures de s&eacute;curit&eacute; externes requises doivent avoir &eacute;t&eacute; d&eacute;finies dans la documentation appropri&eacute;e (ou doivent lui avoir &eacute;t&eacute; ajout&eacute;es).<p>

T&acirc;ches de l'&eacute;valuateur<p>

V&eacute;rifier que la liste des vuln&eacute;rabilit&eacute;s en exploitation qui sont connues satisfait &agrave; toutes les exigences indiqu&eacute;es ci-dessus concernant le contenu et la pr&eacute;sentation ainsi qu'&agrave; celles concernant les &eacute;l&eacute;ments de preuve. V&eacute;rifier que l'analyse de l'impact potentiel de chacune des vuln&eacute;rabilit&eacute;s a pris en compte toutes les informations dans la figure 4 pour le niveau consid&eacute;r&eacute;. Effectuer une analyse de vuln&eacute;rabilit&eacute; ind&eacute;pendante, en prenant en compte &agrave; la fois les vuln&eacute;rabilit&eacute;s en exploitation &eacute;num&eacute;r&eacute;es et toute autre d&eacute;couverte pendant l'&eacute;valuation. V&eacute;rifier que toutes les combinaisons de vuln&eacute;rabilit&eacute;s connues ont &eacute;t&eacute; prises en compte. V&eacute;rifier que l'analyse d'impact potentiel des vuln&eacute;rabilit&eacute;s ne contient pas d'hypoth&egrave;ses non document&eacute;es ou d&eacute;raisonnables concernant l'environnement pr&eacute;vu. V&eacute;rifier que toutes les hypoth&egrave;ses et toutes les exigences concernant des mesures de s&eacute;curit&eacute; externes ont &eacute;t&eacute; convenablement document&eacute;es. Effectuer des tests de p&eacute;n&eacute;tration pour confirmer ou infirmer que les vuln&eacute;rabilit&eacute;s connues sont r&eacute;ellement exploitables en pratique.<p>

<p>
INFORMATIONS OBTENUES D'UNE ESTIMATION DE LA CONFORMITE <br>UTILISEES POUR EFFECTUER UNE ANALYSE DE VULNERABILITE<img src="itsec.3.anc.gif">
<p>
Informations utilis&eacute;es dans une analyse de vuln&eacute;rabilit&eacute;

<TABLE BGCOLOR="#FF9933"><TR><TD WIDTH=100%>
<CENTER>
<BR><A HREF="/document/criteres.html">Index de la documentation sur les critères</A> | 
<A HREF="/document/index.html">Index général de la documentation</A>
<BR>
<A HREF="/document/docs/ITSEC/itsec.html">Sommaire</A> |
<A HREF="/document/docs/ITSEC/itsec-0.html">Introduction</A> |
<A HREF="/document/docs/ITSEC/itsec-1.html">Champ d'application</A> |
<A HREF="/document/docs/ITSEC/itsec-2.html">Fonctionnalité</A> 
<A HREF="/document/docs/ITSEC/itsec-3.html">Efficacité</A> |
<A HREF="/document/docs/ITSEC/itsec-4.html">Conformité</A> |
<A HREF="/document/docs/ITSEC/itsec-E1.html">Conformité E1</A> |
<A HREF="/document/docs/ITSEC/itsec-E2.html">Conformité E2</A> |
<A HREF="/document/docs/ITSEC/itsec-E3.html">Conformité E3</A> |
<A HREF="/document/docs/ITSEC/itsec-E4.html">Conformité E4</A> |
<A HREF="/document/docs/ITSEC/itsec-E5.html">Conformité E5</A> |
<A HREF="/document/docs/ITSEC/itsec-E6.html">Conformité E6</A>
<A HREF="/document/docs/ITSEC/itsec-5.html">Résultats de l'évaluation</A> |
<A HREF="/document/docs/ITSEC/itsec-6.html">Glossaire</A> |
<A HREF="/document/docs/ITSEC/itsec-A.html">Exemples de classes de Fonctionnalité</A> |
<A HREF="/document/docs/ITSEC/itsec-B.html">"Claims language"</A> |

<BR><BR><a href="itsec.html"><img alt="[Début]" border=0 src="/images/top.gif"></a> <a href="itsec-2.html"><img alt="[Précédente]" border=0 src="/images/prev.gif"></a> <a href="itsec-4.html"><img alt="[Suivante]" border=0 src="/images/next.gif"></a> <a href="itsec-B.html"><img alt="[Fin]" border=0 src="/images/bottom.gif"></a>
<BR><BR>
</TD></TR></TABLE>
</TD></TR></TABLE>
<HR>

<SMALL><A HREF="/courrier.html">
webmaster@scssi.gouv.fr</A>

- Copyright &copy 1999 Service Central de la Sécurité des Systèmes d'Information
<BR>Dernière mise à jour le 17/06/99 à 17:03:37
</SMALL>
</body>
</html>
