<html><head><title>SCSSI : SCSSI : ITSEC v1.2 Glossaire</title></head>
<body bgcolor=#ffffff>

<TABLE >
<TR><TD WIDTH=161><A HREF="/index.html"><IMG SRC="/images/sigle2.gif" ALT="Retour Page de Garde" ALIGN="TOP" BORDER="0"></A>
</TD><TD WIDTH=100%><CENTER>PREMIER MINISTRE</CENTER>
<P>
<CENTER><B><FONT SIZE=5>Service Central</FONT></B> <B><FONT SIZE=5>de la S&eacute;curit&eacute; des Syst&egrave;mes d'Information</FONT></B></CENTER>
</TD>
</TR>

</TABLE><HR>
<!                      >
<!                      >
<!                      >

<TABLE>
<TR><TD BGCOLOR="#96c7f8" WIDTH=161 VALIGN="TOP">
<BR>
<TABLE WIDTH=161>
<TR><TD BGCOLOR="#ffffff" WIDTH=161 ALIGN="center"><B>DOCUMENTATION</B></TD></TR>
<TR><TD ALIGN="left"><SMALL>
<A HREF="/document/index.html">Index</A> de la documentation<BR><BR>
EVALUATION
</SMALL>

<UL=COMPACT type="square">
<SMALL>
<LI><A HREF="/document/certif.html">Critères d'évaluation</A>
<LI><A HREF="/document/certif.html">Schéma de certification</A>
<LI><A HREF="/document/docs/GARDE/garde.html">Guides GARDE</A>
<LI><A HREF="/document/certif.html">Certificats et PP</A>
</SMALL>
</UL>

<SMALL>REGLEMENTATION</SMALL>
<UL=COMPACT type="square">
<SMALL>
<LI><A HREF="/document/chiffre.html">Cryptologie</A>
<LI><A HREF="/document/tempest.html">Domaine tempest</A>
<LI><A HREF="/document/ssi.html">Systèmes d'information</A>
</SMALL>
</UL>

<SMALL>
<A HREF="/document/methodes.html">METHODES</A><BR><BR>
<A HREF="/document/fiches/index.html">FICHES DE SYNTHESE</A>
</SMALL>

</TD></TR></TABLE>
<HR>

<TABLE WIDTH=161>
<TR><TD BGCOLOR="#ffffff" WIDTH=161 ALIGN="center"><B>AILLEURS SUR LE SITE</B></TD></TR>
<TR><TD ALIGN="left"><UL=COMPACT type="square"><SMALL>
<LI><A HREF="/index.html">Retour à la page d'accueil</A>
<LI><A HREF="/present/index.html">Présentation du SCSSI</A>
<LI><A HREF="/pratiq/index.html">Informations pratiques</A>
<LI><A HREF="/rubriq/index.html">Rubriques</A>
<LI><A HREF="/courrier.html">Courrier des lecteurs</A>
</SMALL></TD></TR></TABLE>

<BR>
</TD>
<!                    >
<!                    >
<!                    >

<TD WIDTH=31></TD>
<TD WIDTH=100% VALIGN=TOP>
<TABLE WIDTH=100%><TR>
<TD BGCOLOR="#FF9933" VALIGN=MIDDLE>
<BR>
<H2><CENTER>SCSSI : ITSEC v1.2 Glossaire</H2>
<A HREF="/document/criteres.html">Index de la documentation sur les critères</A> | 
<A HREF="/document/index.html">Index général de la documentation</A>
<BR>
<A HREF="/document/docs/ITSEC/itsec.html">Sommaire</A> |
<A HREF="/document/docs/ITSEC/itsec-0.html">Introduction</A> |
<A HREF="/document/docs/ITSEC/itsec-1.html">Champ d'application</A> |
<A HREF="/document/docs/ITSEC/itsec-2.html">Fonctionnalité</A> 
<A HREF="/document/docs/ITSEC/itsec-3.html">Efficacité</A> |
<A HREF="/document/docs/ITSEC/itsec-4.html">Conformité</A> |
<A HREF="/document/docs/ITSEC/itsec-E1.html">Conformité E1</A> |
<A HREF="/document/docs/ITSEC/itsec-E2.html">Conformité E2</A> |
<A HREF="/document/docs/ITSEC/itsec-E3.html">Conformité E3</A> |
<A HREF="/document/docs/ITSEC/itsec-E4.html">Conformité E4</A> |
<A HREF="/document/docs/ITSEC/itsec-E5.html">Conformité E5</A> |
<A HREF="/document/docs/ITSEC/itsec-E6.html">Conformité E6</A>
<A HREF="/document/docs/ITSEC/itsec-5.html">Résultats de l'évaluation</A> |
<A HREF="/document/docs/ITSEC/itsec-6.html">Glossaire</A> |
<A HREF="/document/docs/ITSEC/itsec-A.html">Exemples de classes de Fonctionnalité</A> |
<A HREF="/document/docs/ITSEC/itsec-B.html">"Claims language"</A> |

<BR><BR>
<a href="itsec.html"><img alt="[Début]" border=0 src="/images/top.gif"></a> <a href="itsec-5.html"><img alt="[Précédente]" border=0 src="/images/prev.gif"></a> <a href="itsec-A.html"><img alt="[Suivante]" border=0 src="/images/next.gif"></a> <a href="itsec-B.html"><img alt="[Fin]" border=0 src="/images/bottom.gif"></a>
<BR><BR>
</TD></TR></TABLE>
<a name="679218">
<center><h3> GLOSSAIRE ET REFERENCES</h3></center>
</a><a name="679034">
<h4> Introduction</h4>
</a>Ce chapitre contient les d&eacute;finitions des termes techniques utilis&eacute;s avec une signification sp&eacute;cifique &agrave; ce document. Les termes techniques utilis&eacute;s dans le pr&eacute;sent document qui ne sont pas d&eacute;finis ici sont employ&eacute;s dans tout le document dans un sens conforme &agrave; leur acception courante.<p>

<a name="679036">
<h4> D&eacute;finitions</h4>
</a>Note du Traducteur &#32;: &agrave; chaque terme sont associ&eacute;s, entre parenth&egrave;ses, le terme anglais et le num&eacute;ro du paragraphe correspondant dans la version anglaise.<p>

<strong>Accr&eacute;ditation</strong> (accreditation - 6.3b) &#32;: proc&eacute;dure par laquelle on reconnait &agrave; la fois la comp&eacute;tence technique et l'impartialit&eacute; d'un laboratoire de test pour mener ses t&acirc;ches particuli&egrave;res.<p>

<strong>Administrateur</strong> (administrator - 6.5) &#32;: personne en contact avec la cible d'&eacute;valuation qui est responsable de son maintien en condition d'exploitation.<p>

<strong>Argumentaire de produit</strong> (product rationale - 6.49) &#32;: description des capacit&eacute;s d'un produit en mati&egrave;re de s&eacute;curit&eacute;, donnant les informations n&eacute;cessaires &agrave; un acheteur potentiel pour d&eacute;cider si ce produit va l'aider &agrave; satisfaire aux objectifs de s&eacute;curit&eacute; de son syst&egrave;me.<p>

<strong>Assurance</strong> (assurance - 6.7) &#32;: confiance qui peut &ecirc;tre accord&eacute;e &agrave; la s&eacute;curit&eacute; fournie par une cible d'&eacute;valuation.<p>

<strong>Canal cach&eacute;</strong> (covert channel - 6.21) &#32;: utilisation d'un m&eacute;canisme non pr&eacute;vu pour la communication, pour transf&eacute;rer des informations d'une mani&egrave;re qui viole la s&eacute;curit&eacute;.<p>

<strong>Certification</strong> (certification - 6.12) &#32;: d&eacute;livrance d'une d&eacute;claration formelle confirmant les r&eacute;sultats d'une &eacute;valuation, et le fait que les crit&egrave;res d'&eacute;valuation utilis&eacute;s ont &eacute;t&eacute; correctement appliqu&eacute;s.<p>

<strong>Cible de s&eacute;curit&eacute;</strong> (security target - 6.63) &#32;: sp&eacute;cification de la s&eacute;curit&eacute; qui est exig&eacute;e d'une cible d'&eacute;valuation et qui sert de base pour l'&eacute;valuation. La cible de s&eacute;curit&eacute; doit sp&eacute;cifier les fonctions d&eacute;di&eacute;es &agrave; la s&eacute;curit&eacute; de la cible d'&eacute;valuation. Elle sp&eacute;cifiera aussi les objectifs de s&eacute;curit&eacute;, les menaces qui p&egrave;sent sur ces objectifs ainsi que les m&eacute;canismes de s&eacute;curit&eacute; particuliers qui seront employ&eacute;s.<p>

<strong>Cible d'&eacute;valuation</strong> (target of evaluation - 6.71) &#32;: syst&egrave;me ou produit TI qui est soumis &agrave; une &eacute;valuation de la s&eacute;curit&eacute;.<p>

<strong>Classe de fonctionnalit&eacute;</strong> (functionality class - 6.39) &#32;: ensemble pr&eacute;d&eacute;fini de fonctions compl&eacute;mentaires d&eacute;di&eacute;es &agrave; la s&eacute;curit&eacute; qui peuvent &ecirc;tre impl&eacute;ment&eacute;es dans une cible d'&eacute;valuation.<p>

<strong>Client</strong> (customer - 6.23) &#32;: personne ou organisme qui ach&egrave;te une cible d'&eacute;valuation.<p>

<strong>Coh&eacute;sion de la fonctionnalit&eacute;</strong> (binding of functionality - 6.11) &#32;: aspect de l'estimation de l'efficacit&eacute; d'une cible d'&eacute;valuation qui recouvre la capacit&eacute; de ses fonctions et m&eacute;canismes d&eacute;di&eacute;s &agrave; la s&eacute;curit&eacute; &agrave; coop&eacute;rer pour former un ensemble int&eacute;gr&eacute; et efficace.<p>

<strong>Commanditaire</strong> (sponsor - 6.64) &#32;: personne ou organisme qui demande une &eacute;valuation.<p>

<strong>Composant</strong> (component - 6.14) &#32;: partie identifiable et autonome d'une cible d'&eacute;valuation.<p>

<strong>Composant &eacute;l&eacute;mentaire</strong> (basic component - 6.10) &#32;: composant identifiable au niveau hi&eacute;rarchique le plus bas de la sp&eacute;cification produite au cours de la conception d&eacute;taill&eacute;e.<p>

<strong>Conception d&eacute;taill&eacute;e</strong> (detailed design - 6.25) &#32;: phase du processus de d&eacute;veloppement dans laquelle la d&eacute;finition de haut niveau et la conception g&eacute;n&eacute;rale d'une cible d'&eacute;valuation est affin&eacute;e et pouss&eacute;e &agrave; un niveau de d&eacute;tail qui peut servir de base &agrave; la r&eacute;alisation.<p>

<strong>Conception g&eacute;n&eacute;rale</strong> (architectural design - 6.6) &#32;: phase du processus de d&eacute;veloppement dans laquelle sont sp&eacute;cifi&eacute;es la d&eacute;finition et la conception de haut niveau d'une cible d'&eacute;valuation.<p>

<strong>Confidentialit&eacute;</strong> (confidentiality - 6.15) &#32;: pr&eacute;vention de la divulgation non autoris&eacute;e de l'information.<p>

<strong>Configuration</strong> (configuration - 6.16) &#32;: s&eacute;lection de l'un des ensembles de combinaisons possibles de caract&eacute;ristiques d'une cible d'&eacute;valuation.<p>

<strong>Conformit&eacute;</strong> (correctness - 6.20) &#32;: propri&eacute;t&eacute; d'une repr&eacute;sentation d'une cible d'&eacute;valuation qui fait qu'elle refl&egrave;te exactement la cible de s&eacute;curit&eacute; pr&eacute;sent&eacute;e pour ce syst&egrave;me ou ce produit.<p>

<strong>Construction</strong> (construction - 6.18) &#32;: processus de cr&eacute;ation d'une cible d'&eacute;valuation.<p>

<strong>Cotation</strong> (rating - 6.52) &#32;: mesure de l'assurance qui peut &ecirc;tre accord&eacute;e &agrave; une cible d'&eacute;valuation, consistant en une r&eacute;f&eacute;rence &agrave; sa cible de s&eacute;curit&eacute;, un niveau d'&eacute;valuation &eacute;tabli apr&egrave;s estimation de la conformit&eacute; de sa r&eacute;alisation et prise en consid&eacute;ration de son efficacit&eacute; dans le contexte de son exploitation r&eacute;elle ou pr&eacute;vue, et une cotation confirm&eacute;e de la r&eacute;sistance minimum de ses m&eacute;canismes de s&eacute;curit&eacute;.<p>

<strong>D&eacute;di&eacute; &agrave; la s&eacute;curit&eacute;</strong> (security enforcing - 6.58) &#32;: qui contribue directement &agrave; satisfaire aux objectifs de s&eacute;curit&eacute; de la cible d'&eacute;valuation.<p>

<strong>D&eacute;veloppeur</strong> (developer - 6.26) &#32;: personne ou organisme qui fabrique une cible d'&eacute;valuation.<p>

<strong>Disponibilit&eacute;</strong> (availability - 6.9) &#32;: pr&eacute;vention d'un d&eacute;ni non autoris&eacute; d'acc&egrave;s &agrave; l'information ou &agrave; des ressources.<p>

<strong>Documentation</strong> (documentation - 6.30) &#32;: information &eacute;crite (ou autrement enregistr&eacute;e) concernant une cible d'&eacute;valuation exig&eacute;e pour une &eacute;valuation. Cette information peut, mais ce n'est pas imp&eacute;ratif, &ecirc;tre rassembl&eacute;e en un seul document constitu&eacute; dans ce but.<p>

<strong>Documentation d'administration</strong> (administration documentation - 6.4) &#32;: information sur une cible d'&eacute;valuation fournie par le d&eacute;veloppeur &agrave; l'usage d'un administrateur.<p>

<strong>Documentation d'exploitation</strong> (operational documentation - 6.45) &#32;: information fournie par le d&eacute;veloppeur d'une cible d'&eacute;valuation pour sp&eacute;cifier et expliquer comment les clients devront l'utiliser.<p>

<strong>Documentation utilisateur</strong> (user documentation - 6.75) &#32;: information sur une cible d'&eacute;valuation fournie par le d&eacute;veloppeur &agrave; l'usage de ses utilisateurs finals.<p>

<strong>Efficacit&eacute;</strong> (effectiveness - 6.32) &#32;: propri&eacute;t&eacute; d'une cible d'&eacute;valuation qui repr&eacute;sente la mesure dans laquelle elle assure la s&eacute;curit&eacute; dans le contexte de son exploitation r&eacute;elle ou pr&eacute;vue.<p>

<strong>Environnement de d&eacute;veloppement</strong> (development environment - 6.28) &#32;: ensemble des mesures d'organisation, des proc&eacute;dures et des normes utilis&eacute;es au cours de la construction d'une cible d'&eacute;valuation.<p>

<strong>Environnement d'exploitation</strong> (operational environment - 6.46) &#32;: mesures d'organisation, proc&eacute;dures et normes qui doivent &ecirc;tre utilis&eacute;es au cours de l'exploitation d'une cible d'&eacute;valuation.<p>

<strong>Estimation de la vuln&eacute;rabilit&eacute;</strong> (vulnerability assessment - 6.77) &#32;: aspect de l'estimation de l'efficacit&eacute; d'une cible d'&eacute;valuation qui recouvre la mesure dans laquelle des vuln&eacute;rabilit&eacute;s connues dans la cible d'&eacute;valuation pourraient compromettre en pratique sa s&eacute;curit&eacute; telle qu'elle est sp&eacute;cifi&eacute;e dans la cible de s&eacute;curit&eacute;.<p>

<strong>Evaluateur</strong> (evaluator - 6.35) &#32;: personne ou organisme ind&eacute;pendant qui effectue une &eacute;valuation.<p>

<strong>Evaluation</strong> (evaluation - 6.34) &#32;: estimation d'un syst&egrave;me ou d'un produit TI par rapport &agrave; des crit&egrave;res d'&eacute;valuation d&eacute;finis.<p>

<strong>Exigences concernant le contenu et la pr&eacute;sentation</strong> (requirements for content and presentation - 6.54) &#32;: partie des crit&egrave;res d'&eacute;valuation pour une phase ou un aspect particulier de l'&eacute;valuation qui explicite ce que chaque &eacute;l&eacute;ment de documentation identifi&eacute; comme relevant de cette phase ou de cet aspect doit contenir, et comment les informations qu'il contient doivent &ecirc;tre pr&eacute;sent&eacute;es.<p>

<strong>Exigences concernant les &eacute;l&eacute;ments de preuve</strong> (requirements for evidence - 6.55) &#32;: partie des crit&egrave;res d'&eacute;valuation pour une phase ou un aspect particulier de l'&eacute;valuation qui d&eacute;finit la nature des &eacute;l&eacute;ments de preuve destin&eacute;s &agrave; montrer que les crit&egrave;res relatifs &agrave; cette phase ou &agrave; cet aspect sont satisfaits.<p>

<strong>Exigences concernant les proc&eacute;dures et les normes</strong> (requirements for procedures and standards - 6.56) &#32;: partie des crit&egrave;res d'&eacute;valuation pour une phase ou un aspect particulier de l'&eacute;valuation qui identifie la nature et/ou le contenu des proc&eacute;dures ou des approches normalis&eacute;es qui doivent &ecirc;tre adopt&eacute;es ou utilis&eacute;es quand la TOE est en exploitation r&eacute;elle.<p>

<strong>Exploitation</strong> (operation - 6.44) &#32;: processus d'utilisation d'une cible d'&eacute;valuation.<p>

<strong>Facilit&eacute; d'emploi</strong> (ease of use - 6.31) &#32;: aspect de l'estimation de l'efficacit&eacute; d'une cible d'&eacute;valuation consistant &agrave; assurer qu'elle ne peut pas &ecirc;tre configur&eacute;e ou utilis&eacute;e d'une mani&egrave;re non s&ucirc;re, mais qu'un administrateur ou un utilisateur final pourrait raisonnablement croire s&ucirc;re.<p>

<strong>Gestion de configuration</strong> (configuration control - 6.17) &#32;: syst&egrave;me de contr&ocirc;le impos&eacute; au changement d'objets sous contr&ocirc;le, produits au cours des processus de d&eacute;veloppement, de fabrication et de maintenance d'une cible d'&eacute;valuation.<p>

<strong>Homologation</strong> (accreditation - 6.3a) &#32;: proc&eacute;dure de r&eacute;ception d'un syst&egrave;me TI destin&eacute; &agrave; &ecirc;tre utilis&eacute; dans un environnement particulier.<p>

<strong>Int&eacute;grit&eacute;</strong> (integrity - 6.41) &#32;: pr&eacute;vention d'une modification non autoris&eacute;e de l'information.<p>

<strong>Langages de programmation et compilateurs</strong> (programming languages and compilers - 6.51) &#32;: outils de l'environnement de d&eacute;veloppement utilis&eacute;s dans la construction du logiciel et/ou du microprogramme d'une cible d'&eacute;valuation.<p>

<strong>Livraison</strong> (delivery - 6.24) &#32;: processus par lequel une copie de la cible d'&eacute;valuation est transf&eacute;r&eacute;e du d&eacute;veloppeur &agrave; un client.<p>

<strong>M&eacute;canismes de s&eacute;curit&eacute;</strong> (security mechanism - 6.59) &#32;: logique ou algorithme qui impl&eacute;mente par mat&eacute;riel ou logiciel une fonction particuli&egrave;re d&eacute;di&eacute;e &agrave; la s&eacute;curit&eacute; ou contribuant &agrave; la s&eacute;curit&eacute;.<p>

<strong>Mod&egrave;le formel de politique de s&eacute;curit&eacute;</strong> (formal model of security policy - 6.37) &#32;: mod&egrave;le sous-jacent de politique de s&eacute;curit&eacute; exprim&eacute; en style formel, c'est &agrave; dire une pr&eacute;sentation abstraite des principes de s&eacute;curit&eacute; importants qu'une TOE devra faire respecter.<p>

<strong>M&eacute;canisme critique</strong> (critical mechanism - 6.22) &#32;: m&eacute;canisme interne d'une cible d'&eacute;valuation dont la d&eacute;faillance cr&eacute;erait une faiblesse dans la s&eacute;curit&eacute;.<p>

<strong>Menace</strong> (threat - 6.73) &#32;: action ou &eacute;v&eacute;nement susceptible de porter pr&eacute;judice &agrave; la s&eacute;curit&eacute;.<p>

<strong>Objectifs de s&eacute;curit&eacute;</strong> (security objectives - 6.60) &#32;: contribution &agrave; la s&eacute;curit&eacute; qu'une cible d'&eacute;valuation est destin&eacute;e &agrave; apporter.<p>

<strong>Objet</strong> (object - 6.42) &#32;: entit&eacute; passive qui contient ou re&ccedil;oit des informations.<p>

<strong>Objet de stockage</strong> (storage object - 6.65) &#32;: objet qui supporte &agrave; la fois des acc&egrave;s en lecture et en &eacute;criture [TCSEC].<p>

<strong>Organisme de certification</strong> (certification body - 6.13) &#32;: organisme national ind&eacute;pendant et impartial qui effectue des certifications.<p>

<strong>Outil</strong> (tool - 6.74) &#32;: produit utilis&eacute; pour la construction et/ou la documentation d'une cible d'&eacute;valuation.<p>

<strong>Pertinence de la fonctionnalit&eacute;</strong> (suitability of functionality - 6.68) &#32;: aspect de l'estimation de l'efficacit&eacute; d'une cible d'&eacute;valuation qui recouvre la pertinence des fonctions et des m&eacute;canismes de s&eacute;curit&eacute; de la cible d'&eacute;valuation pour r&eacute;ellement contrer les menaces envers la s&eacute;curit&eacute; de la cible d'&eacute;valuation, identifi&eacute;es dans sa cible de s&eacute;curit&eacute;.<p>

<strong>Politique de s&eacute;curit&eacute;</strong> (security policy - 6.61) &#32;: voir "politique de s&eacute;curit&eacute; interne", "politique de s&eacute;curit&eacute; d'un syst&egrave;me", "politique de s&eacute;curit&eacute; technique".<p>

<strong>Politique de s&eacute;curit&eacute; d'un syst&egrave;me</strong> (system security policy - 6.70) &#32;: ensemble des lois, r&egrave;gles et pratiques qui r&eacute;gissent la fa&ccedil;on dont l'information sensible et les autres ressources sont g&eacute;r&eacute;es, prot&eacute;g&eacute;es et distribu&eacute;es &agrave; l'int&eacute;rieur d'un syst&egrave;me sp&eacute;cifique.<p>

<strong>Politique de s&eacute;curit&eacute; interne</strong> (corporate security policy - 6.19) &#32;: ensemble des lois, r&egrave;gles et pratiques qui r&eacute;gissent la fa&ccedil;on dont les biens, y compris les informations sensibles, sont g&eacute;r&eacute;s, prot&eacute;g&eacute;s et distribu&eacute;s au sein d'un organisme utilisateur.<p>

<strong>Politique de s&eacute;curit&eacute; technique</strong> (technical security policy - 6.72) &#32;: ensemble des lois, r&egrave;gles et pratiques qui r&eacute;gissent le traitement des informations sensibles et l'utilisation des ressources par le mat&eacute;riel et le logiciel d'un syst&egrave;me ou d'un produit TI.<p>

<strong>Proc&eacute;dure d'exploitation</strong> (operating procedure - 6.43) &#32;: ensemble de r&egrave;gles d&eacute;finissant l'emploi correct d'une cible d'&eacute;valuation.<p>

<strong>Proc&eacute;dure de r&eacute;ception</strong> (acceptance procedure - 6.2) &#32;: proc&eacute;dure utilis&eacute;e pour prendre les objets produits au cours des processus de d&eacute;veloppement, production et maintenance d'une cible d'&eacute;valuation et les placer d&eacute;lib&eacute;r&eacute;ment sous le contr&ocirc;le d'un syst&egrave;me de gestion de configuration.<p>

<strong>Processus de d&eacute;veloppement</strong> (development process - 6.29) &#32;: ensemble des phases et des t&acirc;ches par lesquelles une cible d'&eacute;valuation est construite et qui traduisent les sp&eacute;cifications en mat&eacute;riel et logiciel r&eacute;els.<p>

<strong>Production</strong> (production - 6.50) &#32;: processus par lequel des copies d'une cible d'&eacute;valuation sont g&eacute;n&eacute;r&eacute;es pour &ecirc;tre distribu&eacute;es aux clients.<p>

<strong>Produit</strong> (product - 6.48) &#32;: paquetage logiciel et/ou mat&eacute;riel TI qui assure une fonctionnalit&eacute; con&ccedil;ue pour &ecirc;tre utilis&eacute;e ou incorpor&eacute;e au sein de multiples syst&egrave;mes.<p>

<strong>Profil d'assurance</strong> (assurance profile - 6.8) &#32;: exigence d'assurance pour une TOE dans laquelle diff&eacute;rents degr&eacute;s de confiance sont exig&eacute;s pour diff&eacute;rentes fonctions d&eacute;di&eacute;es &agrave; la s&eacute;curit&eacute;.<p>

<strong>R&eacute;alisation</strong> (implementation - 6.40) &#32;: phase du processus de d&eacute;veloppement dans laquelle la sp&eacute;cification d&eacute;taill&eacute;e d'une cible d'&eacute;valuation est traduite en mat&eacute;riels et logiciels r&eacute;els.<p>

<strong>R&eacute;sistance des m&eacute;canismes</strong> (strength of mechanism - 6.66) &#32;: aspect de l'estimation de l'efficacit&eacute; d'une cible d'&eacute;valuation qui recouvre la capacit&eacute; de ses m&eacute;canismes de s&eacute;curit&eacute; &agrave; r&eacute;sister &agrave; une attaque directe contre des d&eacute;fauts dans les algorithmes, les principes et les propri&eacute;t&eacute;s sous-jacents.<p>

<strong>S&eacute;curit&eacute;</strong> (security - 6.57) &#32;: combinaison de confidentialit&eacute;, d'int&eacute;grit&eacute; et de disponibilit&eacute;.<p>

<strong>S&eacute;curit&eacute; du d&eacute;veloppeur</strong> (developer security - 6.27) &#32;: ensemble des contr&ocirc;les de s&eacute;curit&eacute; physiques, organisationnels ou relatifs au personnel, impos&eacute;s par un d&eacute;veloppeur &agrave; son environnement de d&eacute;veloppement.<p>

<strong>Sp&eacute;cification des besoins</strong> (requirements - 6.53) &#32;: phase du processus de d&eacute;veloppement dans laquelle la cible de s&eacute;curit&eacute; d'une cible d'&eacute;valuation est produite.<p>

<strong>Sujet</strong> (subject - 6.67) &#32;: entit&eacute; active, g&eacute;n&eacute;ralement une personne, un processus ou un &eacute;quipement [TCSEC].<p>

<strong>Syst&egrave;me</strong> (system - 6.69) &#32;: installation sp&eacute;cifique de TI, avec un but et un environnement d'exploitation particuliers.<p>

<strong>T&acirc;ches de l'&eacute;valuateur</strong> (evaluator actions - 6.36) &#32;: partie des crit&egrave;res d'&eacute;valuation pour une phase ou un aspect particulier de l'&eacute;valuation identifiant ce que l'&eacute;valuateur doit faire pour v&eacute;rifier les informations fournies par le commanditaire de l'&eacute;valuation, et les actions compl&eacute;mentaires qu'il doit effectuer.<p>

<strong>Test de p&eacute;n&eacute;tration</strong> (penetration testing - 6.47) &#32;: tests effectu&eacute;s par un &eacute;valuateur sur une cible d'&eacute;valuation pour confirmer si oui ou non les vuln&eacute;rabilit&eacute;s connues sont r&eacute;ellement exploitables en pratique.<p>

<strong>Touchant &agrave; la s&eacute;curit&eacute;</strong> (security relevant - 6.62) &#32;: qui n'est pas d&eacute;di&eacute; &agrave; la s&eacute;curit&eacute;, mais qui doit fonctionner correctement pour que la cible d'&eacute;valuation puisse faire respecter la s&eacute;curit&eacute;.<p>

<strong>Unit&eacute; fonctionnelle</strong> (functional unit - 6.38) &#32;: partie d'un composant &eacute;l&eacute;mentaire fonctionnellement distincte.<p>

<strong>Utilisateur final</strong> (end-user - 6.33) &#32;: personne en contact avec une cible d'&eacute;valuation qui n'utilise que ses capacit&eacute;s op&eacute;rationnelles.<p>

<strong>Vuln&eacute;rabilit&eacute;</strong> (vulnerability - 6.76) &#32;: faiblesse de la s&eacute;curit&eacute; d'une cible d'&eacute;valuation (due par exemple &agrave; des d&eacute;fauts dans l'analyse, la conception, la r&eacute;alisation ou l'exploitation).<p>

<a name="679115">
<h4> R&eacute;f&eacute;rences</h4>
</a>(6.78)	Dans ce document, il est fait r&eacute;f&eacute;rence aux ouvrages et articles suivants &#32;:<p>

<pre><a name="679117">
AND	Computer Security Technology Planning Study<br>J.P. Anderson<br>ESD-TR-73-51, ESD/AFSC, US Air Force, Bedford, Mass., October 1972.
</a>
<a name="679118">
BLP	Secure Computer Systems &#32;: Unified Exposition and Multics Interpretation<br>D.E.Bell and L.J. LaPadula<br>Report MTR-2997 Rev. 1, MITRE Corporation, Bedford, MASS, 1976
</a>
<a name="679119">
BNM	The Chinese Wall Security Policy<br>D.F.C. Brewer and M.J. Nash<br>Proceedings of the IEEE Symposium on Security and Privacy,<br>Oakland, May 1989, p. 206-214
</a>
<a name="679120">
CESG3	UK Systems Security Confidence Levels, CESG Memorandum No. 3,<br>Communications-Electronics Security Group, United Kingdom, January 1989.
</a>
<a name="679121">
CWM	A Comparison of Commercial and Military Computer Security Policies<br>D.D. Clark and D.R. Wilson<br>Proceedings of the IEEE Symposium on Security and Privacy, Oakland,<br>April 1987, pp. 184-194.
</a>
<a name="679122">
DTIEC	DTI Commercial Computer Security Centre Evaluation Levels Manual, V22,<br>Department of Trade and Industry, United Kingdom, February 1989.
</a>
<a name="679123">
DTIFN	DTI Commercial Computer Security Centre Security Functionality Manual, V21<br>Department of Trade and Industry, United Kingdom, February 1989.
</a>
<a name="679124">
EZBM	Mandatory Policy &#32;: Secure Systems Model<br>G. Eizenberg<br>ONERA/CERT/DERI, Toulouse, France, undated
</a>
<a name="679125">
GYPSY	Report on Gypsy 2.05<br>D.I. Good, R.L. Akers and L.M. Smith<br>Report ICSCA-CMP-48, University of Texas at Austin, February 1986
</a>
<a name="679126">
IJRM	The Ina Jo Specification Language Reference Manual<br>Unisys Corporation<br>Culver City, California, United States of America, 1989.
</a>
<a name="679127">
JSD	System Development<br>M.A. Jackson<br>Prentice-Hall International, 1983.
</a>
<a name="679128">
JSP	Principles of Program Design<br>M.A. Jackson<br>Academic Press, New-York, 1975.
</a>
<a name="679129">
LOTOS	Information Processing Systems - Open Systems Interconnection - LOTOS -<br>A formal Description Technique Based On the Temporal Ordering of Observational Behaviour<br>International Standard ISO 8807<br>International Organization for Standardization, 1989.
</a>
<a name="679130">
LWM	A Security Model for Military Message Systems<br>C.E. Landwehr, C.L. Heitmeyer and J. McLean<br>ACM Transactions on Computer Systems, Vol. 2 No. 3, August 1984,<br>pp. &#32;198-222.
</a>
<a name="679131">
OSI	Information Processing Systems - Open Systems Interconnection - Basic Reference Model - part 2 &#32;: Security Architecture<br>International Standard ISO 7498-2<br>International Organization for Standardization, 1988.
</a>
<a name="679132">
RSL	RAISE Specification Language Reference Manual<br>Raise/CRI/DOC/2/V1<br>Computer Resources International A/S<br>Birkerod, Denmark, 1990.
</a>
<a name="679133">
SADT	An Introduction to SADT<br>Structured Analysis and Design Technique<br>Report 9022-78R<br>SofTech Inc, 460 Totten Pond Road<br>Waltham, MA 02154, USA, November 1976.
</a>
<a name="679134">
SCSSI	Catalogue de Crit&egrave;res Destin&eacute;s &agrave; &eacute;valuer le Degr&eacute; de Confiance des Syst&egrave;mes d'Information, 692/SGDN/DISSI/SCSSI<br>Service Central de la S&eacute;curit&eacute; des Syst&egrave;mes d'Information, Juillet 1989.
</a>
<a name="679135">
SSADM	The SSADM Manual, ISBN 085-012-527-X<br>National Computing Centre Limited<br>Manchester, United Kingdom, 1989.
</a>
<a name="679136">
SSVDM	Systematic Software Development Using VDM<br>C.B. Jones<br>Prentice Hall International, 1990.
</a>
<a name="679137">
TCSEC	Trusted Computer Systems Evaluation Criteria, DOD 5200.28-STD,<br>Department of Defense, United States of America, December 1985.
</a>
<a name="679138">
YSM	A Note on the Yourdon Structured Method<br>A.J. Bowles<br>Yourdon Inc<br>ACM SIGSOFT Software Engineering Notes<br>Vol. 15 No. 2 April 1990, p. 27.
</a>
<a name="679139">
ZRM	The Z Notation &#32;: A Reference Manual, ISBN-0-13-983768-X<br>J.M. Spivey<br>Prentice Hall International, 1988.
</a>
<a name="679140">
ZSIEC	Criteria for the Evaluation of Trustworthiness of Information Technology (IT) Systems, ISBN 3-88784-200-6,<br>German Information Security Agency (Bundesamt f&uuml;r Sicherheit in der Informationstechnik), Federal Republic of Germany, January 1989.
</a>
</pre>
<TABLE BGCOLOR="#FF9933"><TR><TD WIDTH=100%>
<CENTER>
<BR><A HREF="/document/criteres.html">Index de la documentation sur les critères</A> | 
<A HREF="/document/index.html">Index général de la documentation</A>
<BR>
<A HREF="/document/docs/ITSEC/itsec.html">Sommaire</A> |
<A HREF="/document/docs/ITSEC/itsec-0.html">Introduction</A> |
<A HREF="/document/docs/ITSEC/itsec-1.html">Champ d'application</A> |
<A HREF="/document/docs/ITSEC/itsec-2.html">Fonctionnalité</A> 
<A HREF="/document/docs/ITSEC/itsec-3.html">Efficacité</A> |
<A HREF="/document/docs/ITSEC/itsec-4.html">Conformité</A> |
<A HREF="/document/docs/ITSEC/itsec-E1.html">Conformité E1</A> |
<A HREF="/document/docs/ITSEC/itsec-E2.html">Conformité E2</A> |
<A HREF="/document/docs/ITSEC/itsec-E3.html">Conformité E3</A> |
<A HREF="/document/docs/ITSEC/itsec-E4.html">Conformité E4</A> |
<A HREF="/document/docs/ITSEC/itsec-E5.html">Conformité E5</A> |
<A HREF="/document/docs/ITSEC/itsec-E6.html">Conformité E6</A>
<A HREF="/document/docs/ITSEC/itsec-5.html">Résultats de l'évaluation</A> |
<A HREF="/document/docs/ITSEC/itsec-6.html">Glossaire</A> |
<A HREF="/document/docs/ITSEC/itsec-A.html">Exemples de classes de Fonctionnalité</A> |
<A HREF="/document/docs/ITSEC/itsec-B.html">"Claims language"</A> |

<BR><BR><a href="itsec.html"><img alt="[Début]" border=0 src="/images/top.gif"></a> <a href="itsec-5.html"><img alt="[Précédente]" border=0 src="/images/prev.gif"></a> <a href="itsec-A.html"><img alt="[Suivante]" border=0 src="/images/next.gif"></a> <a href="itsec-B.html"><img alt="[Fin]" border=0 src="/images/bottom.gif"></a>
<BR><BR>
</TD></TR></TABLE>
</TD></TR></TABLE>
<HR>

<SMALL><A HREF="/courrier.html">
webmaster@scssi.gouv.fr</A>

- Copyright &copy 1999 Service Central de la Sécurité des Systèmes d'Information
<BR>Dernière mise à jour le 17/06/99 à 17:04:21
</SMALL>
</body>
</html>
