<html><head><title>SCSSI : ITSEC v1.2 Introduction</title></head>
<body bgcolor=#ffffff>

<TABLE >
<TR><TD WIDTH=161><A HREF="/index.html"><IMG SRC="/images/sigle2.gif" ALT="Retour Page de Garde" ALIGN="TOP" BORDER="0"></A>
</TD><TD WIDTH=100%><CENTER>PREMIER MINISTRE</CENTER>
<P>
<CENTER><B><FONT SIZE=5>Service Central</FONT></B> <B><FONT SIZE=5>de la S&eacute;curit&eacute; des Syst&egrave;mes d'Information</FONT></B></CENTER>
</TD>
</TR>

</TABLE><HR>
<!                      >
<!                      >
<!                      >

<TABLE>
<TR><TD BGCOLOR="#96c7f8" WIDTH=161 VALIGN="TOP">
<BR>
<TABLE WIDTH=161>
<TR><TD BGCOLOR="#ffffff" WIDTH=161 ALIGN="center"><B>DOCUMENTATION</B></TD></TR>
<TR><TD ALIGN="left"><SMALL>
<A HREF="/document/index.html">Index</A> de la documentation<BR><BR>
EVALUATION
</SMALL>

<UL=COMPACT type="square">
<SMALL>
<LI><A HREF="/document/certif.html">Critères d'évaluation</A>
<LI><A HREF="/document/certif.html">Schéma de certification</A>
<LI><A HREF="/document/docs/GARDE/garde.html">Guides GARDE</A>
<LI><A HREF="/document/certif.html">Certificats et PP</A>
</SMALL>
</UL>

<SMALL>REGLEMENTATION</SMALL>
<UL=COMPACT type="square">
<SMALL>
<LI><A HREF="/document/chiffre.html">Cryptologie</A>
<LI><A HREF="/document/tempest.html">Domaine tempest</A>
<LI><A HREF="/document/ssi.html">Systèmes d'information</A>
</SMALL>
</UL>

<SMALL>
<A HREF="/document/methodes.html">METHODES</A><BR><BR>
<A HREF="/document/fiches/index.html">FICHES DE SYNTHESE</A>
</SMALL>

</TD></TR></TABLE>
<HR>

<TABLE WIDTH=161>
<TR><TD BGCOLOR="#ffffff" WIDTH=161 ALIGN="center"><B>AILLEURS SUR LE SITE</B></TD></TR>
<TR><TD ALIGN="left"><UL=COMPACT type="square"><SMALL>
<LI><A HREF="/index.html">Retour à la page d'accueil</A>
<LI><A HREF="/present/index.html">Présentation du SCSSI</A>
<LI><A HREF="/pratiq/index.html">Informations pratiques</A>
<LI><A HREF="/rubriq/index.html">Rubriques</A>
<LI><A HREF="/courrier.html">Courrier des lecteurs</A>
</SMALL></TD></TR></TABLE>

<BR>
</TD>
<!                    >
<!                    >
<!                    >

<TD WIDTH=31></TD>
<TD WIDTH=100% VALIGN=TOP>
<TABLE WIDTH=100%><TR>
<TD BGCOLOR="#FF9933" VALIGN=MIDDLE>
<BR>
<H2><CENTER>ITSEC v1.2 Introduction</H2>
<A HREF="/document/criteres.html">Index de la documentation sur les critères</A> | 
<A HREF="/document/index.html">Index général de la documentation</A>
<BR>
<A HREF="/document/docs/ITSEC/itsec.html">Sommaire</A> |
<A HREF="/document/docs/ITSEC/itsec-0.html">Introduction</A> |
<A HREF="/document/docs/ITSEC/itsec-1.html">Champ d'application</A> |
<A HREF="/document/docs/ITSEC/itsec-2.html">Fonctionnalité</A> 
<A HREF="/document/docs/ITSEC/itsec-3.html">Efficacité</A> |
<A HREF="/document/docs/ITSEC/itsec-4.html">Conformité</A> |
<A HREF="/document/docs/ITSEC/itsec-E1.html">Conformité E1</A> |
<A HREF="/document/docs/ITSEC/itsec-E2.html">Conformité E2</A> |
<A HREF="/document/docs/ITSEC/itsec-E3.html">Conformité E3</A> |
<A HREF="/document/docs/ITSEC/itsec-E4.html">Conformité E4</A> |
<A HREF="/document/docs/ITSEC/itsec-E5.html">Conformité E5</A> |
<A HREF="/document/docs/ITSEC/itsec-E6.html">Conformité E6</A>
<A HREF="/document/docs/ITSEC/itsec-5.html">Résultats de l'évaluation</A> |
<A HREF="/document/docs/ITSEC/itsec-6.html">Glossaire</A> |
<A HREF="/document/docs/ITSEC/itsec-A.html">Exemples de classes de Fonctionnalité</A> |
<A HREF="/document/docs/ITSEC/itsec-B.html">"Claims language"</A> |

<BR><BR>
<a href="itsec.html"><img alt="[Début]" border=0 src="/images/top.gif"></a> <a href="itsec.html"><img alt="[Précédente]" border=0 src="/images/prev.gif"></a> <a href="itsec-1.html"><img alt="[Suivante]" border=0 src="/images/next.gif"></a> <a href="itsec-B.html"><img alt="[Fin]" border=0 src="/images/bottom.gif"></a>
<BR><BR>
</TD></TR></TABLE>
<a name="692">
<center><h3> INTRODUCTION</h3></center>
</a>En quarante ans seulement, les technologies de l'information (TI) en sont venues &agrave; jouer un r&ocirc;le important et souvent vital dans presque tous les secteurs des soci&eacute;t&eacute;s organis&eacute;es. En cons&eacute;quence, la s&eacute;curit&eacute; est devenue un aspect essentiel des technologies de l'information.<p>

Dans ce contexte, la s&eacute;curit&eacute; des TI est caract&eacute;ris&eacute;e par &#32;:<p>

<ul>
<li>la <strong>confidentialit&eacute;</strong> - pr&eacute;vention d'une divulgation non autoris&eacute;e de l'information &#32;;

<li>l'<strong>int&eacute;grit&eacute;</strong> - pr&eacute;vention d'une modification non autoris&eacute;e de l'information &#32;;

<li>la <strong>disponibilit&eacute;</strong> - pr&eacute;vention d'un d&eacute;ni non autoris&eacute; d'acc&egrave;s &agrave; l'information ou &agrave; des ressources.
</ul><p>

Un <strong>syst&egrave;me</strong> TI ou un <strong>produit</strong> TI (issu des Technologies de l'Information) aura ses exigences propres pour maintenir la confidentialit&eacute;, l'int&eacute;grit&eacute; et la disponibilit&eacute;. Pour satisfaire &agrave; ces exigences, il impl&eacute;mentera un certain nombre de mesures techniques de s&eacute;curit&eacute;, appel&eacute;es dans ce document fonctions <strong>d&eacute;di&eacute;es &agrave; la s&eacute;curit&eacute;</strong>, qui recouvrent par exemple des domaines tels que le contr&ocirc;le d'acc&egrave;s, l'audit et la reprise sur incident. Une confiance appropri&eacute;e dans ces fonctions sera n&eacute;cessaire &#32;: dans le pr&eacute;sent document, on emploie le terme d'<strong>assurance</strong>, qu'il s'agisse de la confiance dans la <strong>conformit&eacute;</strong> des fonctions d&eacute;di&eacute;es &agrave; la s&eacute;curit&eacute; (tant du point de vue de leur d&eacute;veloppement que de celui de leur exploitation) ou de la confiance dans l'<strong>efficacit&eacute;</strong> de ces fonctions.<p>

Les utilisateurs de syst&egrave;mes doivent pouvoir se fier &agrave; la s&eacute;curit&eacute; des syst&egrave;mes qu'ils utilisent. Il leur faut aussi un &eacute;talon pour pouvoir comparer les aptitudes, en mati&egrave;re de s&eacute;curit&eacute;, des produits TI qu'ils envisagent d'acheter. Bien qu'ils aient la possibilit&eacute; soit de se fier &agrave; la parole des fabricants ou des fournisseurs des syst&egrave;mes et des produits en question, soit de les tester eux-m&ecirc;mes, il est probable que beaucoup pr&eacute;f&eacute;reront se reposer sur les r&eacute;sultats d'une &eacute;valuation impartiale effectu&eacute;e par un organisme ind&eacute;pendant. Une telle <strong>&eacute;valuation</strong> d'un syst&egrave;me ou d'un produit exige des crit&egrave;res d'&eacute;valuation de la s&eacute;curit&eacute; objectifs et bien d&eacute;finis ainsi que l'existence d'un <strong>organisme de certification</strong> qui puisse confirmer que l'&eacute;valuation a &eacute;t&eacute; correctement conduite. Les <strong>cibles de s&eacute;curit&eacute;</strong> de syst&egrave;me sont sp&eacute;cifiques aux besoins particuliers des utilisateurs du syst&egrave;me en question, alors que les cibles de s&eacute;curit&eacute; de produit sont plus g&eacute;n&eacute;rales, afin que les produits qui satisfont &agrave; ces cibles puissent &ecirc;tre incorpor&eacute;s dans de nombreux syst&egrave;mes ayant des exigences de s&eacute;curit&eacute; similaires mais non n&eacute;cessairement identiques.<p>

Pour un syst&egrave;me, une &eacute;valuation de ses capacit&eacute;s en mati&egrave;re de s&eacute;curit&eacute; peut &ecirc;tre consid&eacute;r&eacute;e comme faisant partie d'une proc&eacute;dure plus formelle de r&eacute;ception d'un syst&egrave;me TI devant &ecirc;tre utilis&eacute; dans un environnement particulier. Le terme d'<strong>homologation</strong> est souvent utilis&eacute; pour d&eacute;crire cette proc&eacute;dure. Elle exige de prendre en compte de nombreux facteurs avant de consid&eacute;rer que le syst&egrave;me convient pour l'usage pr&eacute;vu &#32;: elle exige l'assurance dans la s&eacute;curit&eacute; fournie par le syst&egrave;me, la confirmation des responsabilit&eacute;s d'administration de la s&eacute;curit&eacute;, la conformit&eacute; avec les exigences qui s'appliquent au plan technique, l&eacute;gal ou r&eacute;glementaire, et la confiance dans l'ad&eacute;quation des autres mesures non techniques de s&eacute;curit&eacute; fournies par l'environnement du syst&egrave;me. Les crit&egrave;res contenus dans le pr&eacute;sent document concernent en premier lieu les mesures techniques de s&eacute;curit&eacute;, mais prennent en compte certains aspects non techniques, tels que les proc&eacute;dures d'exploitation s&ucirc;re pour la s&eacute;curit&eacute; li&eacute;e au personnel, la s&eacute;curit&eacute; physique et la s&eacute;curit&eacute; organisationnelle (mais seulement quand elles empi&egrave;tent sur les mesures techniques de s&eacute;curit&eacute;).<p>

Beaucoup de travaux ont d&eacute;j&agrave; &eacute;t&eacute; r&eacute;alis&eacute;s pour d&eacute;velopper des crit&egrave;res d'&eacute;valuation de la s&eacute;curit&eacute; des TI, malgr&eacute; quelques l&eacute;g&egrave;res divergences sur les objectifs selon les exigences sp&eacute;cifiques des pays ou des organismes concern&eacute;s. Le plus important, et &agrave; bien des &eacute;gards un pr&eacute;curseur pour les autres travaux, a &eacute;t&eacute; le document Trusted Computer System Evaluation Criteria [TCSEC], commun&eacute;ment appel&eacute; TCSEC ou "Livre orange" (Orange Book) qui a &eacute;t&eacute; publi&eacute; et utilis&eacute; par le d&eacute;partement de la d&eacute;fense des Etats-Unis pour l'&eacute;valuation de produits. D'autres pays, principalement europ&eacute;ens, ont aussi une exp&eacute;rience importante en mati&egrave;re d'&eacute;valuation de la s&eacute;curit&eacute; des TI et ont mis au point leurs propres crit&egrave;res de s&eacute;curit&eacute; des TI. Au Royaume Uni, c'est le cas du m&eacute;morandum CESG num&eacute;ro 3 [CESG3] d&eacute;velopp&eacute; &agrave; usage gouvernemental, et des propositions du minist&egrave;re du Commerce et de l'Industrie r&eacute;unies dans le "Livre vert" [DTIEC] pour les produits commerciaux de s&eacute;curit&eacute; des TI. En Allemagne, le service allemand de S&eacute;curit&eacute; de l'Information a publi&eacute; une premi&egrave;re version de ses propres crit&egrave;res en 1989 [ZSIEC], et &agrave; la m&ecirc;me &eacute;poque des crit&egrave;res ont &eacute;t&eacute; d&eacute;velopp&eacute;s en France sous le nom du "Livre bleu-blanc-rouge" [SCSSI].<p>

Constatant que le travail se poursuivait dans ce domaine et qu'il restait encore beaucoup &agrave; faire, la France, le Royaume Uni, les Pays-Bas et l'Allemagne ont reconnu qu'il fallait aborder ce travail en concertation, et qu'il fallait &eacute;tablir des crit&egrave;res de s&eacute;curit&eacute; des TI communs et harmonis&eacute;s. Trois raisons justifiaient cette harmonisation &#32;:<p>

<ul>
<li>une vaste exp&eacute;rience avait &eacute;t&eacute; accumul&eacute;e dans les divers pays et il y avait beaucoup &agrave; gagner &agrave; construire en commun &agrave; partir de cette exp&eacute;rience &#32;;

<li>les industriels ne voulaient pas de crit&egrave;res de s&eacute;curit&eacute; diff&eacute;rents selon les pays &#32;;

<li>les concepts de base et les approches &eacute;taient les m&ecirc;mes dans les diff&eacute;rents pays, et m&ecirc;me dans les diverses applications commerciales, gouvernementales et militaires.
</ul><p>

En cons&eacute;quence, il a &eacute;t&eacute; d&eacute;cid&eacute; de s'appuyer sur les diverses initiatives nationales en prenant le meilleur de tout ce qui avait d&eacute;j&agrave; &eacute;t&eacute; r&eacute;alis&eacute; et en r&eacute;unissant le tout dans une construction coh&eacute;rente et structur&eacute;e. Assurer au maximum l'applicabilit&eacute; et la compatibilit&eacute; avec les travaux existants, en particulier avec le document TCSEC am&eacute;ricain, a &eacute;t&eacute; une pr&eacute;occupation permanente tout au long de ce processus. Bien que l'on ait estim&eacute;, au d&eacute;but, que le travail se limiterait &agrave; une harmonisation des crit&egrave;res existants, il a quelquefois &eacute;t&eacute; n&eacute;cessaire d'y apporter des compl&eacute;ments.<p>

Une des raisons pour produire ces crit&egrave;res harmonis&eacute;s au plan international est de fournir une base compatible pour la <strong>certification</strong> par les organismes de certification nationaux des quatre pays qui y coop&egrave;rent, avec pour objectif final de permettre la reconnaissance mutuelle des r&eacute;sultats des &eacute;valuations.<p>

Le pr&eacute;sent document expose les crit&egrave;res harmonis&eacute;s. Le chapitre 1 contient une br&egrave;ve pr&eacute;sentation de leur champ d'application. Le chapitre 2 traite de la fonctionnalit&eacute; de s&eacute;curit&eacute;, c'est-&agrave;-dire de la d&eacute;finition et de la description des besoins en mati&egrave;re de s&eacute;curit&eacute;. Le chapitre 3 d&eacute;finit les crit&egrave;res d'&eacute;valuation de l'assurance de l'efficacit&eacute; d'une <strong>cible d'&eacute;valuation</strong> comme solution &agrave; ces besoins. Le chapitre 4 compl&egrave;te cette &eacute;valuation par l'examen de la conformit&eacute; de la solution. Le chapitre 5 d&eacute;crit les r&eacute;sultats attendus d'une &eacute;valuation, et le chapitre 6 contient un glossaire des termes qui prennent dans le pr&eacute;sent document un sens plus pr&eacute;cis ou diff&eacute;rent de celui du langage courant (ceux-ci sont imprim&eacute;s en caract&egrave;re gras lorsqu'ils sont utilis&eacute;s pour la premi&egrave;re fois, alors que les caract&egrave;res italiques sont utilis&eacute;s pour faire ressortir certains termes). Le but du glossaire est d'aider le lecteur &agrave; comprendre non seulement la d&eacute;finition des termes, mais aussi les id&eacute;es et les concepts qui sont propres aux crit&egrave;res harmonis&eacute;s.<p>

Les crit&egrave;res d'&eacute;valuation des chapitres 3 et 4 sont pr&eacute;sent&eacute;s d'une mani&egrave;re standardis&eacute;e &#32;; ils sp&eacute;cifient ce qui doit &ecirc;tre fourni par le <strong>commanditaire</strong> de l'&eacute;valuation (la personne ou l'organisation qui demande l'&eacute;valuation) et ce qui doit &ecirc;tre fait par l'<strong>&eacute;valuateur</strong> (la personne ou l'organisation ind&eacute;pendante qui effectue l'&eacute;valuation). Cette distinction a pour objectif d'aider &agrave; assurer la coh&eacute;rence et l'uniformit&eacute; des r&eacute;sultats d'&eacute;valuation. Pour chaque domaine d'&eacute;valuation, la documentation &agrave; fournir par le commanditaire de l'&eacute;valuation est identifi&eacute;e. Viennent ensuite les crit&egrave;res &agrave; prendre en compte pour chaque aspect ou phase d'&eacute;valuation relatif &agrave; ce domaine. Ces crit&egrave;res sont d&eacute;compos&eacute;s en <strong>exigences concernant le contenu et la pr&eacute;sentation</strong> de la documentation qui doit &ecirc;tre fournie par le commanditaire, en<strong> exigences concernant les &eacute;l&eacute;ments de preuve</strong> que cette documentation doit pr&eacute;senter, et en <strong>t&acirc;ches de l'&eacute;valuateur</strong> que celui-ci doit effectuer aussi bien pour v&eacute;rifier la documentation fournie que pour effectuer, chaque fois que n&eacute;cessaire, des tests additionnels ou d'autres activit&eacute;s. Dans le cas des crit&egrave;res concernant la mani&egrave;re dont le syst&egrave;me ou le produit doit &ecirc;tre utilis&eacute; en environnement op&eacute;rationnel, le commanditaire ne sera pas, en g&eacute;n&eacute;ral, capable de fournir des preuves tir&eacute;es de l'emploi r&eacute;el. Par cons&eacute;quent l'&eacute;valuateur doit supposer pour les besoins de l'&eacute;valuation que les proc&eacute;dures sp&eacute;cifi&eacute;es par le commanditaire seront suivies dans la pratique.<p>

Dans le cadre des pr&eacute;sents crit&egrave;res certains verbes sont utilis&eacute;s d'une mani&egrave;re particuli&egrave;re. <I>Devoir</I> est utilis&eacute; pour exprimer les crit&egrave;res auxquels il est imp&eacute;ratif de satisfaire &#32;; <I>pouvoir</I> est utilis&eacute; pour exprimer des crit&egrave;res qui ne sont pas obligatoires &#32;; et le <I>futur</I> est utilis&eacute; pour exprimer des actions qui auront lieu ult&eacute;rieurement. De m&ecirc;me, les verbes <I>pr&eacute;senter</I>, <I>d&eacute;crire</I> et <I>expliquer</I> sont utilis&eacute;s dans les pr&eacute;sents crit&egrave;res pour exiger des niveaux de rigueur croissants dans la fourniture des &eacute;l&eacute;ments de preuve. <I>Pr&eacute;senter</I> signifie que les &eacute;l&eacute;ments pertinents doivent &ecirc;tre fournis &#32;; <I>d&eacute;crire</I> signifie que ces &eacute;l&eacute;ments doivent &ecirc;tre fournis et leurs caract&eacute;ristiques pertinentes &eacute;num&eacute;r&eacute;es &#32;; <I>expliquer</I> signifie que ces &eacute;l&eacute;ments doivent &ecirc;tre fournis, leurs caract&eacute;ristiques pertinentes &eacute;num&eacute;r&eacute;es et des justifications donn&eacute;es.<p>

En dehors du chapitre 4, les paragraphes sont num&eacute;rot&eacute;s s&eacute;quentiellement &agrave; l'int&eacute;rieur de chaque chapitre. Au chapitre 4, les crit&egrave;res sont pr&eacute;sent&eacute;s s&eacute;par&eacute;ment pour chaque niveau d'&eacute;valuation. Les paragraphes d'introduction de ce chapitre sont num&eacute;rot&eacute;s comme dans les autres chapitres, mais ensuite les paragraphes contenant les crit&egrave;res sont num&eacute;rot&eacute;s s&eacute;quentiellement pour chaque niveau, le m&ecirc;me num&eacute;ro de paragraphe s'appliquant au m&ecirc;me sujet &agrave; chaque niveau. N&eacute;anmoins chaque paragraphe de ce document est identifi&eacute; de mani&egrave;re unique par la combinaison du chapitre ou du num&eacute;ro du niveau et du num&eacute;ro du paragraphe.<p>

Le pr&eacute;sent travail a exploit&eacute; des documents qui ont d&eacute;j&agrave; &eacute;t&eacute; abondamment discut&eacute;s et utilis&eacute;s dans la pratique &#32;; de plus, on peut consid&eacute;rer que les id&eacute;es et les concepts ont &eacute;t&eacute; pes&eacute;s avec soin et que la structure choisie pour l'ouvrage convient pour lui assurer le maximum de coh&eacute;rence et de facilit&eacute; d'emploi. La version actuelle de l'ITSEC tire profit de r&eacute;visions significatives faites apr&egrave;s une large consultation internationale. La proc&eacute;dure de revue a &eacute;t&eacute; faite avec le concours de la Commission des Communaut&eacute;s Europ&eacute;ennes qui a organis&eacute; une conf&eacute;rence internationale au cours de laquelle la version 1.0 a &eacute;t&eacute; discut&eacute;e, puis un atelier au cours duquel une version interm&eacute;diaire, la version 1.1, a &eacute;t&eacute; affin&eacute;e. Ces r&eacute;unions ont &eacute;t&eacute; compl&eacute;t&eacute;es par des commentaires &eacute;crits des personnes ayant particip&eacute; &agrave; cette consultation que les auteurs ont cherch&eacute; &agrave; prendre en compte pour pr&eacute;parer la version 1.2.<p>

On peut donc s'attendre &agrave; ce que ces crit&egrave;res soient largement accept&eacute;s et utilis&eacute;s dans une large gamme d'utilisations et de secteurs de march&eacute; &#32;; toutefois, il est admis que des am&eacute;liorations peuvent &ecirc;tre apport&eacute;es &agrave; ces crit&egrave;res, et le seront. En cons&eacute;quence, les suggestions et les commentaires sont encourag&eacute;s et peuvent &ecirc;tre envoy&eacute;s &agrave; l'une des adresses ci-apr&egrave;s, en portant la mention "Commentaires sur l'ITSEC"<p>

<pre><a name="654">
Commission des Communaut&eacute;s Europ&eacute;ennes<br>Directorat XIII/F<br>SOG-IS Secr&eacute;tariat<br>Rue de la Loi 200<br>B-1049 BRUXELLES<br>Belgique
</a>
<a name="677">

</a>
<a name="655">
Ou, pour la France &#32;:
</a>
<a name="656">
Service Central de la S&eacute;curit&eacute; des Syst&egrave;mes d'Information<br>Division Informatique et Syst&egrave;mes<br>18, rue du Docteur Zamenhof<br>F-92131 Issy-les-Moulineaux 
</a>
<a name="657">

</a>
<a name="678">
Pour l'Allemagne &#32;:
</a>
<a name="658">
Bundesamt f&uuml;r Sicherheit in der Informationstechnik<br>Am Nippenkreuz 19<br>D-5300 BONN 2
</a>
<a name="659">

</a>
<a name="679">
Pour les Pays-Bas &#32;:
</a>
<a name="660">
Netherlands National Comsec Agency<br>Bezuidenhoutseweg 67<br>P.O. Box 20061<br>NL-2500 EB THE HAGUE
</a>
<a name="661">

</a>
<a name="680">
Pour le Royaume Uni &#32;:
</a>
<a name="662">
Head of the Certification Body<br>UK IT Security Evaluation and Certification Scheme<br>Room 2/0805<br>Fiddlers Green Lane<br>CHELTENHAM<br>Glos GB-GL 52 5 AJ
</a>
</pre>Des exemplaires de la version 1.2 de l'ITSEC peuvent &ecirc;tre obtenus aupr&egrave;s de la Commission des Communaut&eacute;s Europ&eacute;ennes &agrave; l'adresse indiqu&eacute;e ci-dessus.<p>


<TABLE BGCOLOR="#FF9933"><TR><TD WIDTH=100%>
<CENTER>
<BR><A HREF="/document/criteres.html">Index de la documentation sur les critères</A> | 
<A HREF="/document/index.html">Index général de la documentation</A>
<BR>
<A HREF="/document/docs/ITSEC/itsec.html">Sommaire</A> |
<A HREF="/document/docs/ITSEC/itsec-0.html">Introduction</A> |
<A HREF="/document/docs/ITSEC/itsec-1.html">Champ d'application</A> |
<A HREF="/document/docs/ITSEC/itsec-2.html">Fonctionnalité</A> 
<A HREF="/document/docs/ITSEC/itsec-3.html">Efficacité</A> |
<A HREF="/document/docs/ITSEC/itsec-4.html">Conformité</A> |
<A HREF="/document/docs/ITSEC/itsec-E1.html">Conformité E1</A> |
<A HREF="/document/docs/ITSEC/itsec-E2.html">Conformité E2</A> |
<A HREF="/document/docs/ITSEC/itsec-E3.html">Conformité E3</A> |
<A HREF="/document/docs/ITSEC/itsec-E4.html">Conformité E4</A> |
<A HREF="/document/docs/ITSEC/itsec-E5.html">Conformité E5</A> |
<A HREF="/document/docs/ITSEC/itsec-E6.html">Conformité E6</A>
<A HREF="/document/docs/ITSEC/itsec-5.html">Résultats de l'évaluation</A> |
<A HREF="/document/docs/ITSEC/itsec-6.html">Glossaire</A> |
<A HREF="/document/docs/ITSEC/itsec-A.html">Exemples de classes de Fonctionnalité</A> |
<A HREF="/document/docs/ITSEC/itsec-B.html">"Claims language"</A> |

<BR><BR><a href="itsec.html"><img alt="[Début]" border=0 src="/images/top.gif"></a> <a href="itsec.html"><img alt="[Précédente]" border=0 src="/images/prev.gif"></a> <a href="itsec-1.html"><img alt="[Suivante]" border=0 src="/images/next.gif"></a> <a href="itsec-B.html"><img alt="[Fin]" border=0 src="/images/bottom.gif"></a>
<BR><BR>
</TD></TR></TABLE>
</TD></TR></TABLE>
<HR>

<SMALL><A HREF="/courrier.html">
webmaster@scssi.gouv.fr</A>

- Copyright &copy 1999 Service Central de la Sécurité des Systèmes d'Information
<BR>Dernière mise à jour le 17/06/99 à 17:03:17
</SMALL>
</body>
</html>
