<html><head><title>SCSSI : SCSSI : ITSEC v1.2 Classes de fonctionnalit&eacute;</title></head>
<body bgcolor=#ffffff>

<TABLE >
<TR><TD WIDTH=161><A HREF="/index.html"><IMG SRC="/images/sigle2.gif" ALT="Retour Page de Garde" ALIGN="TOP" BORDER="0"></A>
</TD><TD WIDTH=100%><CENTER>PREMIER MINISTRE</CENTER>
<P>
<CENTER><B><FONT SIZE=5>Service Central</FONT></B> <B><FONT SIZE=5>de la S&eacute;curit&eacute; des Syst&egrave;mes d'Information</FONT></B></CENTER>
</TD>
</TR>

</TABLE><HR>
<!                      >
<!                      >
<!                      >

<TABLE>
<TR><TD BGCOLOR="#96c7f8" WIDTH=161 VALIGN="TOP">
<BR>
<TABLE WIDTH=161>
<TR><TD BGCOLOR="#ffffff" WIDTH=161 ALIGN="center"><B>DOCUMENTATION</B></TD></TR>
<TR><TD ALIGN="left"><SMALL>
<A HREF="/document/index.html">Index</A> de la documentation<BR><BR>
EVALUATION
</SMALL>

<UL=COMPACT type="square">
<SMALL>
<LI><A HREF="/document/certif.html">Critères d'évaluation</A>
<LI><A HREF="/document/certif.html">Schéma de certification</A>
<LI><A HREF="/document/docs/GARDE/garde.html">Guides GARDE</A>
<LI><A HREF="/document/certif.html">Certificats et PP</A>
</SMALL>
</UL>

<SMALL>REGLEMENTATION</SMALL>
<UL=COMPACT type="square">
<SMALL>
<LI><A HREF="/document/chiffre.html">Cryptologie</A>
<LI><A HREF="/document/tempest.html">Domaine tempest</A>
<LI><A HREF="/document/ssi.html">Systèmes d'information</A>
</SMALL>
</UL>

<SMALL>
<A HREF="/document/methodes.html">METHODES</A><BR><BR>
<A HREF="/document/fiches/index.html">FICHES DE SYNTHESE</A>
</SMALL>

</TD></TR></TABLE>
<HR>

<TABLE WIDTH=161>
<TR><TD BGCOLOR="#ffffff" WIDTH=161 ALIGN="center"><B>AILLEURS SUR LE SITE</B></TD></TR>
<TR><TD ALIGN="left"><UL=COMPACT type="square"><SMALL>
<LI><A HREF="/index.html">Retour à la page d'accueil</A>
<LI><A HREF="/present/index.html">Présentation du SCSSI</A>
<LI><A HREF="/pratiq/index.html">Informations pratiques</A>
<LI><A HREF="/rubriq/index.html">Rubriques</A>
<LI><A HREF="/courrier.html">Courrier des lecteurs</A>
</SMALL></TD></TR></TABLE>

<BR>
</TD>
<!                    >
<!                    >
<!                    >

<TD WIDTH=31></TD>
<TD WIDTH=100% VALIGN=TOP>
<TABLE WIDTH=100%><TR>
<TD BGCOLOR="#FF9933" VALIGN=MIDDLE>
<BR>
<H2><CENTER>SCSSI : ITSEC v1.2 Classes de fonctionnalit&eacute;</H2>
<A HREF="/document/criteres.html">Index de la documentation sur les critères</A> | 
<A HREF="/document/index.html">Index général de la documentation</A>
<BR>
<A HREF="/document/docs/ITSEC/itsec.html">Sommaire</A> |
<A HREF="/document/docs/ITSEC/itsec-0.html">Introduction</A> |
<A HREF="/document/docs/ITSEC/itsec-1.html">Champ d'application</A> |
<A HREF="/document/docs/ITSEC/itsec-2.html">Fonctionnalité</A> 
<A HREF="/document/docs/ITSEC/itsec-3.html">Efficacité</A> |
<A HREF="/document/docs/ITSEC/itsec-4.html">Conformité</A> |
<A HREF="/document/docs/ITSEC/itsec-E1.html">Conformité E1</A> |
<A HREF="/document/docs/ITSEC/itsec-E2.html">Conformité E2</A> |
<A HREF="/document/docs/ITSEC/itsec-E3.html">Conformité E3</A> |
<A HREF="/document/docs/ITSEC/itsec-E4.html">Conformité E4</A> |
<A HREF="/document/docs/ITSEC/itsec-E5.html">Conformité E5</A> |
<A HREF="/document/docs/ITSEC/itsec-E6.html">Conformité E6</A>
<A HREF="/document/docs/ITSEC/itsec-5.html">Résultats de l'évaluation</A> |
<A HREF="/document/docs/ITSEC/itsec-6.html">Glossaire</A> |
<A HREF="/document/docs/ITSEC/itsec-A.html">Exemples de classes de Fonctionnalité</A> |
<A HREF="/document/docs/ITSEC/itsec-B.html">"Claims language"</A> |

<BR><BR>
<a href="itsec.html"><img alt="[Début]" border=0 src="/images/top.gif"></a> <a href="itsec-6.html"><img alt="[Précédente]" border=0 src="/images/prev.gif"></a> <a href="itsec-B.html"><img alt="[Suivante]" border=0 src="/images/next.gif"></a> <a href="itsec-B.html"><img alt="[Fin]" border=0 src="/images/bottom.gif"></a>
<BR><BR>
</TD></TR></TABLE>
<a name="899631">
<center><h3> ANNEXE A - EXEMPLES DE CLASSES DE FONCTIONNALITE</h3></center>
</a><a href="itsec-A.html#899536">Introduction</a><p>

<a href="itsec-A.html#899133">Classe de fonctionnalit&eacute; F-C1</a><p>

<a href="itsec-A.html#899141">Classe de fonctionnalit&eacute; F-C2</a><p>

<a href="itsec-A.html#899164">Classe de fonctionnalit&eacute; F-B1</a><p>

<a href="itsec-A.html#899201">Classe de fonctionnalit&eacute; F-B2</a><p>

<a href="itsec-A.html#899243">Classe de fonctionnalit&eacute; F-B3</a><p>

<a href="itsec-A.html#899286">Classe de fonctionnalit&eacute; F-IN</a><p>

<a href="itsec-A.html#899314">Classe de fonctionnalit&eacute; F-AV</a><p>

<a href="itsec-A.html#899320">Classe de fonctionnalit&eacute; F-DI</a><p>

<a href="itsec-A.html#899341">Classe de fonctionnalit&eacute; F-DC</a><p>

<a href="itsec-A.html#899347">Classe de fonctionnalit&eacute; F-DX</a><p>

Introduction<p>

Cette annexe pr&eacute;sente des exemples de classes pr&eacute;d&eacute;finies, telles que d&eacute;finies au chapitre 2. Ces classes constituent une annexe &agrave; ces crit&egrave;res car elles sont donn&eacute;es comme exemples, et non comme des classes d&eacute;finitives, &agrave; utiliser dans des &eacute;valuations r&eacute;elles. On esp&egrave;re qu'elles vont stimuler le d&eacute;bat sur les exigences r&eacute;elles des fonctionnalit&eacute;s de s&eacute;curit&eacute;. De fait, le besoin de cr&eacute;er des classes pr&eacute;d&eacute;finies d&eacute;finitives a &eacute;t&eacute; largement approuv&eacute; lors du processus de consultation qui a pr&eacute;c&eacute;d&eacute; la publication de cette version des crit&egrave;res.<p>

Des travaux sont d&eacute;j&agrave; en cours dans des organismes de normalisation et d'autres organisations industrielles pour d&eacute;velopper des normes pour des fonctionnalit&eacute;s de s&eacute;curit&eacute; dans des contextes sp&eacute;cifiques. On s'attend &agrave; ce que de tels travaux produisent des d&eacute;finitions de fonctionnalit&eacute;s de s&eacute;curit&eacute; qui feront autorit&eacute; et qui pourront &ecirc;tre adapt&eacute;es pour &ecirc;tre utilis&eacute;es avec ces crit&egrave;res et incluses ou mises en r&eacute;f&eacute;rence dans la prochaine version d&eacute;finitive de ce document.<p>

Les pr&eacute;sents exemples fournissent une r&eacute;f&eacute;rence de base et montrent comment des classes pr&eacute;d&eacute;finies peuvent &ecirc;tre tir&eacute;es des crit&egrave;res existants : de fait, ces classes ont &eacute;t&eacute; adapt&eacute;es avec un minimum de modification du [ZSIEC].<p>

Chaque classe consiste en une pr&eacute;sentation des objectifs, suivie par les exigences pr&eacute;sent&eacute;es dans des rubriques g&eacute;n&eacute;riques appropri&eacute;es. L'absence d'une rubrique g&eacute;n&eacute;rique dans la description d'une classe donn&eacute;e signifie qu'il n'existe aucune exigence pour cette rubrique. Les classes F-B2 et F-B3 contiennent en outre des informations compl&eacute;mentaires qu'il est n&eacute;cessaire d'inclure dans une cible de s&eacute;curit&eacute; &#32;; ces informations sp&eacute;cifient les m&eacute;canismes par mandats exig&eacute;s pour la compatibilit&eacute; avec le TCSEC.<p>

Les cinq exemples de classes de fonctionnalit&eacute; F-C1, F-C2, F-B1, F-B2, et F-B3 forment une hi&eacute;rarchie puisqu'elles sont issues des exigences fonctionnelles des classes hi&eacute;rarchiques du TCSEC. Dans la description de ces classes, les parties de chaque classe qui sont nouvelles ou qui ont &eacute;t&eacute; chang&eacute;es par rapport aux classes pr&eacute;c&eacute;dentes sont imprim&eacute;es en gras.<p>

D'autres classes de fonctionnalit&eacute; bas&eacute;es sur une hi&eacute;rarchie pourront &ecirc;tre cr&eacute;&eacute;es dans le futur, par des organismes de normalisation et des organisations industrielles, pour aborder d'autres types d'objectifs de s&eacute;curit&eacute; (par exemple pour l'int&eacute;grit&eacute; et la disponibilit&eacute;). En attendant, les classes F-IN, F-AV, F-DI, F-DC, et F-DX ont &eacute;t&eacute; incluses pour illustrer la large gamme d'exigences de s&eacute;curit&eacute; qui peuvent &ecirc;tre exprim&eacute;es sous la forme d'une classe de fonctionnalit&eacute; pr&eacute;d&eacute;finie.<p>

<a name="899133">
<center><h2> Exemple de classe de fonctionnalit&eacute; : F-C1</h2></center>
</a><a name="899134">
<h4> Objectif</h4>
</a>L'exemple de classe F-C1 est d&eacute;riv&eacute; des exigences fonctionnelles de la classe C1 du TCSEC am&eacute;ricain. Elle offre un contr&ocirc;le d'acc&egrave;s discr&eacute;tionnaire ("besoin d'en conna&icirc;tre").<p>

<a name="899136">
<h4> Identification et authentification</h4>
</a>La TOE doit identifier et authentifier les utilisateurs. L'identification et l'authentification doivent avoir lieu avant toute autre interaction entre la TOE et l'utilisateur. D'autres interactions ne doivent &ecirc;tre possibles qu'apr&egrave;s une identification et une authentification r&eacute;ussies. Les informations d'authentification doivent &ecirc;tre stock&eacute;es de fa&ccedil;on telle qu'elles soient seulement accessibles par des utilisateurs autoris&eacute;s.<p>

<a name="899138">
<h4> Contr&ocirc;le d'acc&egrave;s</h4>
</a>La TOE doit pouvoir distinguer et administrer les droits d'acc&egrave;s de chaque utilisateur sur les objets soumis &agrave; l'administration des droits, au niveau d'un utilisateur individuel, au niveau de l'appartenance &agrave; un groupe d'utilisateurs, ou aux deux niveaux. Il doit &ecirc;tre possible de refuser compl&egrave;tement &agrave; des utilisateurs ou &agrave; des groupes d'utilisateurs l'acc&egrave;s &agrave; un objet. Il ne doit pas &ecirc;tre possible &agrave; quelqu'un qui n'est pas un utilisateur autoris&eacute; d'accorder ou de retirer des droits d'acc&egrave;s &agrave; un objet.<p>

Lors de toute tentative par des utilisateurs ou des groupes d'utilisateurs d'acc&eacute;der &agrave; des objets soumis &agrave; l'administration des droits, la TOE doit v&eacute;rifier la validit&eacute; de la demande. Les tentatives d'acc&egrave;s non autoris&eacute; doivent &ecirc;tre rejet&eacute;es.<p>

<a name="899141">
<center><h2> Exemple de classe de fonctionnalit&eacute; : F-C2</h2></center>
</a><a name="899142">
<h4> Objectif</h4>
</a><strong>L'exemple de classe F-C2 est d&eacute;riv&eacute; des exigences fonctionnelles de la classe C2 du TCSEC am&eacute;ricain. Elle offre un contr&ocirc;le d'acc&egrave;s discr&eacute;tionnaire plus fin que la classe C1, en rendant les utilisateurs individuellement responsables de leurs actions &agrave; travers des proc&eacute;dures d'identification, l'audit des &eacute;v&eacute;nements relatifs &agrave; la s&eacute;curit&eacute; et l'isolation des ressources.</strong>-<p>

<a name="899144">
<h4> Identification et authentification</h4>
</a>La TOE doit identifier et authentifier <strong>de fa&ccedil;on unique </strong>les utilisateurs. L'identification et l'authentification doivent avoir lieu avant toute autre interaction entre la TOE et l'utilisateur. D'autres interactions ne doivent &ecirc;tre possibles qu'apr&egrave;s une identification et une authentification r&eacute;ussies. Les informations d'authentification doivent &ecirc;tre stock&eacute;es de fa&ccedil;on telle qu'elles soient seulement accessibles par des utilisateurs autoris&eacute;s.<strong> Pour chaque interaction, la TOE doit pouvoir &eacute;tablir l'identit&eacute; de l'utilisateur.</strong><p>

<a name="899146">
<h4> Contr&ocirc;le d'acc&egrave;s</h4>
</a>La TOE doit pouvoir distinguer et administrer les droits d'acc&egrave;s de chaque utilisateur sur les objets soumis &agrave; l'administration des droits, au niveau d'un utilisateur individuel, au niveau de l'appartenance &agrave; un groupe d'utilisateurs, ou aux deux niveaux. Il doit &ecirc;tre possible de refuser compl&egrave;tement &agrave; des utilisateurs ou &agrave; des groupes d'utilisateurs l'acc&egrave;s &agrave; un objet.<strong> Il doit &eacute;galement &ecirc;tre possible de limiter l'acc&egrave;s d'un utilisateur &agrave; un objet aux seules op&eacute;rations qui ne modifient pas cet objet. Il doit &ecirc;tre possible d'accorder les droits d'acc&egrave;s &agrave; un objet en descendant jusqu'au niveau de granularit&eacute; de l'utilisateur individuel.</strong> Il ne doit pas &ecirc;tre possible &agrave; quelqu'un qui n'est pas un utilisateur autoris&eacute; d'accorder ou de retirer des droits d'acc&egrave;s &agrave; un objet.<strong> L'administration des droits doit disposer de contr&ocirc;les pour limiter la propagation des droits d'acc&egrave;s. De m&ecirc;me, seuls des utilisateurs autoris&eacute;s doivent pouvoir introduire de nouveaux utilisateurs, supprimer ou suspendre des utilisateurs existants.</strong><p>

Lors de toute tentative par des utilisateurs ou des groupes d'utilisateurs d'acc&eacute;der &agrave; des objets soumis &agrave; l'administration des droits, la TOE doit v&eacute;rifier la validit&eacute; de la demande. Les tentatives d'acc&egrave;s non autoris&eacute; doivent &ecirc;tre rejet&eacute;es.<p>

<a name="899149">
<h4> Imputabilit&eacute;</h4>
</a><strong>La TOE doit comporter un composant d'imputation qui soit capable, pour chacun des &eacute;v&eacute;nements suivants, d'enregistrer cet &eacute;v&eacute;nement avec les donn&eacute;es exig&eacute;es &#32;:</strong>-<p>

<ul>
<li><strong>Utilisation du m&eacute;canisme d'identification et d'authentification &#32;:</strong>-<br>	<strong>Donn&eacute;es exig&eacute;es &#32;: Date &#32;; heure &#32;; identit&eacute; fournie par l'utilisateur &#32;; identification de l'&eacute;quipement sur lequel le m&eacute;canisme d'identification et d'authentification a &eacute;t&eacute; utilis&eacute; (par exemple identificateur du terminal) &#32;; r&eacute;ussite ou &eacute;chec de la tentative.</strong>-

<li><strong>Actions qui tentent d'exercer des droits d'acc&egrave;s &agrave; un objet soumis &agrave; l'administration des droits &#32;:</strong>-<br>	<strong>Donn&eacute;es exig&eacute;es &#32;: Date &#32;; heure &#32;; identit&eacute; de l'utilisateur &#32;; nom de l'objet &#32;; type de la tentative d'acc&egrave;s &#32;; r&eacute;ussite ou &eacute;chec de la tentative.</strong>-

<li><strong>Cr&eacute;ation ou suppression d'un objet soumis &agrave; l'administration des droits &#32;:</strong>-<br>	<strong>Donn&eacute;es exig&eacute;es &#32;: Date &#32;; heure &#32;; identit&eacute; de l'utilisateur &#32;; nom de l'objet &#32;; type de l'action.</strong>-

<li><strong>Actions d'utilisateurs autoris&eacute;s affectant la s&eacute;curit&eacute; de la TOE &#32;:</strong>-<br>	<strong>Donn&eacute;es exig&eacute;es &#32;: Date &#32;; heure &#32;; identit&eacute; de l'utilisateur &#32;; type de l'action &#32;; nom de l'objet sur lequel porte l'action (de telles actions sont l'introduction ou la suppression (suspension) d'utilisateurs &#32;; l'introduction ou le retrait de supports de stockage &#32;; le d&eacute;marrage ou l'arr&ecirc;t de la TOE).</strong>-
</ul><strong></strong><p>

<strong>Les utilisateurs non autoris&eacute;s ne doivent pas avoir acc&egrave;s aux donn&eacute;es d'imputation. Il doit &ecirc;tre possible de mettre s&eacute;lectivement en oeuvre l'imputation pour un ou plusieurs utilisateurs. Il doit exister des outils pour examiner et maintenir les fichiers d'imputation et ces outils doivent &ecirc;tre document&eacute;s. Ils doivent permettre d'identifier s&eacute;lectivement les actions d'un ou de plusieurs utilisateurs.</strong>-<p>

<a name="899160">
<h4> Audit</h4>
</a><strong>Il doit exister des outils pour examiner les fichiers d'imputation pour les besoins d'audit et ces outils doivent &ecirc;tre document&eacute;s. Ils doivent permettre d'identifier s&eacute;lectivement les actions d'un ou de plusieurs utilisateurs.</strong>-<p>

<a name="899162">
<h4> R&eacute;utilisation d'objet</h4>
</a><strong>Tous les objets de stockage rendus &agrave; la TOE doivent, avant d'&ecirc;tre r&eacute;utilis&eacute;s par d'autres sujets, &ecirc;tre trait&eacute;s d'une mani&egrave;re telle qu'aucune conclusion ne puisse &ecirc;tre tir&eacute;e concernant leur contenu pr&eacute;c&eacute;dent.</strong>-<p>

<a name="899164">
<center><h2> Exemple de classe de fonctionnalit&eacute; : F-B1</h2></center>
</a><a name="899165">
<h4> Objectif</h4>
</a><strong>L'exemple de classe F-B1 est d&eacute;riv&eacute; des exigences fonctionnelles de la classe B1 du TCSEC am&eacute;ricain. En plus du contr&ocirc;le d'acc&egrave;s discr&eacute;tionnaire, elle introduit des fonctions pour maintenir des marques de sensibilit&eacute; et les utilise pour faire respecter un ensemble de r&egrave;gles de contr&ocirc;le d'acc&egrave;s par mandats &agrave; tous les sujets et &agrave; tous les objets de stockage sous son contr&ocirc;le. Il est possible d'attribuer de fa&ccedil;on pr&eacute;cise un label aux informations export&eacute;es.</strong>-<p>

<a name="899167">
<h4> Identification et authentification</h4>
</a>La TOE doit identifier et authentifier de fa&ccedil;on unique les utilisateurs. L'identification et l'authentification doivent avoir lieu avant toute autre interaction entre la TOE et l'utilisateur. D'autres interactions ne doivent &ecirc;tre possibles qu'apr&egrave;s une identification et une authentification r&eacute;ussies. Les informations d'authentification doivent &ecirc;tre stock&eacute;es de fa&ccedil;on telle qu'elles soient seulement accessibles par des utilisateurs autoris&eacute;s. Pour chaque interaction, la TOE doit pouvoir &eacute;tablir l'identit&eacute; de l'utilisateur.<p>

<a name="899169">
<h4> Contr&ocirc;le d'acc&egrave;s</h4>
</a>La TOE doit pouvoir distinguer et administrer les droits d'acc&egrave;s de chaque utilisateur sur les objets soumis &agrave; l'administration des droits, au niveau d'un utilisateur individuel, au niveau de l'appartenance &agrave; un groupe d'utilisateurs, ou aux deux. Il doit &ecirc;tre possible de refuser compl&egrave;tement &agrave; des utilisateurs ou &agrave; des groupes d'utilisateurs l'acc&egrave;s &agrave; un objet. Il doit &eacute;galement &ecirc;tre possible de limiter l'acc&egrave;s d'un utilisateur &agrave; un objet aux seules op&eacute;rations qui ne modifient pas cet objet. Il doit &ecirc;tre possible d'accorder les droits d'acc&egrave;s &agrave; un objet en descendant jusqu'au niveau de granularit&eacute; de l'utilisateur individuel. Il ne doit pas &ecirc;tre possible &agrave; quelqu'un qui n'est pas un utilisateur autoris&eacute; d'accorder ou de retirer des droits d'acc&egrave;s &agrave; un objet. L'administration des droits doit disposer de contr&ocirc;les pour limiter la propagation des droits d'acc&egrave;s. De m&ecirc;me, seuls des utilisateurs autoris&eacute;s doivent pouvoir introduire de nouveaux utilisateurs, supprimer ou suspendre des utilisateurs existants.<p>

<strong>En outre, la TOE doit donner des attributs &agrave; tous les sujets et &agrave; tous les objets de stockage sous son contr&ocirc;le (par exemple les processus, les fichiers, les segments de m&eacute;moire, les dispositifs). Les valeurs de ces attributs doivent servir de base pour les droits d'acc&egrave;s par mandats. Des r&egrave;gles doivent sp&eacute;cifier quelles combinaisons de valeurs d'attributs d'un sujet et d'un objet sont n&eacute;cessaires pour que l'acc&egrave;s &agrave; cet objet soit accord&eacute; au sujet.</strong>-<p>

<strong>Lorsqu'un objet est export&eacute;, ses attributs doivent &ecirc;tre export&eacute;s d'une mani&egrave;re telle que celui qui les re&ccedil;oit puisse reconstituer leur valeur sans ambigu&iuml;t&eacute;.</strong>-<p>

<strong>Les droits d'acc&egrave;s par mandats doivent &ecirc;tre con&ccedil;us de telle mani&egrave;re que le cas sp&eacute;cial suivant puisse &ecirc;tre r&eacute;alis&eacute; &#32;:</strong>-<p>

<strong>L'attribut comprend deux parties &#32;: la premi&egrave;re peut prendre des valeurs ordonn&eacute;es hi&eacute;rarchiquement, la seconde repr&eacute;sente un ensemble. (Dans le domaine gouvernemental, la premi&egrave;re partie contient des classifications, par exemple non classifi&eacute;, confidentiel, secret, tr&egrave;s secret. La seconde contient des cat&eacute;gories.)</strong>-<p>

<strong>On dit qu'un attribut A domine un attribut B si &#32;:</strong>-<p>

<strong>la premi&egrave;re partie de A est hi&eacute;rarchiquement sup&eacute;rieure ou &eacute;gale &agrave; la premi&egrave;re partie de B, et la deuxi&egrave;me partie de B est un sous-ensemble de la deuxi&egrave;me partie de A ou lui est &eacute;gale.</strong>-<p>

<strong>Les r&egrave;gles suivantes doivent &ecirc;tre impos&eacute;es &#32;:</strong>-<p>

<ul>
<li><strong>L'acc&egrave;s en lecture d'un sujet &agrave; un objet n'est autoris&eacute; que si l'attribut du sujet domine celui de l'objet &#32;;</strong>-

<li><strong>L'acc&egrave;s en &eacute;criture d'un sujet &agrave; un objet n'est autoris&eacute; que si l'attribut de l'objet domine celui du sujet.</strong>-
</ul><strong></strong><p>

<strong>Les attributs d'un sujet cr&eacute;&eacute; pour agir au nom d'un utilisateur doivent &ecirc;tre domin&eacute;s par l'habilitation et l'autorisation de cet utilisateur telles qu'elles ont &eacute;t&eacute; d&eacute;termin&eacute;es au moment de l'identification et de l'authentification. Si les donn&eacute;es import&eacute;es n'ont pas d'attribut, un utilisateur autoris&eacute; doit pouvoir leur en assigner.</strong>-<p>

<strong>Chaque canal d'exportation doit pouvoir &ecirc;tre identifi&eacute; comme &eacute;tant soit &agrave; niveau unique, soit multi-niveau. Il doit &ecirc;tre impossible de transmettre ou de recevoir des donn&eacute;es par des canaux d&eacute;sign&eacute;s comme &eacute;tant &agrave; niveau unique, &agrave; moins que les attributs de ces donn&eacute;es ne correspondent &agrave; un attribut pr&eacute;sp&eacute;cifi&eacute; d&eacute;termin&eacute;. Les donn&eacute;es transmises ou re&ccedil;ues par un canal &agrave; niveau unique doivent &ecirc;tre communiqu&eacute;es avec un attribut correspondant, sauf s'il est possible &agrave; un utilisateur autoris&eacute; de sp&eacute;cifier l'attribut du canal d'une fa&ccedil;on qui ne puisse pas &ecirc;tre imit&eacute;e. Dans ce cas, l'attribut des donn&eacute;es est implicitement sp&eacute;cifi&eacute; par l'attribut du canal.</strong>-<p>

<strong>Pour les canaux multi-niveaux, le protocole de communication doit garantir que le destinataire pourra compl&egrave;tement et sans ambigu&iuml;t&eacute; reconstituer et mettre en correspondance les donn&eacute;es et les attributs re&ccedil;us.</strong>-<p>

<strong>Des utilisateurs non autoris&eacute;s ne doivent pas pouvoir modifier les attributs d'un canal qui touchent &agrave; la s&eacute;curit&eacute;. Il ne doit pas &ecirc;tre possible de modifier ces attributs sans que la modification soit effectu&eacute;e explicitement.</strong>-<p>

<strong>La TOE doit marquer les sorties lisibles par l'homme avec des valeurs d'attribut. Les valeurs d'attribut doivent &ecirc;tre d&eacute;termin&eacute;es suivant les r&egrave;gles &eacute;tablies dans la TOE. Des utilisateurs autoris&eacute;s doivent pouvoir sp&eacute;cifier le libell&eacute; imprimable de chaque valeur d'attribut.</strong>-<p>

Lors de toute tentative d'un utilisateur ou groupe d'utilisateurs pour acc&eacute;der &agrave; des objets soumis &agrave; l'administration des droits, la TOE doit v&eacute;rifier la validit&eacute; de la demande. Les tentatives d'acc&egrave;s sans autorisation doivent &ecirc;tre rejet&eacute;es.<strong> Les valeurs des attributs doivent servir de base aux d&eacute;cisions concernant le contr&ocirc;le d'acc&egrave;s par mandats. Les r&egrave;gles doivent sp&eacute;cifier sans ambigu&iuml;t&eacute; quand un sujet est autoris&eacute; &agrave; avoir acc&egrave;s &agrave; un objet ainsi prot&eacute;g&eacute;. Si des droits d'acc&egrave;s discr&eacute;tionnaires sont aussi attribu&eacute;s &agrave; un objet, l'acc&egrave;s ne doit &ecirc;tre autoris&eacute; qu'&agrave; condition que les droits d'acc&egrave;s par mandats et discr&eacute;tionnaires le permettent tous les deux.</strong><p>

<a name="899186">
<h4> Imputabilit&eacute;</h4>
</a>La TOE doit comporter un composant d'imputation qui soit capable, pour chacun des &eacute;v&eacute;nements suivants, d'enregistrer cet &eacute;v&eacute;nement avec les donn&eacute;es exig&eacute;es &#32;:<p>

<ul>
<li>Utilisation du m&eacute;canisme d'identification et d'authentification &#32;:<br>Donn&eacute;es exig&eacute;es &#32;: Date &#32;; heure &#32;; identit&eacute; fournie par l'utilisateur &#32;; identification de l'&eacute;quipement sur lequel le m&eacute;canisme d'identification et d'authentification a &eacute;t&eacute; utilis&eacute; (par exemple identificateur du terminal) &#32;; r&eacute;ussite ou &eacute;chec de la tentative &#32;; <strong>autorisation de l'utilisateur</strong>.

<li>Actions qui tentent d'exercer des droits d'acc&egrave;s &agrave; un objet soumis &agrave; l'administration des droits &#32;:<br>	Donn&eacute;es exig&eacute;es &#32;: Date &#32;; heure &#32;; identit&eacute; de l'utilisateur &#32;; nom de l'objet &#32;; type de la tentative d'acc&egrave;s &#32;; r&eacute;ussite ou &eacute;chec de la tentative &#32;; <strong>attribut de l'objet</strong>.

<li>Cr&eacute;ation ou suppression d'un objet soumis &agrave; l'administration des droits &#32;:<br>	Donn&eacute;es exig&eacute;es &#32;: Date &#32;; heure &#32;; identit&eacute; de l'utilisateur &#32;; nom de l'objet &#32;; type de l'action &#32;; <strong>attribut de l'objet</strong>.

<li>Actions d'utilisateurs autoris&eacute;s affectant la s&eacute;curit&eacute; de la TOE &#32;:<br>	Donn&eacute;es exig&eacute;es &#32;: Date &#32;; heure &#32;; identit&eacute; de l'utilisateur &#32;; type de l'action &#32;; nom <strong>et attribut </strong>de l'objet sur lequel porte l'action (de telles actions sont l'introduction ou la suppression (suspension) d'utilisateurs &#32;; l'introduction ou le retrait de supports de stockage &#32;; le d&eacute;marrage ou l'arr&ecirc;t de la TOE &#32;; <strong>l'assignation d'un attribut &#32;; la modification des attributs, des marques ou de la classification d'un canal</strong>).
</ul><p>

Les utilisateurs non autoris&eacute;s ne doivent pas avoir acc&egrave;s aux donn&eacute;es d'imputation. Il doit &ecirc;tre possible de mettre s&eacute;lectivement en oeuvre l'imputation pour un ou plusieurs utilisateurs. Il doit exister des outils pour examiner et maintenir les fichiers d'imputation et ces outils doivent &ecirc;tre document&eacute;s. Ils doivent permettre d'identifier s&eacute;lectivement les actions d'un ou de plusieurs utilisateurs.<p>

<a name="899197">
<h4> Audit</h4>
</a>Il doit exister des outils pour examiner les fichiers d'imputation pour les besoins d'audit et ces outils doivent &ecirc;tre document&eacute;s. Ils doivent permettre d'identifier s&eacute;lectivement les actions d'un ou de plusieurs utilisateurs.<p>

<a name="899199">
<h4> R&eacute;utilisation d'objet</h4>
</a>Tous les objets de stockage rendus &agrave; la TOE doivent, avant d'&ecirc;tre r&eacute;utilis&eacute;s par d'autres sujets, &ecirc;tre trait&eacute;s d'une mani&egrave;re telle qu'aucune conclusion ne puisse &ecirc;tre tir&eacute;e concernant leur contenu pr&eacute;c&eacute;dent.<p>

<a name="899201">
<center><h2> Exemple de classe de fonctionnalit&eacute; : F-B2</h2></center>
</a><a name="899202">
<h4> Objectif</h4>
</a><strong>L'exemple de classe F-B2 est d&eacute;riv&eacute; des exigences fonctionnelles de la classe B2 du TCSEC am&eacute;ricain. Elle &eacute;tend le contr&ocirc;le d'acc&egrave;s par mandats &agrave; tous les sujets et objets et renforce les exigences d'authentification de la classe B1.</strong>-<p>

<a name="899204">
<h4> M&eacute;canismes obligatoires</h4>
</a><strong>Cette classe exige que le contr&ocirc;le d'acc&egrave;s soit impl&eacute;ment&eacute; &agrave; l'aide d'un m&eacute;canisme de validation &agrave; r&eacute;f&eacute;rence unique qui impl&eacute;mente le concept de moniteur de r&eacute;f&eacute;rence, c'est &agrave; dire que le m&eacute;canisme doit &ecirc;tre r&eacute;sistant &agrave; l'intrusion, syst&eacute;matiquement utilis&eacute; et suffisamment petit (ayant une organisation suffisamment simple et une complexit&eacute; suffisamment faible) pour &ecirc;tre soumis &agrave; une analyse et &agrave; des tests dont la compl&eacute;tude puisse &ecirc;tre assur&eacute;e.</strong>-<p>

<a name="899206">
<h4> Identification et authentification</h4>
</a>La TOE doit identifier et authentifier de fa&ccedil;on unique les utilisateurs. L'identification et l'authentification doivent avoir lieu avant toute autre interaction entre la TOE et l'utilisateur. D'autres interactions ne doivent &ecirc;tre possibles qu'apr&egrave;s une identification et une authentification r&eacute;ussies. Les informations d'authentification doivent &ecirc;tre stock&eacute;es de fa&ccedil;on telle qu'elles soient seulement accessibles par des utilisateurs autoris&eacute;s.<strong> L'identification et l'authentification doivent &ecirc;tre trait&eacute;es &agrave; travers un chemin de confiance entre l'utilisateur et la TOE initialis&eacute; par l'utilisateur.</strong> Pour chaque interaction, la TOE doit pouvoir &eacute;tablir l'identit&eacute; de l'utilisateur.<p>

<a name="899208">
<h4> Contr&ocirc;le d'acc&egrave;s</h4>
</a>La TOE doit pouvoir distinguer et administrer les droits d'acc&egrave;s de chaque utilisateur sur les objets soumis &agrave; l'administration des droits, au niveau d'un utilisateur individuel, au niveau de l'appartenance &agrave; un groupe d'utilisateurs, ou aux deux niveaux.<strong> Il doit &ecirc;tre possible de regrouper des droits d'acc&egrave;s pour servir de base &agrave; des r&ocirc;les. Au minimum, doivent pouvoir &ecirc;tre d&eacute;finis les r&ocirc;les d'op&eacute;rateur de la TOE et d'administrateur de la TOE.</strong> Il doit &ecirc;tre possible de refuser compl&egrave;tement &agrave; des utilisateurs ou &agrave; des groupes d'utilisateurs l'acc&egrave;s &agrave; un objet. Il doit &ecirc;tre &eacute;galement possible de limiter l'acc&egrave;s d'un utilisateur &agrave; un objet aux seules op&eacute;rations qui ne modifient pas cet objet. Il doit &ecirc;tre possible d'accorder les droits d'acc&egrave;s &agrave; un objet en descendant jusqu'au niveau de granularit&eacute; de l'utilisateur individuel.<p>

Il ne doit pas &ecirc;tre possible &agrave; quelqu'un qui n'est pas un utilisateur autoris&eacute; d'accorder ou de retirer des droits d'acc&egrave;s &agrave; un objet. L'administration des droits doit disposer de contr&ocirc;les pour limiter la propagation des droits d'acc&egrave;s. De m&ecirc;me, seuls des utilisateurs autoris&eacute;s doivent pouvoir introduire de nouveaux utilisateurs, supprimer ou suspendre des utilisateurs existants.<p>

En outre, la TOE doit donner des attributs &agrave; tous les sujets et &agrave; tous les <strong>objets</strong> (par exemple les processus, les fichiers, les segments de m&eacute;moire, les dispositifs). Les valeurs de ces attributs doivent servir de base pour les droits d'acc&egrave;s par mandats. Des r&egrave;gles doivent sp&eacute;cifier quelles combinaisons de valeurs d'attributs d'un sujet et d'un objet sont n&eacute;cessaires pour que l'acc&egrave;s &agrave; cet objet soit accord&eacute; au sujet.<p>

Lorsqu'un objet est export&eacute;, ses attributs doivent &ecirc;tre export&eacute;s d'une mani&egrave;re telle que celui qui les re&ccedil;oit puisse reconstituer leur valeur sans ambigu&iuml;t&eacute;.<p>

Les droits d'acc&egrave;s par mandats doivent &ecirc;tre con&ccedil;us de telle mani&egrave;re que le cas sp&eacute;cial suivant puisse &ecirc;tre r&eacute;alis&eacute; &#32;:<p>

L'attribut comprend deux parties &#32;: la premi&egrave;re peut prendre des valeurs ordonn&eacute;es hi&eacute;rarchiquement, la seconde repr&eacute;sente un ensemble. (Dans le domaine gouvernemental, la premi&egrave;re partie contient des classifications, par exemple non classifi&eacute;, confidentiel, secret, tr&egrave;s secret. La seconde contient des cat&eacute;gories.)<p>

On dit qu'un attribut A domine un attribut B si &#32;:<p>

la premi&egrave;re partie de A est hi&eacute;rarchiquement sup&eacute;rieure ou &eacute;gale &agrave; la premi&egrave;re partie de B, et la deuxi&egrave;me partie de B est un sous-ensemble de la deuxi&egrave;me partie de A ou lui est &eacute;gale.<p>

Les r&egrave;gles suivantes doivent &ecirc;tre impos&eacute;es &#32;:<p>

<ul>
<li>L'acc&egrave;s en lecture d'un sujet &agrave; un objet n'est autoris&eacute; que si l'attribut du sujet domine celui de l'objet &#32;;

<li>L'acc&egrave;s en &eacute;criture d'un sujet &agrave; un objet n'est autoris&eacute; que si l'attribut de l'objet domine celui du sujet.
</ul><p>

Les attributs d'un sujet cr&eacute;&eacute; pour agir au nom d'un utilisateur doivent &ecirc;tre domin&eacute;s par l'habilitation et l'autorisation de cet utilisateur telles qu'elles ont &eacute;t&eacute; d&eacute;termin&eacute;es au moment de l'identification et de l'authentification. Si les donn&eacute;es import&eacute;es n'ont pas d'attribut, un utilisateur autoris&eacute; doit pouvoir leur en assigner.<p>

Chaque canal d'exportation doit pouvoir &ecirc;tre identifi&eacute; comme &eacute;tant soit &agrave; niveau unique, soit multi-niveau. Il doit &ecirc;tre impossible de transmettre ou de recevoir des donn&eacute;es par des canaux d&eacute;sign&eacute;s comme &eacute;tant &agrave; niveau unique, &agrave; moins que les attributs de ces donn&eacute;es ne correspondent &agrave; un attribut pr&eacute;sp&eacute;cifi&eacute; d&eacute;termin&eacute;. Les donn&eacute;es transmises ou re&ccedil;ues par un un canal &agrave; niveau unique doivent &ecirc;tre communiqu&eacute;es avec un attribut correspondant, sauf s'il est possible &agrave; un utilisateur autoris&eacute; de sp&eacute;cifier l'attribut du canal d'une fa&ccedil;on qui ne puisse pas &ecirc;tre imit&eacute;e. Dans ce cas, l'attribut des donn&eacute;es est implicitement sp&eacute;cifi&eacute; par l'attribut du canal.<p>

Pour les canaux multi-niveaux, le protocole de communication doit garantir que le destinataire pourra compl&egrave;tement et sans ambigu&iuml;t&eacute; reconstituer et mettre en correspondance les donn&eacute;es et les attributs re&ccedil;us.<strong> Pour les canaux multi-niveaux, il doit &ecirc;tre possible de d&eacute;clarer les attributs maximums et minimums. Aucune donn&eacute;e ne doit &ecirc;tre transmise par un canal multi-niveau &agrave; moins que l'attribut de cette donn&eacute;e domine l'attribut minimum du canal et qu'il soit domin&eacute; par l'attribut maximum du canal.</strong><p>

Des utilisateurs non autoris&eacute;s ne doivent pas pouvoir modifier les attributs d'un canal qui touchent &agrave; la s&eacute;curit&eacute;. Il ne doit pas &ecirc;tre possible de modifier ces attributs sans que la modification soit effectu&eacute;e explicitement.<p>

La TOE doit marquer les sorties lisibles par l'homme avec des valeurs d'attribut. Les valeurs d'attribut doivent &ecirc;tre d&eacute;termin&eacute;es suivant les r&egrave;gles &eacute;tablies dans la TOE. Des utilisateurs autoris&eacute;s doivent pouvoir sp&eacute;cifier le libell&eacute; imprimable de chaque valeur d'attribut.<p>

<strong>Un utilisateur doit &ecirc;tre inform&eacute; imm&eacute;diatement de toute modification apport&eacute;e au niveau de s&eacute;curit&eacute; qui lui est associ&eacute; pendant une session interactive. L'utilisateur doit pouvoir &agrave; tout moment passer en revue tous les attributs du sujet.</strong>-<p>

Lors de toute tentative par des utilisateurs ou des groupes d'utilisateurs d'acc&eacute;der &agrave; des objets soumis &agrave; l'administration des droits, la TOE doit v&eacute;rifier la validit&eacute; de la demande. Les tentatives d'acc&egrave;s non autoris&eacute; doivent &ecirc;tre rejet&eacute;es. Les valeurs des attributs doivent servir de base aux d&eacute;cisions concernant le contr&ocirc;le d'acc&egrave;s par mandats. Les r&egrave;gles doivent sp&eacute;cifier sans ambigu&iuml;t&eacute; quand un sujet est autoris&eacute; &agrave; avoir acc&egrave;s &agrave; un objet ainsi prot&eacute;g&eacute;. Si des droits d'acc&egrave;s discr&eacute;tionnaires sont aussi attribu&eacute;s &agrave; un objet, l'acc&egrave;s ne doit &ecirc;tre autoris&eacute; qu'&agrave; condition que les droits d'acc&egrave;s par mandats et discr&eacute;tionnaires le permettent tous les deux.<p>

<strong>Il ne doit exister aucun canal de stockage connu qui puisse transf&eacute;rer de l'information entre des processus sans v&eacute;rification de droits d'acc&egrave;s (c'est &agrave; dire de fa&ccedil;on cach&eacute;e) et qui ait une bande passante maximum (d&eacute;termin&eacute;e par des mesures r&eacute;elles ou par une estimation technique) d'un niveau inacceptable. (Se r&eacute;f&eacute;rer au guide pour les canaux cach&eacute;s du TCSEC [TCSEC] pour les indications d'acceptabilit&eacute;.)</strong>-<p>

<a name="899228">
<h4> Imputabilit&eacute;</h4>
</a>La TOE doit comporter un composant d'imputation qui soit capable, pour chacun des &eacute;v&eacute;nements suivants, d'enregistrer cet &eacute;v&eacute;nement avec les donn&eacute;es exig&eacute;es &#32;:<p>

<ul>
<li>Utilisation du m&eacute;canisme d'identification et d'authentification &#32;:<br>Donn&eacute;es exig&eacute;es &#32;: Date &#32;; heure &#32;; identit&eacute; fournie par l'utilisateur &#32;; identification de l'&eacute;quipement sur lequel le m&eacute;canisme d'identification et d'authentification a &eacute;t&eacute; utilis&eacute; (par exemple identificateur du terminal) &#32;; r&eacute;ussite ou &eacute;chec de la tentative &#32;; autorisation de l'utilisateur.

<li>Actions qui tentent d'exercer des droits d'acc&egrave;s &agrave; un objet soumis &agrave; l'administration des droits &#32;:<br>	Donn&eacute;es exig&eacute;es &#32;: Date &#32;; heure &#32;; identit&eacute; de l'utilisateur &#32;; nom de l'objet &#32;; type de la tentative d'acc&egrave;s &#32;; r&eacute;ussite ou &eacute;chec de la tentative &#32;; attribut de l'objet.

<li>Cr&eacute;ation ou suppression d'un objet soumis &agrave; l'administration des droits &#32;:<br>	Donn&eacute;es exig&eacute;es &#32;: Date &#32;; heure &#32;; identit&eacute; de l'utilisateur &#32;; nom de l'objet &#32;; type de l'action &#32;; attribut de l'objet.

<li>Actions d'utilisateurs autoris&eacute;s affectant la s&eacute;curit&eacute; de la TOE &#32;:<br>	Donn&eacute;es exig&eacute;es &#32;: Date &#32;; heure &#32;; identit&eacute; de l'utilisateur &#32;; type de l'action &#32;; nom et attribut de l'objet sur lequel porte l'action (de telles actions sont l'introduction ou la suppression (suspension) d'utilisateurs &#32;; l'introduction ou le retrait de supports de stockage &#32;; le d&eacute;marrage ou l'arr&ecirc;t de la TOE &#32;; l'assignation d'un attribut &#32;; la modification des attributs, des marques ou de la classification d'un canal).
</ul><p>

Les utilisateurs non autoris&eacute;s ne doivent pas avoir acc&egrave;s aux donn&eacute;es d'imputation. Il doit &ecirc;tre possible de mettre s&eacute;lectivement en oeuvre l'imputation pour un ou plusieurs utilisateurs. Il doit exister des outils pour examiner et maintenir les fichiers d'imputation et ces outils doivent &ecirc;tre document&eacute;s. Ils doivent permettre d'identifier s&eacute;lectivement les actions d'un ou de plusieurs utilisateurs.<p>

<a name="899239">
<h4> Audit</h4>
</a>Il doit exister des outils pour examiner les fichiers d'imputation pour les besoins d'audit et ces outils doivent &ecirc;tre document&eacute;s. Ils doivent permettre d'identifier s&eacute;lectivement les actions d'un ou de plusieurs utilisateurs.<strong> En outre, la TOE doit &ecirc;tre capable d'auditer les &eacute;v&eacute;nements connus qui pourraient &ecirc;tre utilis&eacute;s de fa&ccedil;on malveillante pour permettre un flux non autoris&eacute; d'informations par exploitation de canaux cach&eacute;s.</strong><p>

<a name="899241">
<h4> R&eacute;utilisation d'objet</h4>
</a>Tous les objets de stockage rendus &agrave; la TOE doivent, avant d'&ecirc;tre r&eacute;utilis&eacute;s par d'autres sujets, &ecirc;tre trait&eacute;s d'une mani&egrave;re telle qu'aucune conclusion ne puisse &ecirc;tre tir&eacute;e concernant leur contenu pr&eacute;c&eacute;dent.<p>

<a name="899243">
<center><h2> Exemple de classe de fonctionnalit&eacute; : F-B3</h2></center>
</a><a name="899244">
<h4> Objectif</h4>
</a><strong>L'exemple de classe F-B3 est d&eacute;riv&eacute; des exigences fonctionnelles des classes B3 et A1 du TCSEC am&eacute;ricain. En plus des fonctions de la classe B2, elle fournit des fonctions pour permettre la mise en oeuvre de r&ocirc;les distincts d'administration de la s&eacute;curit&eacute;, et l'audit est &eacute;tendu pour signaler les &eacute;v&eacute;nements touchant &agrave; la s&eacute;curit&eacute;.</strong>-<p>

<a name="899246">
<h4> M&eacute;canismes obligatoires</h4>
</a>Cette classe exige que le contr&ocirc;le d'acc&egrave;s soit impl&eacute;ment&eacute; &agrave; l'aide d'un m&eacute;canisme de validation &agrave; r&eacute;f&eacute;rence unique qui impl&eacute;mente le concept de moniteur de r&eacute;f&eacute;rence, c'est &agrave; dire que le m&eacute;canisme doit &ecirc;tre r&eacute;sistant &agrave; l'intrusion, syst&eacute;matiquement utilis&eacute; et suffisamment petit (ayant une organisation suffisamment simple et une complexit&eacute; suffisamment faible) pour &ecirc;tre soumis &agrave; une analyse et &agrave; des tests dont la compl&eacute;tude puisse &ecirc;tre assur&eacute;e.<p>

<a name="899248">
<h4> Identification et authentification</h4>
</a>La TOE doit identifier et authentifier de fa&ccedil;on unique les utilisateurs. L'identification et l'authentification doivent avoir lieu avant toute autre interaction entre la TOE et l'utilisateur. D'autres interactions ne doivent &ecirc;tre possibles qu'apr&egrave;s une identification et une authentification r&eacute;ussies. Les informations d'authentification doivent &ecirc;tre stock&eacute;es de fa&ccedil;on telle qu'elles soient seulement accessibles par des utilisateurs autoris&eacute;s. L'identification et l'authentification doivent &ecirc;tre trait&eacute;es &agrave; travers un chemin de confiance entre l'utilisateur et la TOE initialis&eacute; par l'utilisateur<strong> ou par la TOE</strong>. Pour chaque interaction, la TOE doit pouvoir &eacute;tablir l'identit&eacute; de l'utilisateur.<p>

<a name="899250">
<h4> Contr&ocirc;le d'acc&egrave;s</h4>
</a>La TOE doit pouvoir distinguer et administrer les droits d'acc&egrave;s de chaque utilisateur sur les objets soumis &agrave; l'administration des droits, au niveau d'un utilisateur individuel, au niveau de l'appartenance &agrave; un groupe d'utilisateurs, ou aux deux niveaux. Il doit &ecirc;tre possible de regrouper des droits d'acc&egrave;s pour servir de base &agrave; des r&ocirc;les. Au minimum, doivent pouvoir &ecirc;tre d&eacute;finis les r&ocirc;les d'op&eacute;rateur de la TOE et d'administrateur de la TOE.<strong> Les r&ocirc;les d'op&eacute;rateur de la TOE, d'administrateur de la TOE et d'officier de s&eacute;curit&eacute; de la TOE doivent &ecirc;tre s&eacute;par&eacute;s.</strong> Il doit &ecirc;tre possible de refuser compl&egrave;tement &agrave; des utilisateurs ou &agrave; des groupes d'utilisateurs l'acc&egrave;s &agrave; un objet. Il doit &eacute;galement &ecirc;tre possible de limiter l'acc&egrave;s d'un utilisateur &agrave; un objet aux seules op&eacute;rations qui ne modifient pas cet objet. Il doit &ecirc;tre possible d'accorder les droits d'acc&egrave;s &agrave; un objet en descendant jusqu'au niveau de granularit&eacute; de l'utilisateur individuel. Il ne doit pas &ecirc;tre possible &agrave; quelqu'un qui n'est pas un utilisateur autoris&eacute; d'accorder ou de retirer des droits d'acc&egrave;s &agrave; un objet.<p>

<strong>Pour chaque objet soumis &agrave; l'administration des droits, il doit &ecirc;tre possible de fournir une liste d'utilisateurs et une liste de groupes d'utilisateurs avec leurs droits sur cet objet. De plus, pour chacun de ces objets, il doit aussi &ecirc;tre possible de fournir une liste des utilisateurs et une liste des groupes d'utilisateurs auxquels l'acc&egrave;s &agrave; cet objet est interdit.</strong> L'administration des droits doit disposer de contr&ocirc;les pour limiter la propagation des droits d'acc&egrave;s. De m&ecirc;me, seuls des utilisateurs autoris&eacute;s doivent pouvoir introduire de nouveaux utilisateurs, supprimer ou suspendre des utilisateurs existants.<p>

En outre, la TOE doit donner des attributs &agrave; tous les sujets et &agrave; tous les objets (par exemple les processus, les fichiers, les segments de m&eacute;moire, les dispositifs). Les valeurs de ces attributs doivent servir de base pour les droits d'acc&egrave;s par mandats. Des r&egrave;gles doivent sp&eacute;cifier quelles combinaisons de valeurs d'attributs d'un sujet et d'un objet sont n&eacute;cessaires pour que l'acc&egrave;s &agrave; cet objet soit accord&eacute; au sujet.<p>

Lorsqu'un objet est export&eacute;, ses attributs doivent &ecirc;tre export&eacute;s d'une mani&egrave;re telle que celui qui les re&ccedil;oit puisse reconstituer leur valeur sans ambigu&iuml;t&eacute;.<p>

Les droits d'acc&egrave;s par mandats doivent &ecirc;tre con&ccedil;us de telle mani&egrave;re que le cas sp&eacute;cial suivant puisse &ecirc;tre r&eacute;alis&eacute; &#32;:<p>

L'attribut comprend deux parties &#32;: la premi&egrave;re peut prendre des valeurs ordonn&eacute;es hi&eacute;rarchiquement, la seconde repr&eacute;sente un ensemble. (Dans le domaine gouvernemental, la premi&egrave;re partie contient des classifications, par exemple non classifi&eacute;, confidentiel, secret, tr&egrave;s secret. La seconde contient des cat&eacute;gories.)<p>

On dit qu'un attribut A domine un attribut B si &#32;:<p>

la premi&egrave;re partie de A est hi&eacute;rarchiquement sup&eacute;rieure ou &eacute;gale &agrave; la premi&egrave;re partie de B, et la deuxi&egrave;me partie de B est un sous-ensemble de la deuxi&egrave;me partie de A ou lui est &eacute;gale.<p>

Les r&egrave;gles suivantes doivent &ecirc;tre impos&eacute;es &#32;:<p>

<ul>
<li>L'acc&egrave;s en lecture d'un sujet &agrave; un objet n'est autoris&eacute; que si l'attribut du sujet domine celui de l'objet &#32;;

<li>L'acc&egrave;s en &eacute;criture d'un sujet &agrave; un objet n'est autoris&eacute; que si l'attribut de l'objet domine celui du sujet.
</ul><p>

Les attributs d'un sujet cr&eacute;&eacute; pour agir au nom d'un utilisateur doivent &ecirc;tre domin&eacute;s par l'habilitation et l'autorisation de cet utilisateur telles qu'elles ont &eacute;t&eacute; d&eacute;termin&eacute;es au moment de l'identification et de l'authentification. Si les donn&eacute;es import&eacute;es n'ont pas d'attribut, un utilisateur autoris&eacute; doit pouvoir leur en assigner.<p>

Chaque canal d'exportation doit pouvoir &ecirc;tre identifi&eacute; comme &eacute;tant soit &agrave; niveau unique, soit multi-niveau. Il doit &ecirc;tre impossible de transmettre ou de recevoir des donn&eacute;es par des canaux d&eacute;sign&eacute;s comme &eacute;tant &agrave; niveau unique, &agrave; moins que les attributs de ces donn&eacute;es ne correspondent &agrave; un attribut pr&eacute;sp&eacute;cifi&eacute; d&eacute;termin&eacute;. Les donn&eacute;es transmises ou re&ccedil;ues par un un canal &agrave; niveau unique doivent &ecirc;tre communiqu&eacute;es avec un attribut correspondant, sauf s'il est possible &agrave; un utilisateur autoris&eacute; de sp&eacute;cifier l'attribut du canal d'une fa&ccedil;on qui ne puisse pas &ecirc;tre imit&eacute;e. Dans ce cas, l'attribut des donn&eacute;es est implicitement sp&eacute;cifi&eacute; par l'attribut du canal.<p>

Pour les canaux multi-niveaux, le protocole de communication doit garantir que le destinataire pourra compl&egrave;tement et sans ambigu&iuml;t&eacute; reconstituer et mettre en correspondance les donn&eacute;es et les attributs re&ccedil;us. Pour les canaux multi-niveaux, il doit &ecirc;tre possible de d&eacute;clarer les attributs maximums et minimums. Aucune donn&eacute;e ne doit &ecirc;tre transmise par un canal multi-niveau &agrave; moins que l'attribut de cette donn&eacute;e domine l'attribut minimum du canal et qu'il soit domin&eacute; par l'attribut maximum du canal.<p>

Des utilisateurs non autoris&eacute;s ne doivent pas pouvoir modifier les attributs d'un canal qui touchent &agrave; la s&eacute;curit&eacute;. Il ne doit pas &ecirc;tre possible de modifier ces attributs sans que la modification soit effectu&eacute;e explicitement.<p>

La TOE doit marquer les sorties lisibles par l'homme avec des valeurs d'attribut. Les valeurs d'attribut doivent &ecirc;tre d&eacute;termin&eacute;es suivant les r&egrave;gles &eacute;tablies dans la TOE. Des utilisateurs autoris&eacute;s doivent pouvoir sp&eacute;cifier le libell&eacute; imprimable de chaque valeur d'attribut.<p>

Un utilisateur doit &ecirc;tre inform&eacute; imm&eacute;diatement de toute modification apport&eacute;e au niveau de s&eacute;curit&eacute; qui lui est associ&eacute; pendant une session interactive. L'utilisateur doit pouvoir &agrave; tout moment passer en revue tous les attributs du sujet.<p>

Lors de toute tentative par des utilisateurs ou des groupes d'utilisateurs d'acc&eacute;der &agrave; des objets soumis &agrave; l'administration des droits, la TOE doit v&eacute;rifier la validit&eacute; de la demande. Les tentatives d'acc&egrave;s non autoris&eacute; doivent &ecirc;tre rejet&eacute;es. Les valeurs des attributs doivent servir de base aux d&eacute;cisions concernant le contr&ocirc;le d'acc&egrave;s par mandats. Les r&egrave;gles doivent sp&eacute;cifier sans ambigu&iuml;t&eacute; quand un sujet est autoris&eacute; &agrave; avoir acc&egrave;s &agrave; un objet ainsi prot&eacute;g&eacute;. Si des droits d'acc&egrave;s discr&eacute;tionnaires sont aussi attribu&eacute;s &agrave; un objet, l'acc&egrave;s ne doit &ecirc;tre autoris&eacute; qu'&agrave; condition que les droits d'acc&egrave;s par mandats et discr&eacute;tionnaires le permettent tous les deux.<p>

Il ne doit exister aucun canal connu de stockage <strong>ou de s&eacute;quencement</strong> qui puisse transf&eacute;rer de l'information entre des processus sans v&eacute;rification de droits d'acc&egrave;s (c'est &agrave; dire de fa&ccedil;on cach&eacute;e) et qui ait une bande passante maximum (d&eacute;termin&eacute;e par des mesures r&eacute;elles ou par une estimation technique) d'un niveau inacceptable. (Se r&eacute;f&eacute;rer au guide pour les canaux cach&eacute;s du TCSEC [TCSEC] pour les indications d'acceptabilit&eacute;.)<p>

<a name="899270">
<h4> Imputabilit&eacute;</h4>
</a>La TOE doit comporter un composant d'imputation qui soit capable, pour chacun des &eacute;v&eacute;nements suivants, d'enregistrer cet &eacute;v&eacute;nement avec les donn&eacute;es exig&eacute;es &#32;:<p>

<ul>
<li>Utilisation du m&eacute;canisme d'identification et d'authentification &#32;:<br>Donn&eacute;es exig&eacute;es &#32;: Date &#32;; heure &#32;; identit&eacute; fournie par l'utilisateur &#32;; identification de l'&eacute;quipement sur lequel le m&eacute;canisme d'identification et d'authentification a &eacute;t&eacute; utilis&eacute; (par exemple identificateur du terminal) &#32;; r&eacute;ussite ou &eacute;chec de la tentative &#32;; autorisation de l'utilisateur.

<li>Actions qui tentent d'exercer des droits d'acc&egrave;s &agrave; un objet soumis &agrave; l'administration des droits &#32;:<br>Donn&eacute;es exig&eacute;es &#32;: Date &#32;; heure &#32;; identit&eacute; de l'utilisateur &#32;; nom de l'objet &#32;; type de la tentative d'acc&egrave;s &#32;; r&eacute;ussite ou &eacute;chec de la tentative &#32;; attribut de l'objet.

<li>Cr&eacute;ation ou suppression d'un objet soumis &agrave; l'administration des droits &#32;:<br>Donn&eacute;es exig&eacute;es &#32;: Date &#32;; heure &#32;; identit&eacute; de l'utilisateur &#32;; nom de l'objet &#32;; type de l'action &#32;; attribut de l'objet.

<li>Actions d'utilisateurs autoris&eacute;s affectant la s&eacute;curit&eacute; de la TOE &#32;:<br>Donn&eacute;es exig&eacute;es &#32;: Date &#32;; heure &#32;; identit&eacute; de l'utilisateur &#32;; type de l'action &#32;; nom et attribut de l'objet sur lequel porte l'action (de telles actions sont l'introduction ou la suppression (suspension) d'utilisateurs &#32;; l'introduction ou le retrait de supports de stockage &#32;; le d&eacute;marrage ou l'arr&ecirc;t de la TOE &#32;; l'assignation d'un attribut &#32;; la modification des attributs, des marques ou de la classification d'un canal).
</ul><p>

Les utilisateurs non autoris&eacute;s ne doivent pas avoir acc&egrave;s aux donn&eacute;es d'imputation. Il doit &ecirc;tre possible de mettre s&eacute;lectivement en oeuvre l'imputation pour un ou plusieurs utilisateurs. Il doit exister des outils pour examiner et maintenir les fichiers d'imputation et ces outils doivent &ecirc;tre document&eacute;s. Ils doivent permettre d'identifier s&eacute;lectivement les actions d'un ou de plusieurs utilisateurs.<p>

<a name="899281">
<h4> Audit</h4>
</a>Il doit exister des outils pour examiner les fichiers d'imputation pour les besoins d'audit et ces outils doivent &ecirc;tre document&eacute;s. Ils doivent permettre d'identifier s&eacute;lectivement les actions d'un ou de plusieurs utilisateurs. En outre, la TOE doit &ecirc;tre capable d'auditer les &eacute;v&eacute;nements connus qui pourraient &ecirc;tre utilis&eacute;s de fa&ccedil;on malveillante pour permettre un flux non autoris&eacute; d'informations par exploitation de canaux cach&eacute;s.<p>

<strong>De plus, il doit exister un m&eacute;canisme pour surveiller l'apparition d'&eacute;v&eacute;nements qui, soit touchent particuli&egrave;rement &agrave; la s&eacute;curit&eacute;, soit, en raison de leur fr&eacute;quence, peuvent devenir une menace critique pour la s&eacute;curit&eacute; de la TOE. Ce m&eacute;canisme doit pouvoir notifier sans d&eacute;lai &agrave; un utilisateur particulier ou ayant un r&ocirc;le particulier l'apparition de tels &eacute;v&eacute;nements. Le m&eacute;canisme doit mettre en oeuvre l'action la moins perturbatrice pour mettre fin &agrave; de tels &eacute;v&eacute;nements.</strong>-<p>

<a name="899284">
<h4> R&eacute;utilisation d'objet</h4>
</a>Tous les objets de stockage rendus &agrave; la TOE doivent, avant d'&ecirc;tre r&eacute;utilis&eacute;s par d'autres sujets, &ecirc;tre trait&eacute;s d'une mani&egrave;re telle qu'aucune conclusion ne puisse &ecirc;tre tir&eacute;e concernant leur contenu pr&eacute;c&eacute;dent.<p>

<a name="899286">
<center><h2> Exemple de classe de fonctionnalit&eacute; : F-IN</h2></center>
</a><a name="899287">
<h4> Objectif</h4>
</a>L'exemple de classe de fonctionnalit&eacute; F-IN concerne les TOE pour lesquelles il y a des exigences &eacute;lev&eacute;es d'int&eacute;grit&eacute; pour les donn&eacute;es et les programmes. De telles exigences peuvent &ecirc;tre n&eacute;cessaires par exemple pour des TOE bases de donn&eacute;es.<p>

<a name="899289">
<h4> Identification et authentification</h4>
</a>La TOE doit identifier et authentifier de fa&ccedil;on unique les utilisateurs. L'identification et l'authentification doivent avoir lieu avant toute autre interaction entre la TOE et l'utilisateur. D'autres interactions ne doivent &ecirc;tre possibles qu'apr&egrave;s une identification et une authentification r&eacute;ussies. Les informations d'authentification doivent &ecirc;tre stock&eacute;es de fa&ccedil;on telle qu'elles soient seulement accessibles pour consultation ou modification par des utilisateurs autoris&eacute;s. Pour chaque interaction, la TOE doit pouvoir &eacute;tablir l'identit&eacute; de l'utilisateur.<p>

<a name="899291">
<h4> Contr&ocirc;le d'acc&egrave;s</h4>
</a>La TOE doit pouvoir distinguer et administrer les droits d'acc&egrave;s des utilisateurs, des r&ocirc;les et des processus aux objets d&eacute;sign&eacute;s explicitement (le terme r&ocirc;le d&eacute;signe des utilisateurs qui ont des attributs sp&eacute;ciaux). Il doit &ecirc;tre possible de restreindre l'acc&egrave;s des utilisateurs &agrave; ces objets d'une fa&ccedil;on telle que cet acc&egrave;s ne soit possible que par l'interm&eacute;diaire de processus &eacute;tablis sp&eacute;cialement. De plus, il doit &ecirc;tre possible d'affecter des objets &agrave; un type pr&eacute;d&eacute;fini. Il doit aussi &ecirc;tre possible de sp&eacute;cifier pour chaque type d'objet quels sont les utilisateurs, les r&ocirc;les ou les processus qui peuvent disposer de certains types d'acc&egrave;s &agrave; ces objets. Cela devrait permettre de limiter l'acc&egrave;s des utilisateurs aux objets d'un certain type d'une fa&ccedil;on telle que cet acc&egrave;s ne soit possible que par l'interm&eacute;diaire de processus d&eacute;finis et fix&eacute;s. Il ne devrait &ecirc;tre possible qu'aux utilisateurs autoris&eacute;s de d&eacute;finir des types nouveaux, d'accorder ou de retirer des droits d'acc&egrave;s &agrave; des types. Ces actions doivent &ecirc;tre initialis&eacute;es explicitement par ces utilisateurs. Pour ces actions, toute communication entre l'utilisateur et la TOE doit se faire &agrave; travers un chemin de confiance.<p>

Les droits d'acc&egrave;s minimum suivants doivent exister &#32;: lecture, &eacute;criture, ajout, suppression, renommage (pour tous les objets), ex&eacute;cution, suppression, renommage (pour les objets ex&eacute;cutables), cr&eacute;ation d'objets d'un certain type, suppression d'objets d'un certain type.<p>

Lors de toute tentative par des utilisateurs ou des groupes d'utilisateurs d'acc&eacute;der &agrave; des objets soumis &agrave; l'administration des droits, la TOE doit v&eacute;rifier la validit&eacute; de la demande. Les tentatives d'acc&egrave;s non autoris&eacute; doivent &ecirc;tre rejet&eacute;es.<p>

<a name="899295">
<h4> Imputabilit&eacute;</h4>
</a>La TOE doit comporter un composant d'imputation qui soit capable, pour chacun des &eacute;v&eacute;nements suivants, d'enregistrer cet &eacute;v&eacute;nement avec les donn&eacute;es exig&eacute;es &#32;:<p>

<ul>
<li>Utilisation du m&eacute;canisme d'identification et d'authentification &#32;:<br>Donn&eacute;es exig&eacute;es &#32;: Date &#32;; heure &#32;; identit&eacute; fournie par l'utilisateur &#32;; identification de l'&eacute;quipement sur lequel le m&eacute;canisme d'identification et d'authentification a &eacute;t&eacute; utilis&eacute; (par exemple identificateur du terminal) &#32;; r&eacute;ussite ou &eacute;chec de la tentative.

<li>Actions qui tentent d'exercer des droits d'acc&egrave;s &agrave; un objet soumis &agrave; l'administration des droits &#32;:<br>Donn&eacute;es exig&eacute;es &#32;: Date &#32;; heure &#32;; identit&eacute; de l'utilisateur &#32;; nom de l'objet &#32;; type de la tentative d'acc&egrave;s &#32;; r&eacute;ussite ou &eacute;chec de la tentative.

<li>Cr&eacute;ation ou suppression d'un objet soumis &agrave; l'administration des droits &#32;:<br>Donn&eacute;es exig&eacute;es &#32;: Date &#32;; heure &#32;; identit&eacute; de l'utilisateur &#32;; nom de l'objet &#32;; type de l'action.

<li>Actions d'utilisateurs autoris&eacute;s affectant la s&eacute;curit&eacute; de la TOE &#32;:<br>Donn&eacute;es exig&eacute;es &#32;: Date &#32;; heure &#32;; identit&eacute; de l'utilisateur &#32;; type de l'action &#32;; nom et attribut de l'objet sur lequel porte l'action (de telles actions sont l'introduction ou la suppression (suspension) d'utilisateurs &#32;; l'introduction ou le retrait de supports de stockage &#32;; le d&eacute;marrage ou l'arr&ecirc;t de la TOE).

<li>D&eacute;finition ou suppression de types &#32;:<br>Donn&eacute;es exig&eacute;es &#32;: Date &#32;; heure &#32;; identit&eacute; de l'utilisateur &#32;; type de l'action &#32;; nom du type.

<li>Assignation d'un type &agrave; un objet &#32;:<br>Donn&eacute;es exig&eacute;es &#32;: Date &#32;; heure &#32;; identit&eacute; de l'utilisateur &#32;; nom de l'objet &#32;; nom du type.

<li>Attribution ou r&eacute;vocation de droits d'acc&egrave;s &agrave; un objet ou un type d'objet &#32;:<br>Donn&eacute;es exig&eacute;es &#32;: Date &#32;; heure &#32;; identit&eacute; de l'utilisateur &#32;; type de l'action &#32;; type du droit d'acc&egrave;s &#32;; nom du sujet &#32;; nom de l'objet ou nom du type d'objet.
</ul><p>

Les utilisateurs non autoris&eacute;s ne doivent pas avoir acc&egrave;s aux donn&eacute;es d'imputation. Il doit &ecirc;tre possible de mettre s&eacute;lectivement en oeuvre l'imputation pour un ou plusieurs utilisateurs. Il doit exister des outils pour examiner et maintenir les fichiers d'imputation et ces outils doivent &ecirc;tre document&eacute;s. Ils doivent permettre d'identifier s&eacute;lectivement les actions d'un ou de plusieurs utilisateurs. La structure des enregistrements d'imputation doit &ecirc;tre d&eacute;crite de fa&ccedil;on compl&egrave;te.<p>

<a name="899312">
<h4> Audit</h4>
</a>Il doit exister des outils pour examiner les fichiers d'imputation pour les besoins d'audit et ces outils doivent &ecirc;tre document&eacute;s. Ils doivent permettre d'identifier s&eacute;lectivement les actions d'un ou de plusieurs utilisateurs.<p>

<a name="899314">
<center><h2> Exemple de classe de fonctionnalit&eacute; : F-AV</h2></center>
</a><a name="899315">
<h4> Objectif</h4>
</a>La classe de fonctionnalit&eacute; F-AV impose des exigences &eacute;lev&eacute;es pour la disponibilit&eacute; d'une TOE compl&egrave;te ou de fonctions particuli&egrave;res d'une TOE. De telles exigences sont importantes par exemple pour des TOE qui contr&ocirc;lent des processus industriels.<p>

<a name="899317">
<h4> Fiabilit&eacute; de service</h4>
</a>La TOE doit &ecirc;tre capable de se r&eacute;tablir &agrave; la suite d'une panne de certains composants mat&eacute;riels individuels (par exemple une carte d'un processeur particulier dans une TOE multiprocesseur) de fa&ccedil;on telle que toutes les fonctions exig&eacute;es en permanence restent constamment disponibles dans le reste de la TOE. Apr&egrave;s r&eacute;paration du composant d&eacute;faillant, il doit &ecirc;tre possible de le r&eacute;int&eacute;grer dans la TOE de fa&ccedil;on telle que la continuit&eacute; de l'exploitation des fonctions exig&eacute;es en permanence soit assur&eacute;e. A la suite de cette r&eacute;int&eacute;gration, la TOE doit retrouver son degr&eacute; originel de tol&eacute;rance aux pannes. La dur&eacute;e maximum de tels processus de r&eacute;int&eacute;gration doit &ecirc;tre d&eacute;clar&eacute;e.<p>

A tout moment et quelle que soit sa charge, la TOE doit pouvoir garantir un temps de r&eacute;ponse maximum pour certaines actions sp&eacute;cifi&eacute;es. De plus, pour certaines actions sp&eacute;cifi&eacute;es, il doit &ecirc;tre garanti que la TOE ne sera pas sujette &agrave; une &eacute;treinte fatale.<p>

<a name="899320">
<center><h2> Exemple de classe de fonctionnalit&eacute; : F-DI</h2></center>
</a><a name="899321">
<h4> Objectif</h4>
</a>L'exemple de classe de fonctionnalit&eacute; F-DI impose des exigences &eacute;lev&eacute;es en ce qui concerne la pr&eacute;servation de l'int&eacute;grit&eacute; des donn&eacute;es au cours de leur &eacute;change.<p>

<a name="899323">
<h4> Identification et authentification</h4>
</a>La TOE doit identifier et authentifier de fa&ccedil;on unique les utilisateurs. L'identification et l'authentification doivent avoir lieu avant toute autre interaction entre la TOE et l'utilisateur. D'autres interactions ne doivent &ecirc;tre possibles qu'apr&egrave;s une identification et une authentification r&eacute;ussies. Les informations d'authentification doivent &ecirc;tre stock&eacute;es de fa&ccedil;on telle qu'elles soient seulement accessibles pour consultation ou modification par des utilisateurs autoris&eacute;s. Pour chaque interaction, la TOE doit pouvoir &eacute;tablir l'identit&eacute; de l'utilisateur.<p>

Avant l'&eacute;tablissement d'une connexion, l'entit&eacute; homologue (ordinateur, processus ou utilisateur) doit &ecirc;tre identifi&eacute;e et authentifi&eacute;e de fa&ccedil;on unique. Les donn&eacute;es de l'utilisateur ne doivent &ecirc;tre &eacute;chang&eacute;es qu'apr&egrave;s que l'identification et l'authentification ont &eacute;t&eacute; effectu&eacute;es avec succ&egrave;s. A la r&eacute;ception de donn&eacute;es, il doit &ecirc;tre possible d'identifier et d'authentifier de fa&ccedil;on unique leur &eacute;metteur. Toutes les informations d'authentification doivent &ecirc;tre prot&eacute;g&eacute;es contre un acc&egrave;s non autoris&eacute; ou une contrefa&ccedil;on.<p>

<a name="899326">
<h4> Imputabilit&eacute;</h4>
</a>La TOE doit comporter un composant d'imputation qui soit capable, pour chacun des &eacute;v&eacute;nements suivants, d'enregistrer cet &eacute;v&eacute;nement avec les donn&eacute;es exig&eacute;es &#32;:<p>

<ul>
<li>Utilisation du m&eacute;canisme d'identification et d'authentification &#32;:	<br>Donn&eacute;es exig&eacute;es &#32;: Date &#32;; heure &#32;; initiateur de l'identification et de l'authentification &#32;; nom du sujet &agrave; identifier &#32;; r&eacute;ussite ou &eacute;chec de l'action.

<li>Erreurs identifi&eacute;es pendant l'&eacute;change de donn&eacute;es &#32;:<br>	Donn&eacute;es exig&eacute;es &#32;: Date &#32;; heure &#32;; entit&eacute; homologue dans l'&eacute;change de donn&eacute;es &#32;; nature de l'erreur &#32;; r&eacute;ussite ou &eacute;chec de la tentative de correction.

<li>Echange de donn&eacute;es &#32;:<br>	Donn&eacute;es exig&eacute;es &#32;: Date &#32;; heure &#32;; identit&eacute; de l'utilisateur initiateur &#32;; nom de l'entit&eacute; homologue (ordinateur, processus ou utilisateur) &#32;; param&egrave;tres d'&eacute;tablissement de la connexion (s'ils varient).
</ul><p>

Les utilisateurs non autoris&eacute;s ne doivent pas avoir acc&egrave;s aux donn&eacute;es d'imputation. Il doit &ecirc;tre possible de mettre s&eacute;lectivement en oeuvre l'imputation pour un ou plusieurs utilisateurs. Il doit exister des outils pour examiner et maintenir les fichiers d'imputation et ces outils doivent &ecirc;tre document&eacute;s. Ils doivent permettre d'identifier s&eacute;lectivement les actions d'un ou de plusieurs utilisateurs. La structure des enregistrements d'imputation doit &ecirc;tre compl&egrave;tement d&eacute;crite.<p>

<a name="899335">
<h4> Audit</h4>
</a>Il doit exister des outils pour examiner les fichiers d'imputation pour les besoins d'audit et ces outils doivent &ecirc;tre document&eacute;s. Ils doivent permettre d'identifier s&eacute;lectivement les actions d'un ou de plusieurs utilisateurs.<p>

<a name="899337">
<h4> Echange de donn&eacute;es</h4>
</a>Int&eacute;grit&eacute; des donn&eacute;es<p>

Des m&eacute;thodes de d&eacute;tection et de correction d'erreurs doivent &ecirc;tre appliqu&eacute;es en cas d'&eacute;change de donn&eacute;es. Ces m&eacute;canismes doivent &ecirc;tre con&ccedil;us de mani&egrave;re &agrave; permettre d'identifier les manipulations intentionnelles des champs d'adresse et des donn&eacute;es de l'utilisateur. La connaissance des seuls algorithmes utilis&eacute;s dans les m&eacute;canismes, sans connaissance suppl&eacute;mentaire particuli&egrave;re, ne doit pas permettre une manipulation non reconnue des donn&eacute;es pr&eacute;cit&eacute;es. La connaissance suppl&eacute;mentaire indispensable pour le faire doit &ecirc;tre prot&eacute;g&eacute;e de telle fa&ccedil;on que seul un nombre restreint d'utilisateurs autoris&eacute;s puissent y avoir acc&egrave;s. <p>

De plus, des m&eacute;canismes qui identifient de fa&ccedil;on s&ucirc;re et unique comme une erreur la r&eacute;&eacute;mission non autoris&eacute;e de donn&eacute;es doivent &ecirc;tre utilis&eacute;s.<p>

<a name="899341">
<center><h2> Exemple de classe de fonctionnalit&eacute; : F-DC</h2></center>
</a><a name="899342">
<h4> Objectif</h4>
</a>L'exemple de classe de fonctionnalit&eacute; F-DC est destin&eacute; aux TOE tr&egrave;s exigeantes en mati&egrave;re de confidentialit&eacute; des donn&eacute;es au cours de leur &eacute;change. Un &eacute;quipement cryptographique est un exemple de candidat pour cette classe.<p>

<a name="899344">
<h4> Echange de donn&eacute;es</h4>
</a>Confidentialit&eacute; des donn&eacute;es<p>

La TOE doit &ecirc;tre dot&eacute;e d'un dispositif destin&eacute; &agrave; chiffrer l'information de l'utilisateur avant l'&eacute;change et (c&ocirc;t&eacute; r&eacute;ception) &agrave; la d&eacute;chiffrer automatiquement. Un algorithme officiellement approuv&eacute; par une autorit&eacute; de certification doit &ecirc;tre utilis&eacute;. Il doit &ecirc;tre assur&eacute; que les valeurs des param&egrave;tres (par exemple les cl&eacute;s) n&eacute;cessaires au d&eacute;chiffrement sont prot&eacute;g&eacute;es de telle mani&egrave;re qu'aucune personne non autoris&eacute;e ne puisse avoir acc&egrave;s &agrave; ces donn&eacute;es.<p>

<a name="899347">
<center><h2> Exemple de classe de fonctionnalit&eacute; : F-DX</h2></center>
</a><a name="899348">
<h4> Objectif</h4>
</a>L'exemple de classe de fonctionnalit&eacute; F-DX est destin&eacute; aux r&eacute;seaux tr&egrave;s exigeants en mati&egrave;re de confidentialit&eacute; et d'int&eacute;grit&eacute; des informations &agrave; &eacute;changer. Par exemple, cela peut &ecirc;tre le cas lorsque des informations sensibles doivent &ecirc;tre &eacute;chang&eacute;es &agrave; travers des r&eacute;seaux non prot&eacute;g&eacute;s (par exemple des r&eacute;seaux publics).<p>

<a name="899350">
<h4> Identification et authentification</h4>
</a>La TOE doit identifier et authentifier de fa&ccedil;on unique les utilisateurs. L'identification et l'authentification doivent avoir lieu avant toute autre interaction entre la TOE et l'utilisateur. D'autres interactions ne doivent &ecirc;tre possibles qu'apr&egrave;s une identification et une authentification r&eacute;ussies. Les informations d'authentification doivent &ecirc;tre stock&eacute;es de fa&ccedil;on telle qu'elles soient seulement accessibles pour consultation ou modification par des utilisateurs autoris&eacute;s. Pour toute interaction, la TOE doit pouvoir &eacute;tablir l'identit&eacute; de l'utilisateur.<p>

Avant l'&eacute;change de donn&eacute;es de l'utilisateur, l'entit&eacute; homologue (ordinateur, processus ou utilisateur) doit &ecirc;tre identifi&eacute;e et authentifi&eacute;e de fa&ccedil;on unique. Les donn&eacute;es de l'utilisateur ne doivent &ecirc;tre &eacute;chang&eacute;es qu'apr&egrave;s que l'identification et l'authentification ont &eacute;t&eacute; effectu&eacute;es avec succ&egrave;s. A la r&eacute;ception de donn&eacute;es, il doit &ecirc;tre possible d'identifier et d'authentifier de fa&ccedil;on unique leur &eacute;metteur. Toutes les informations d'authentification doivent &ecirc;tre prot&eacute;g&eacute;es contre un acc&egrave;s non autoris&eacute; ou une contrefa&ccedil;on.<p>

<a name="899353">
<h4> Imputabilit&eacute;</h4>
</a>La TOE doit comporter un composant d'imputation qui soit capable, pour chacun des &eacute;v&eacute;nements suivants, d'enregistrer cet &eacute;v&eacute;nement avec les donn&eacute;es exig&eacute;es &#32;:<p>

<ul>
<li>Utilisation du m&eacute;canisme d'identification et d'authentification &#32;:<br>Donn&eacute;es exig&eacute;es &#32;: Date &#32;; heure &#32;; initiateur de l'identification et de l'authentification &#32;; nom du sujet &agrave; identifier &#32;; r&eacute;ussite ou &eacute;chec de l'action.

<li>Erreurs identifi&eacute;es pendant l'&eacute;change de donn&eacute;es &#32;:<br>	Donn&eacute;es exig&eacute;es &#32;: Date &#32;; heure &#32;; entit&eacute;s homologues dans l'&eacute;change de donn&eacute;es &#32;; type de l'erreur &#32;; r&eacute;ussite ou &eacute;chec de la tentative de correction.

<li>Etablissement de la connexion &#32;:<br>	Donn&eacute;es exig&eacute;es &#32;: Date &#32;; heure &#32;; identit&eacute; de l'utilisateur initiateur &#32;; nom de l'entit&eacute; homologue (ordinateur, processus ou utilisateur) &#32;; param&egrave;tres d'&eacute;tablissement de la connexion (s'ils varient).

<li>Transactions d'&eacute;change de donn&eacute;es sp&eacute;ciales &#32;:<br>Donn&eacute;es exig&eacute;es &#32;: Date &#32;; heure &#32;; identit&eacute; de l'utilisateur &eacute;metteur &#32;; identit&eacute; de l'utilisateur r&eacute;cepteur &#32;; informations de l'utilisateur transmises &#32;; date et heure de la r&eacute;ception des donn&eacute;es.
</ul><p>

Les utilisateurs non autoris&eacute;s ne doivent pas avoir acc&egrave;s aux donn&eacute;es d'imputation. Il doit &ecirc;tre possible de mettre s&eacute;lectivement en oeuvre l'imputation pour un ou plusieurs utilisateurs. Il doit exister des outils pour examiner et maintenir les fichiers d'imputation et ces outils doivent &ecirc;tre document&eacute;s. Ils doivent permettre d'identifier s&eacute;lectivement les actions d'un ou de plusieurs utilisateurs. La structure des enregistrements d'imputation doit &ecirc;tre compl&egrave;tement d&eacute;crite.<p>

<a name="899364">
<h4> Audit</h4>
</a>Il doit exister des outils pour examiner les fichiers d'imputation pour les besoins d'audit et ces outils doivent &ecirc;tre document&eacute;s. Ils doivent permettre d'identifier s&eacute;lectivement les actions d'un ou de plusieurs utilisateurs.<p>

<a name="899366">
<h4> Echange de donn&eacute;es</h4>
</a>Contr&ocirc;le d'acc&egrave;s<p>

Toutes les informations transmises auparavant et pouvant &ecirc;tre utilis&eacute;es pour un d&eacute;chiffrement non autoris&eacute; doivent &ecirc;tre prot&eacute;g&eacute;es de mani&egrave;re telle que seules puissent acc&eacute;der &agrave; ces donn&eacute;es les personnes qui en ont absolument besoin pour pouvoir remplir leur t&acirc;che.<p>

Confidentialit&eacute; des donn&eacute;es<p>

La TOE doit offrir la possibilit&eacute; d'un chiffrement de bout en bout qui garantisse la confidentialit&eacute; en ce qui concerne le destinataire sur de grandes sections du canal de communication. En outre, la confidentialit&eacute; du flux de trafic doit aussi &ecirc;tre garantie sur des liaisons de donn&eacute;es d&eacute;sign&eacute;es. <p>

Int&eacute;grit&eacute; des donn&eacute;es<p>

La TOE doit &ecirc;tre con&ccedil;ue de fa&ccedil;on telle qu'une manipulation non autoris&eacute;e des donn&eacute;es des utilisateurs et des donn&eacute;es d'imputation, et une r&eacute;&eacute;mission de donn&eacute;es non autoris&eacute;e soient identifi&eacute;es de fa&ccedil;on s&ucirc;re comme des erreurs. <p>


<TABLE BGCOLOR="#FF9933"><TR><TD WIDTH=100%>
<CENTER>
<BR><A HREF="/document/criteres.html">Index de la documentation sur les critères</A> | 
<A HREF="/document/index.html">Index général de la documentation</A>
<BR>
<A HREF="/document/docs/ITSEC/itsec.html">Sommaire</A> |
<A HREF="/document/docs/ITSEC/itsec-0.html">Introduction</A> |
<A HREF="/document/docs/ITSEC/itsec-1.html">Champ d'application</A> |
<A HREF="/document/docs/ITSEC/itsec-2.html">Fonctionnalité</A> 
<A HREF="/document/docs/ITSEC/itsec-3.html">Efficacité</A> |
<A HREF="/document/docs/ITSEC/itsec-4.html">Conformité</A> |
<A HREF="/document/docs/ITSEC/itsec-E1.html">Conformité E1</A> |
<A HREF="/document/docs/ITSEC/itsec-E2.html">Conformité E2</A> |
<A HREF="/document/docs/ITSEC/itsec-E3.html">Conformité E3</A> |
<A HREF="/document/docs/ITSEC/itsec-E4.html">Conformité E4</A> |
<A HREF="/document/docs/ITSEC/itsec-E5.html">Conformité E5</A> |
<A HREF="/document/docs/ITSEC/itsec-E6.html">Conformité E6</A>
<A HREF="/document/docs/ITSEC/itsec-5.html">Résultats de l'évaluation</A> |
<A HREF="/document/docs/ITSEC/itsec-6.html">Glossaire</A> |
<A HREF="/document/docs/ITSEC/itsec-A.html">Exemples de classes de Fonctionnalité</A> |
<A HREF="/document/docs/ITSEC/itsec-B.html">"Claims language"</A> |

<BR><BR><a href="itsec.html"><img alt="[Début]" border=0 src="/images/top.gif"></a> <a href="itsec-6.html"><img alt="[Précédente]" border=0 src="/images/prev.gif"></a> <a href="itsec-B.html"><img alt="[Suivante]" border=0 src="/images/next.gif"></a> <a href="itsec-B.html"><img alt="[Fin]" border=0 src="/images/bottom.gif"></a>
<BR><BR>
</TD></TR></TABLE>
</TD></TR></TABLE>
<HR>

<SMALL><A HREF="/courrier.html">
webmaster@scssi.gouv.fr</A>

- Copyright &copy 1999 Service Central de la Sécurité des Systèmes d'Information
<BR>Dernière mise à jour le 17/06/99 à 17:04:24
</SMALL>
</body>
</html>
