<html><head><title>SCSSI : SCSSI : ITSEC v1.2 Champ d'application</title></head>
<body bgcolor=#ffffff>

<TABLE >
<TR><TD WIDTH=161><A HREF="/index.html"><IMG SRC="/images/sigle2.gif" ALT="Retour Page de Garde" ALIGN="TOP" BORDER="0"></A>
</TD><TD WIDTH=100%><CENTER>PREMIER MINISTRE</CENTER>
<P>
<CENTER><B><FONT SIZE=5>Service Central</FONT></B> <B><FONT SIZE=5>de la S&eacute;curit&eacute; des Syst&egrave;mes d'Information</FONT></B></CENTER>
</TD>
</TR>

</TABLE><HR>
<!                      >
<!                      >
<!                      >

<TABLE>
<TR><TD BGCOLOR="#96c7f8" WIDTH=161 VALIGN="TOP">
<BR>
<TABLE WIDTH=161>
<TR><TD BGCOLOR="#ffffff" WIDTH=161 ALIGN="center"><B>DOCUMENTATION</B></TD></TR>
<TR><TD ALIGN="left"><SMALL>
<A HREF="/document/index.html">Index</A> de la documentation<BR><BR>
EVALUATION
</SMALL>

<UL=COMPACT type="square">
<SMALL>
<LI><A HREF="/document/certif.html">Critères d'évaluation</A>
<LI><A HREF="/document/certif.html">Schéma de certification</A>
<LI><A HREF="/document/docs/GARDE/garde.html">Guides GARDE</A>
<LI><A HREF="/document/certif.html">Certificats et PP</A>
</SMALL>
</UL>

<SMALL>REGLEMENTATION</SMALL>
<UL=COMPACT type="square">
<SMALL>
<LI><A HREF="/document/chiffre.html">Cryptologie</A>
<LI><A HREF="/document/tempest.html">Domaine tempest</A>
<LI><A HREF="/document/ssi.html">Systèmes d'information</A>
</SMALL>
</UL>

<SMALL>
<A HREF="/document/methodes.html">METHODES</A><BR><BR>
<A HREF="/document/fiches/index.html">FICHES DE SYNTHESE</A>
</SMALL>

</TD></TR></TABLE>
<HR>

<TABLE WIDTH=161>
<TR><TD BGCOLOR="#ffffff" WIDTH=161 ALIGN="center"><B>AILLEURS SUR LE SITE</B></TD></TR>
<TR><TD ALIGN="left"><UL=COMPACT type="square"><SMALL>
<LI><A HREF="/index.html">Retour à la page d'accueil</A>
<LI><A HREF="/present/index.html">Présentation du SCSSI</A>
<LI><A HREF="/pratiq/index.html">Informations pratiques</A>
<LI><A HREF="/rubriq/index.html">Rubriques</A>
<LI><A HREF="/courrier.html">Courrier des lecteurs</A>
</SMALL></TD></TR></TABLE>

<BR>
</TD>
<!                    >
<!                    >
<!                    >

<TD WIDTH=31></TD>
<TD WIDTH=100% VALIGN=TOP>
<TABLE WIDTH=100%><TR>
<TD BGCOLOR="#FF9933" VALIGN=MIDDLE>
<BR>
<H2><CENTER>SCSSI : ITSEC v1.2 Champ d'application</H2>
<A HREF="/document/criteres.html">Index de la documentation sur les critères</A> | 
<A HREF="/document/index.html">Index général de la documentation</A>
<BR>
<A HREF="/document/docs/ITSEC/itsec.html">Sommaire</A> |
<A HREF="/document/docs/ITSEC/itsec-0.html">Introduction</A> |
<A HREF="/document/docs/ITSEC/itsec-1.html">Champ d'application</A> |
<A HREF="/document/docs/ITSEC/itsec-2.html">Fonctionnalité</A> 
<A HREF="/document/docs/ITSEC/itsec-3.html">Efficacité</A> |
<A HREF="/document/docs/ITSEC/itsec-4.html">Conformité</A> |
<A HREF="/document/docs/ITSEC/itsec-E1.html">Conformité E1</A> |
<A HREF="/document/docs/ITSEC/itsec-E2.html">Conformité E2</A> |
<A HREF="/document/docs/ITSEC/itsec-E3.html">Conformité E3</A> |
<A HREF="/document/docs/ITSEC/itsec-E4.html">Conformité E4</A> |
<A HREF="/document/docs/ITSEC/itsec-E5.html">Conformité E5</A> |
<A HREF="/document/docs/ITSEC/itsec-E6.html">Conformité E6</A>
<A HREF="/document/docs/ITSEC/itsec-5.html">Résultats de l'évaluation</A> |
<A HREF="/document/docs/ITSEC/itsec-6.html">Glossaire</A> |
<A HREF="/document/docs/ITSEC/itsec-A.html">Exemples de classes de Fonctionnalité</A> |
<A HREF="/document/docs/ITSEC/itsec-B.html">"Claims language"</A> |

<BR><BR>
<a href="itsec.html"><img alt="[Début]" border=0 src="/images/top.gif"></a> <a href="itsec-0.html"><img alt="[Précédente]" border=0 src="/images/prev.gif"></a> <a href="itsec-2.html"><img alt="[Suivante]" border=0 src="/images/next.gif"></a> <a href="itsec-B.html"><img alt="[Fin]" border=0 src="/images/bottom.gif"></a>
<BR><BR>
</TD></TR></TABLE>
<a name="795">
<center><h3> CHAMP D'APPLICATION</h3></center>
</a><a name="691">
<h4> Mesures techniques de s&eacute;curit&eacute;</h4>
</a>La s&eacute;curit&eacute; d'un syst&egrave;me TI peut souvent &ecirc;tre assur&eacute;e en grande partie par des mesures non techniques, telles que des contr&ocirc;les de l'organisation, des contr&ocirc;les du personnel, des contr&ocirc;les physiques et des contr&ocirc;les administratifs. Toutefois, on constate une tendance et un besoin croissants &agrave; recourir &agrave; des mesures techniques de s&eacute;curit&eacute; des TI. Bien que les crit&egrave;res de s&eacute;curit&eacute; qui suivent portent surtout sur les mesures techniques de s&eacute;curit&eacute;, ils concernent cependant aussi quelques aspects non techniques, principalement les proc&eacute;dures d'exploitation s&ucirc;re qui leur sont associ&eacute;es pour la s&eacute;curit&eacute; li&eacute;e au personnel, la s&eacute;curit&eacute; physique et la s&eacute;curit&eacute; organisationnelle (mais seulement quand elles empi&egrave;tent sur les mesures techniques de s&eacute;curit&eacute;).<p>

Les pr&eacute;sents crit&egrave;res ont &eacute;t&eacute; con&ccedil;us pour &ecirc;tre dans leur plus grande partie &eacute;galement applicables aux mesures techniques de s&eacute;curit&eacute; impl&eacute;ment&eacute;es au moyen de mat&eacute;riel, de logiciel ou de microprogrammes. Lorsque des aspects particuliers de l'&eacute;valuation ne sont destin&eacute;s &agrave; s'appliquer qu'&agrave; certains modes de r&eacute;alisation, cela est indiqu&eacute; dans le texte des crit&egrave;res correspondants.<p>

Les pr&eacute;sents crit&egrave;res ne sont pas destin&eacute;s &agrave; couvrir les aspects physiques de la s&eacute;curit&eacute; mat&eacute;rielle tels que la fourniture d'enceintes r&eacute;sistant &agrave; l'intrusion ou le contr&ocirc;le des signaux parasites compromettants.<p>

<a name="695">
<h4> Syst&egrave;mes et Produits</h4>
</a>Dans le cadre du pr&eacute;sent document, la diff&eacute;rence entre syst&egrave;mes et produits peut s'expliquer comme suit. Un <I>syst&egrave;me</I> <I>TI</I> est une installation sp&eacute;cifique de TI ayant un objectif particulier et un environnement op&eacute;rationnel connu. Un <I>produit</I> <I>TI</I> est un mat&eacute;riel informatique, un progiciel ou un ensemble des deux qui peut &ecirc;tre achet&eacute; sur &eacute;tag&egrave;re et int&eacute;gr&eacute; dans divers syst&egrave;mes. Un syst&egrave;me TI est g&eacute;n&eacute;ralement construit &agrave; partir d'un certain nombre de <strong>composants</strong> mat&eacute;riels et logiciels. Certains composants (par exemple un logiciel d'application) seront r&eacute;alis&eacute;s sp&eacute;cialement &#32;; d'autres composants (par exemple le mat&eacute;riel) seront g&eacute;n&eacute;ralement des produits standards. Pour certaines applications, il pourrait &ecirc;tre possible d'acqu&eacute;rir un seul produit pour servir de syst&egrave;me complet, mais habituellement il sera n&eacute;cessaire de r&eacute;aliser un minimum d'adaptation et d'int&eacute;gration pour satisfaire aux exigences sp&eacute;cifiques du syst&egrave;me.<p>

Du point de vue de la s&eacute;curit&eacute;, la principale diff&eacute;rence entre syst&egrave;mes et produits tient &agrave; ce qui est certain quant &agrave; leur environnement op&eacute;rationnel. Un syst&egrave;me est con&ccedil;u pour satisfaire les besoins d'un groupe particulier d'<strong>utilisateurs finals</strong>. Son environnement est r&eacute;el, il peut &ecirc;tre d&eacute;fini et observ&eacute; dans ses moindres d&eacute;tails &#32;; en particulier les caract&eacute;ristiques et les besoins de ses utilisateurs finals seront connus, et les menaces contre sa s&eacute;curit&eacute; sont des menaces r&eacute;elles, qui peuvent &ecirc;tre d&eacute;termin&eacute;es. Un produit doit &ecirc;tre apte &agrave; &ecirc;tre incorpor&eacute; dans un grand nombre de syst&egrave;mes &#32;; le concepteur du produit ne peut faire que des hypoth&egrave;ses g&eacute;n&eacute;rales sur l'environnement op&eacute;rationnel d'un syst&egrave;me dont ce produit pourrait devenir un composant. Il revient &agrave; celui qui ach&egrave;te le produit et construit le syst&egrave;me de s'assurer que ces hypoth&egrave;ses sont coh&eacute;rentes avec l'environnement v&eacute;ritable du syst&egrave;me.<p>

Il est important, pour des raisons de coh&eacute;rence, d'utiliser les m&ecirc;mes crit&egrave;res de s&eacute;curit&eacute; pour les produits et les syst&egrave;mes &#32;: il sera ainsi plus facile et moins co&ucirc;teux d'&eacute;valuer les syst&egrave;mes qui contiennent des produits d&eacute;j&agrave; &eacute;valu&eacute;s avec succ&egrave;s. C'est pourquoi les pr&eacute;sents crit&egrave;res traitent de l'&eacute;valuation de la s&eacute;curit&eacute; &agrave; la fois pour les produits et les syst&egrave;mes TI. Dans le reste de ce document, l'expression cible d'&eacute;valuation ou TOE (Target Of Evaluation) est utilis&eacute;e pour d&eacute;signer un produit ou un syst&egrave;me &agrave; &eacute;valuer.<p>

Une TOE peut &ecirc;tre construite &agrave; partir de plusieurs composants. Certains composants ne contribueront pas &agrave; satisfaire aux <strong>objectifs de s&eacute;curit&eacute;</strong> de la TOE. D'autres contribueront &agrave; satisfaire aux objectifs de s&eacute;curit&eacute; &#32;; ces derniers composants sont appel&eacute;s d&eacute;di&eacute;s &agrave; la s&eacute;curit&eacute;. Enfin il peut y avoir des composants qui ne sont pas d&eacute;di&eacute;s &agrave; la s&eacute;curit&eacute; mais qui doivent cependant fonctionner correctement pour que la TOE puisse faire respecter la s&eacute;curit&eacute; &#32;; ils sont appel&eacute;s <strong>touchant &agrave; la s&eacute;curit&eacute;</strong>. La combinaison de composants d&eacute;di&eacute;s &agrave; la s&eacute;curit&eacute; et de composants touchant &agrave; la s&eacute;curit&eacute; &agrave; l'int&eacute;rieur d'une TOE est souvent appel&eacute;e base informatique de confiance ou TCB (Trusted Computing Base) (voir les figures 1 et 2).<p>

La plus grande partie du travail d'&eacute;valuation sera concentr&eacute;e sur les composants d'une TOE dont il est &eacute;tabli qu'ils sont d&eacute;di&eacute;s &agrave; la s&eacute;curit&eacute; ou touchant &agrave; la s&eacute;curit&eacute;, mais tous les autres devront &ecirc;tre examin&eacute;s au cours de l'&eacute;valuation et il devra &ecirc;tre d&eacute;montr&eacute; qu'ils ne sont ni d&eacute;di&eacute;s &agrave; la s&eacute;curit&eacute; ni touchant &agrave; la s&eacute;curit&eacute;.<p>

<a name="701">
<h4> Fonctionnalit&eacute; et Assurance, Classes et Niveaux</h4>
</a>Pour qu'une TOE atteigne ses objectifs de s&eacute;curit&eacute;, elle doit comporter des fonctions d&eacute;di&eacute;es &agrave; la s&eacute;curit&eacute; appropri&eacute;es couvrant par exemple des domaines tels que le contr&ocirc;le d'acc&egrave;s, l'audit et la reprise sur incident.<p>

Ces fonctions doivent &ecirc;tre d&eacute;finies d'une fa&ccedil;on claire et compr&eacute;hensible tant pour le commanditaire de l'&eacute;valuation que pour l'&eacute;valuateur ind&eacute;pendant. Elles peuvent &ecirc;tre soit sp&eacute;cifi&eacute;es individuellement, soit d&eacute;finies par r&eacute;f&eacute;rence &agrave; une <strong>classe de fonctionnalit&eacute;</strong> pr&eacute;d&eacute;finie. Dix exemples de classes de fonctionnalit&eacute; sont inclus dans les pr&eacute;sents crit&egrave;res. Ces exemples de classes sont bas&eacute;s sur les classes d&eacute;finies dans les crit&egrave;res nationaux allemands [ZSIEC], parmi lesquelles cinq classes sont en &eacute;troite correspondance avec les exigences fonctionnelles du document am&eacute;ricain Trusted Computer System Evaluation Criteria [TCSEC].<p>

Dans tous les cas, le commanditaire d'une &eacute;valuation doit d&eacute;finir la cible de s&eacute;curit&eacute; pour l'&eacute;valuation. Cette cible doit d&eacute;finir les fonctions d&eacute;di&eacute;es &agrave; la s&eacute;curit&eacute; qui doivent &ecirc;tre fournies par la TOE et contiendra &eacute;galement d'autres informations pertinentes, telles que les objectifs de s&eacute;curit&eacute; de la TOE et les <strong>menaces</strong> envisag&eacute;es &agrave; l'encontre de ces objectifs. Les d&eacute;tails des <strong>m&eacute;canismes de s&eacute;curit&eacute;</strong> particuliers qui seront utilis&eacute;s pour impl&eacute;menter les fonctions d&eacute;di&eacute;es &agrave; la s&eacute;curit&eacute; peuvent &eacute;galement &ecirc;tre donn&eacute;s.<p>

Les fonctions d&eacute;di&eacute;es &agrave; la s&eacute;curit&eacute; choisies pour atteindre les objectifs de s&eacute;curit&eacute; d'une TOE ne constituent qu'un des aspects de la cible de s&eacute;curit&eacute; d'un produit ou d'un syst&egrave;me. L'assurance que les objectifs de s&eacute;curit&eacute; sont atteints par les fonctions et les m&eacute;canismes d&eacute;di&eacute;s &agrave; la s&eacute;curit&eacute; choisis est tout aussi importante.<p>

L'assurance doit &ecirc;tre abord&eacute;e de diff&eacute;rents points de vue et, pour les pr&eacute;sents crit&egrave;res harmonis&eacute;s, il a &eacute;t&eacute; d&eacute;cid&eacute; de distinguer la confiance dans la conformit&eacute; de la r&eacute;alisation des fonctions et m&eacute;canismes d&eacute;di&eacute;s &agrave; la s&eacute;curit&eacute;, de la confiance dans leur efficacit&eacute;.<p>

L'&eacute;valuation de l'efficacit&eacute; consiste &agrave; estimer si les fonctions et les m&eacute;canismes d&eacute;di&eacute;s &agrave; la s&eacute;curit&eacute; fournis dans la TOE satisfont effectivement aux objectifs de s&eacute;curit&eacute; d&eacute;clar&eacute;s. L'estimation porte sur la pertinence de la fonctionnalit&eacute;, la coh&eacute;sion de la fonctionnalit&eacute; (si les fonctions choisies op&egrave;rent ensemble en synergie), les cons&eacute;quences de vuln&eacute;rabilit&eacute;s connues et d&eacute;couvertes (tant au point de vue de la construction de la TOE que de la mani&egrave;re dont elle sera utilis&eacute;e en exploitation r&eacute;elle) et la facilit&eacute; d'emploi.<p>

En outre, l'&eacute;valuation de l'efficacit&eacute; consiste &agrave; estimer la capacit&eacute; des m&eacute;canismes de s&eacute;curit&eacute; de la TOE &agrave; r&eacute;sister &agrave; une attaque directe (r&eacute;sistance des m&eacute;canismes). Trois niveaux de r&eacute;sistance sont d&eacute;finis - &eacute;l&eacute;mentaire, moyen et &eacute;lev&eacute; - repr&eacute;sentant des degr&eacute;s de confiance croissants dans la capacit&eacute; des m&eacute;canismes de s&eacute;curit&eacute; de la TOE &agrave; r&eacute;sister &agrave; une attaque directe.<p>

L'&eacute;valuation de la conformit&eacute; consiste &agrave; estimer si les fonctions et les m&eacute;canismes d&eacute;di&eacute;s &agrave; la s&eacute;curit&eacute; sont impl&eacute;ment&eacute;s correctement. Il a &eacute;t&eacute; d&eacute;fini sept niveaux d'&eacute;valuation num&eacute;rot&eacute;s de E0 &agrave; E6, repr&eacute;sentant des degr&eacute;s croissants de confiance dans la conformit&eacute;. E0 correspond &agrave; une confiance insuffisante. E1 correspond au point d'entr&eacute;e au-dessous duquel il ne peut &ecirc;tre accord&eacute; aucune confiance utile, et E6 correspond au degr&eacute; de confiance le plus &eacute;lev&eacute; &#32;: les autres niveaux correspondent &agrave; des degr&eacute;s de confiance interm&eacute;diaires. La conformit&eacute; est consid&eacute;r&eacute;e du point de vue de la construction de la TOE, ce qui recouvre &agrave; la fois le processus de d&eacute;veloppement et l'environnement de d&eacute;veloppement, et aussi du point de vue de l'exploitation de la TOE.<p>

Les niveaux d'&eacute;valuation sont d&eacute;finis dans le contexte des crit&egrave;res de conformit&eacute;. Les exigences concernant l'efficacit&eacute; (incluant la r&eacute;sistance des m&eacute;canismes) ne changent pas selon les niveaux mais s'appuient plut&ocirc;t sur l'estimation de la conformit&eacute; et sont examin&eacute;es sur la base des documents fournis par le commanditaire pour cette estimation &#32;; naturellement, dans la pratique, les t&acirc;ches d'estimation de la conformit&eacute; et de l'efficacit&eacute; seront imbriqu&eacute;es.<p>

Si une TOE ne parvient pas &agrave; satisfaire &agrave; l'un quelconque des aspects de l'&eacute;valuation &agrave; un niveau donn&eacute;, par manque d'information ou pour toute autre raison, l'imperfection doit &ecirc;tre corrig&eacute;e, ou la TOE doit &ecirc;tre retir&eacute;e de l'&eacute;valuation pour ce niveau. Sinon il lui sera attribu&eacute; le niveau E0.<p>

La r&eacute;ussite de l'&eacute;valuation &agrave; l'un des six niveaux E1 &agrave; E6 couvre un large &eacute;ventail de confiance possible. L'ensemble de ces six niveaux ne sera pas forc&eacute;ment n&eacute;cessaire ni appropri&eacute; pour tous les secteurs du march&eacute; qui ont besoin d'une &eacute;valuation ind&eacute;pendante des mesures techniques de s&eacute;curit&eacute;. Toutes les combinaisons de fonctionnalit&eacute; et de confiance ne seront pas n&eacute;cessairement judicieuses ou utiles. Par exemple, un bas degr&eacute; de confiance dans la fonctionnalit&eacute; requise pour satisfaire &agrave; une exigence de s&eacute;curit&eacute; multi-niveau militaire ne sera normalement pas appropri&eacute;. De plus, il est peu probable qu'un haut degr&eacute; de confiance dans la conformit&eacute; d'une TOE soit associ&eacute; &agrave; l'exigence d'un bas niveau de r&eacute;sistance des m&eacute;canismes.<p>

Les pr&eacute;sents crit&egrave;res harmonis&eacute;s ne constituent pas un guide de conception pour r&eacute;aliser des produits ou des syst&egrave;mes s&ucirc;rs. Il appartient au commanditaire d'une &eacute;valuation de fixer les objectifs de s&eacute;curit&eacute; de sa TOE et de choisir les fonctions de s&eacute;curit&eacute; propres &agrave; atteindre ces objectifs. Toutefois, pour chaque niveau d'&eacute;valuation, la partie "assurance" des crit&egrave;res peut &ecirc;tre vue comme une "liste de contr&ocirc;les de s&eacute;curit&eacute;" obligatoire auxquels il faut satisfaire.<p>

<a name="714">
<h4> Profils d'Assurance</h4>
</a>Les crit&egrave;res du pr&eacute;sent document exigent du commanditaire de d&eacute;clarer le niveau d'&eacute;valuation dans la cible de s&eacute;curit&eacute;. Toutes les fonctions d&eacute;di&eacute;es &agrave; la s&eacute;curit&eacute; &eacute;num&eacute;r&eacute;es dans la cible de s&eacute;curit&eacute; sont alors estim&eacute;es pour le m&ecirc;me degr&eacute; de confiance, comme exig&eacute; par le niveau d'&eacute;valuation d&eacute;clar&eacute;.<p>

Pour certaines TOE, il peut &ecirc;tre exig&eacute; d'atteindre un degr&eacute; de confiance sup&eacute;rieur pour certaines fonctions de s&eacute;curit&eacute; et inf&eacute;rieur pour d'autres &#32;; par exemple, certaines fonctions de s&eacute;curit&eacute; peuvent &ecirc;tre plus importantes que d'autres. Dans ces circonstances, le commanditaire peut envisager de produire plus d'une cible de s&eacute;curit&eacute; pour la TOE. Les d&eacute;tails sur la fa&ccedil;on dont ceci est effectu&eacute;, et dans quelles conditions, sont hors du champ d'application des pr&eacute;sents crit&egrave;res.<p>

<a name="717">
<h4> Le processus d'&eacute;valuation</h4>
</a>L'objectif du processus d'&eacute;valuation est de permettre &agrave; l'&eacute;valuateur de pr&eacute;parer un rapport impartial indiquant si oui ou non une TOE satisfait &agrave; sa cible de s&eacute;curit&eacute; avec le degr&eacute; de confiance pr&eacute;cis&eacute; par le niveau d'&eacute;valuation d&eacute;clar&eacute;.<p>

Le processus d'&eacute;valuation est repr&eacute;sent&eacute; dans son contexte en figure 3. Il exige que le commanditaire de l'&eacute;valuation y soit fortement impliqu&eacute;. Plus le niveau d'&eacute;valuation est &eacute;lev&eacute;, plus l'implication du commanditaire devra &ecirc;tre importante. Les utilisateurs aussi bien que les fournisseurs peuvent agir en tant que commanditaires d'une &eacute;valuation. Il est vraisemblable que l'&eacute;valuation d'un syst&egrave;me sera commandit&eacute;e par les utilisateurs finals ou leurs repr&eacute;sentants techniques, et que l'&eacute;valuation d'un produit sera commandit&eacute;e par le fabricant ou le fournisseur, mais cela n'est pas obligatoire. Tous les int&eacute;ress&eacute;s qui peuvent fournir l'information technique n&eacute;cessaire peuvent &ecirc;tre commanditaires d'une &eacute;valuation.<p>

En premier lieu, le commanditaire doit d&eacute;terminer les exigences op&eacute;rationnelles et les menaces auxquelles la TOE doit faire face. Dans le cas d'un syst&egrave;me, il est n&eacute;cessaire d'examiner son environnement op&eacute;rationnel r&eacute;el afin de d&eacute;terminer les menaces qui doivent effectivement &ecirc;tre prises en compte. Pour un produit, il faut d&eacute;cider quelles menaces contre la s&eacute;curit&eacute; celui-ci devrait prendre en compte. On s'attend &agrave; ce que des groupements d'industriels et des organismes internationaux de normalisation d&eacute;finissent dans l'avenir des classes standards de fonctionnalit&eacute; pour servir de cibles de s&eacute;curit&eacute; de produits. Les d&eacute;veloppeurs de produits, qui n'ont pas d'id&eacute;e pr&eacute;cise sur des cr&eacute;neaux particuliers du march&eacute; ni sur des types d'utilisateurs, peuvent trouver que de telles classes de fonctionnalit&eacute; pr&eacute;-d&eacute;finies constituent de bonnes cibles de s&eacute;curit&eacute; pour concevoir des produits qui y correspondent.<p>

Les objectifs de s&eacute;curit&eacute; de la TOE peuvent alors &ecirc;tre d&eacute;termin&eacute;s en tenant compte des lois et des autres r&eacute;glementations. Ils constituent la contribution &agrave; la s&eacute;curit&eacute; (en termes de confidentialit&eacute;, d'int&eacute;grit&eacute; et de disponibilit&eacute;) que cette TOE est destin&eacute;e &agrave; fournir. Une fois ces objectifs fix&eacute;s, les fonctions d&eacute;di&eacute;es &agrave; la s&eacute;curit&eacute; qui sont n&eacute;cessaires peuvent &ecirc;tre &eacute;tablies, &eacute;ventuellement par it&eacute;ration, en m&ecirc;me temps que le niveau d'&eacute;valuation auquel la TOE devra satisfaire pour fournir le degr&eacute; de confiance n&eacute;cessaire.<p>

L'ensemble des r&eacute;sultats de ce travail - d&eacute;finition des fonctions d&eacute;di&eacute;es &agrave; la s&eacute;curit&eacute;, menaces identifi&eacute;es, objectifs de s&eacute;curit&eacute; identifi&eacute;s, m&eacute;canismes sp&eacute;cifiques de s&eacute;curit&eacute; &agrave; utiliser - devient la cible de s&eacute;curit&eacute; &agrave; prendre en compte pour le d&eacute;veloppement.<p>

Pour chaque niveau d'&eacute;valuation, les crit&egrave;res &eacute;num&egrave;rent les &eacute;l&eacute;ments que le commanditaire doit fournir &agrave; l'&eacute;valuateur. Le commanditaire doit s'assurer que ces &eacute;l&eacute;ments sont fournis, en veillant &agrave; ce que toutes les exigences sur le contenu et la pr&eacute;sentation soient satisfaites, et aussi que ces &eacute;l&eacute;ments apportent directement ou aident &agrave; &eacute;tablir les &eacute;l&eacute;ments de preuve demand&eacute;s.<p>

Pour que l'&eacute;valuation puisse &ecirc;tre conduite efficacement, et &agrave; un co&ucirc;t minimum, l'&eacute;valuateur doit travailler en liaison &eacute;troite avec le d&eacute;veloppeur et le commanditaire de la TOE, l'id&eacute;al &eacute;tant qu'il le fasse d&egrave;s le d&eacute;but de ce d&eacute;veloppement, de fa&ccedil;on &agrave; &eacute;tablir une bonne compr&eacute;hension de la cible de s&eacute;curit&eacute; et &agrave; pouvoir rep&eacute;rer ce que les d&eacute;cisions impliquent pour l'&eacute;valuation au fur et &agrave; mesure qu'elles sont prises. Toutefois, l'&eacute;valuateur doit rester ind&eacute;pendant et ne doit pas faire de suggestion quant &agrave; la conception et la r&eacute;alisation de la TOE. Son r&ocirc;le est analogue &agrave; celui d'un auditeur financier ext&eacute;rieur, qui doit de la m&ecirc;me fa&ccedil;on construire une bonne relation de travail avec un service financier, et qui, dans bien des cas, utilisera, apr&egrave;s examen, les rapports et les r&eacute;sultats des contr&ocirc;les internes. Et pourtant il doit lui aussi rester ind&eacute;pendant et poser des questions.<p>

Les exigences concernant les tests et les analyses de s&eacute;curit&eacute; dans les crit&egrave;res m&eacute;ritent une mention particuli&egrave;re &#32;; dans tous les cas, la responsabilit&eacute; des tests et des analyses &eacute;choit au commanditaire. Pour tous les niveaux d'&eacute;valuation sauf E1, l'&eacute;valuateur v&eacute;rifiera principalement les r&eacute;sultats des tests et des analyses fournis par le commanditaire. L'&eacute;valuateur n'effectuera lui-m&ecirc;me des tests et des analyses que pour v&eacute;rifier les r&eacute;sultats fournis, pour compl&eacute;ter les &eacute;l&eacute;ments de preuve fournis et pour se livrer &agrave; des investigations sur les vuln&eacute;rabilit&eacute;s. Au niveau E1, la fourniture des r&eacute;sultats des tests est facultative. Si ces r&eacute;sultats ne sont pas fournis, l'&eacute;valuateur doit en plus effectuer des tests fonctionnels par rapport &agrave; la cible de s&eacute;curit&eacute;.<p>

<a name="726">
<h4> Le processus de certification</h4>
</a>Pour que les pr&eacute;sents crit&egrave;res aient une valeur pratique, ils devront s'appuyer sur des organisations pratiques permettant d'assurer la mise en place et le contr&ocirc;le d'une &eacute;valuation ind&eacute;pendante, pilot&eacute;s par des organismes de certification convenablement qualifi&eacute;s et reconnus au plan national. Ces organismes d&eacute;livreront des certificats confirmant la cotation de la s&eacute;curit&eacute; des TOE, telle que d&eacute;termin&eacute;e par des &eacute;valuations ind&eacute;pendantes convenablement conduites. Comme il est exig&eacute; par les pr&eacute;sents crit&egrave;res, ils devront approuver les proc&eacute;dures propres &agrave; garantir l'authenticit&eacute; de la TOE livr&eacute;e. Ils seront &eacute;galement responsables du choix et du contr&ocirc;le des &eacute;valuateurs agr&eacute;&eacute;s. Le d&eacute;tail des proc&eacute;dures &agrave; suivre par de tels organismes est hors du champ d'application des pr&eacute;sents crit&egrave;res.<p>

Les pr&eacute;sents crit&egrave;res ont &eacute;t&eacute; con&ccedil;us pour minimiser la subjectivit&eacute; inh&eacute;rente aux r&eacute;sultats d'une &eacute;valuation. Les organismes nationaux de certification auront la responsabilit&eacute; de maintenir l'uniformit&eacute; des r&eacute;sultats d'&eacute;valuation certifi&eacute;s. La mani&egrave;re d'y parvenir est hors du champ d'application des pr&eacute;sents crit&egrave;res.<p>

Pour que les r&eacute;sultats d'une &eacute;valuation par rapport aux pr&eacute;sents crit&egrave;res puissent &ecirc;tre certifi&eacute;s par un organisme national de certification, l'&eacute;valuateur devra produire un rapport contenant les r&eacute;sultats de l'&eacute;valuation sous une forme qui convienne &agrave; son examen par l'organisme de certification. Le format et le contenu pr&eacute;cis de tels rapports sont hors du champ d'application des pr&eacute;sents crit&egrave;res.<p>

La plupart des cibles de s&eacute;curit&eacute; et des TOE vont &eacute;voluer avec le temps. Le maintien d'une cotation certifi&eacute;e &agrave; la suite de changements apport&eacute;s &agrave; la TOE (qu'ils concernent ou non la s&eacute;curit&eacute;) ou &agrave; la suite de changements apport&eacute;s &agrave; la cible de s&eacute;curit&eacute; (tels que l'apparition de nouvelles menaces ou de nouveaux objectifs de s&eacute;curit&eacute;) sera r&eacute;glement&eacute; par l'organisme national de certification appropri&eacute;. Une r&eacute;&eacute;valuation sera n&eacute;cessaire dans certains cas et pas dans d'autres. Les d&eacute;tails de telles r&eacute;glementations et proc&eacute;dures sont &eacute;galement hors du champ d'application des pr&eacute;sents crit&egrave;res.<p>

<a name="731">
<h4> Correspondance avec le document TCSEC</h4>
</a>Le document Trusted Computer System Evaluation Criteria [TCSEC], commun&eacute;ment appel&eacute; TCSEC ou "Livre orange", constitue une base largement reconnue et accept&eacute;e pour l'&eacute;valuation de la s&eacute;curit&eacute; des syst&egrave;mes d'exploitation. Publi&eacute; initialement en 1983, il est utilis&eacute; par le d&eacute;partement de la d&eacute;fense des Etats-Unis dans l'organisation am&eacute;ricaine d'&eacute;valuation des produits mise en oeuvre par le NCSC (National Computer Security Center). Les crit&egrave;res du TCSEC sont destin&eacute;s &agrave; satisfaire &agrave; la politique de s&eacute;curit&eacute; du d&eacute;partement de la d&eacute;fense des Etats-Unis. Cette politique s'int&eacute;resse principalement au maintien de la confidentialit&eacute; des informations classifi&eacute;es au niveau national.<p>

Le TCSEC d&eacute;finit sept ensembles de crit&egrave;res d'&eacute;valuation appel&eacute;s classes (D, C1, C2, B1, B2, B3 et A1) regroup&eacute;s en quatre divisions (D, C, B et A). Chaque classe de crit&egrave;res couvre quatre aspects de l'&eacute;valuation &#32;: la politique de s&eacute;curit&eacute;, l'imputabilit&eacute;, l'assurance et la documentation. Les crit&egrave;res relatifs &agrave; ces quatre domaines deviennent de plus en plus d&eacute;taill&eacute;s d'une classe &agrave; l'autre et forment une hi&eacute;rarchie dans laquelle D est le niveau le plus bas et A1 le plus haut. Chaque classe couvre &agrave; la fois les exigences de fonctionnalit&eacute; et les exigences de confiance.<p>

Les crit&egrave;res expos&eacute;s dans l'ITSEC permettent de s&eacute;lectionner des fonctions de s&eacute;curit&eacute; arbitraires et d&eacute;finissent sept niveaux d'&eacute;valuation repr&eacute;sentant une confiance croissante dans la capacit&eacute; d'une TOE &agrave; atteindre sa cible de s&eacute;curit&eacute;. Ainsi ces crit&egrave;res peuvent-ils &ecirc;tre appliqu&eacute;s sur une gamme de syst&egrave;mes et de produits possibles plus large que celle couverte par le TCSEC. D'une mani&egrave;re g&eacute;n&eacute;rale, pour une fonctionnalit&eacute; identique et &agrave; un degr&eacute; de confiance &eacute;quivalent, une TOE a plus de libert&eacute; sur le plan de l'architecture pour satisfaire aux crit&egrave;res de l'ITSEC qu'&agrave; ceux du TCSEC, mais supporte plus de contraintes sur les modes de d&eacute;veloppement autoris&eacute;s.<p>

Plusieurs exemples de classes de fonctionnalit&eacute; ont &eacute;t&eacute; d&eacute;finis pour correspondre &eacute;troitement aux exigences de fonctionnalit&eacute; des classes C1 &agrave; A1 du TCSEC. Ce sont les classes F-C1 &agrave; F-B3, parmi les exemples de classes de fonctionnalit&eacute; donn&eacute;s en annexe A. Il n'est toutefois pas possible de relier directement les niveaux d'&eacute;valuation aux exigences de confidentialit&eacute; des classes du TCSEC, car les niveaux de l'ITSEC sont issus de l'harmonisation des divers ensembles europ&eacute;ens de crit&egrave;res de s&eacute;curit&eacute; des TI, qui contiennent un certain nombre d'exigences qui n'apparaissent pas explicitement dans le TCSEC.<p>

La correspondance recherch&eacute;e entre les pr&eacute;sents crit&egrave;res et les classes du TCSEC est la suivante &#32;:<p>

<pre><a name="737">
	Classe ITSEC		Classe TCSEC<br>	E0	&lt;---&gt;	D<br>	F-C1, E1	&lt;---&gt;	C1<br>	F-C2, E2	&lt;---&gt;	C2<br>	F-B1, E3	&lt;---&gt;	B1<br>	F-B2, E4	&lt;---&gt;	B2<br>	F-B3, E5	&lt;---&gt;	B3<br>	F-B3, E6	&lt;---&gt;	A1
</a>
</pre><p>

Il est &agrave; noter qu'il n'y a pas de classe de fonctionnalit&eacute; F-A1, puisque les exigences de fonctionnalit&eacute; de la classe A1 du TCSEC sont les m&ecirc;mes que celles de la classe B3. Un produit con&ccedil;u pour &ecirc;tre &eacute;valu&eacute; avec succ&egrave;s aussi bien par rapport &agrave; l'ITSEC qu'au TCSEC, et dont il a &eacute;t&eacute; montr&eacute; qu'il satisfaisait &agrave; l'une des classes ou des combinaisons du tableau ci-dessus, devrait r&eacute;ussir l'&eacute;valuation par rapport aux autres crit&egrave;res pour la classe ou pour la combinaison correspondante. Toutefois, au niveau C1, le TCSEC exige la production d'&eacute;l&eacute;ments de preuve concernant les tests effectu&eacute;s par le d&eacute;veloppeur. Ainsi une &eacute;valuation [F-C1, E1] ne serait &eacute;quivalente &agrave; une &eacute;valuation C1 que si le commanditaire avait choisi l'exigence optionnelle du niveau E1 de fourniture de la documentation relative aux tests, comme preuve que des tests ad&eacute;quats par rapport &agrave; la cible de s&eacute;curit&eacute; ont &eacute;t&eacute; effectu&eacute;s avant l'&eacute;valuation.<p>

Tout au long du TCSEC la combinaison du sous-ensemble d&eacute;di&eacute; &agrave; la s&eacute;curit&eacute; et du sous-ensemble touchant &agrave; la s&eacute;curit&eacute; est appel&eacute;e <I>base informatique de confiance</I> ou TCB (Trusted Computing Base). Pour le TCSEC, les TOE des classes les plus hautes de la division B et de la division A tirent une confiance suppl&eacute;mentaire d'exigences croissantes de rigueur dans l'architecture et la conception de la TCB impos&eacute;es par les crit&egrave;res du TCSEC. Les classes de niveau B2 et au dessus exigent que le contr&ocirc;le d'acc&egrave;s soit r&eacute;alis&eacute; par un m&eacute;canisme de validation de r&eacute;f&eacute;rence, m&eacute;canisme qui impl&eacute;mente le concept de moniteur de r&eacute;f&eacute;rence [AND]. Un tel m&eacute;canisme de validation de r&eacute;f&eacute;rence doit &ecirc;tre r&eacute;sistant &agrave; l'intrusion, il doit &ecirc;tre syst&eacute;matiquement mis en oeuvre, et il doit &ecirc;tre assez petit pour pouvoir &ecirc;tre soumis &agrave; des analyses et &agrave; des tests dont la compl&eacute;tude puisse &ecirc;tre assur&eacute;e.<p>

Pour &ecirc;tre compatibles avec le TCSEC, les exemples de classes de fonctionnalit&eacute; F-B2 et F-B3 de l'ITSEC imposent que le contr&ocirc;le d'acc&egrave;s soit impl&eacute;ment&eacute; avec un tel m&eacute;canisme. De plus, pour les niveaux sup&eacute;rieurs d'&eacute;valuation, l'ITSEC impose des contraintes d'architecture et de conception sur la r&eacute;alisation de toutes les fonctions d&eacute;di&eacute;es &agrave; la s&eacute;curit&eacute;. Tout ceci, combin&eacute; avec les exigences d'efficacit&eacute; de l'ITSEC relatives au fait que la fonctionnalit&eacute; de s&eacute;curit&eacute; est pertinente et que ses &eacute;l&eacute;ments se soutiennent mutuellement, signifie qu'une TOE capable de satisfaire aux niveaux sup&eacute;rieurs d'&eacute;valuation de l'ITSEC, et fournissant une fonctionnalit&eacute; &eacute;gale aux fonctionnalit&eacute;s des classes &eacute;quivalentes du TCSEC, doit n&eacute;cessairement satisfaire aux exigences du TCSEC quant &agrave; l'existence d'une TCB et utiliser le concept de moniteur de r&eacute;f&eacute;rence.<p>

<p>

<p>
<img src="itsec.1.anc.gif">-
<p>
Syst&egrave;me TI<br><br><br><br><br><br><img src="itsec.1.anc1.gif"><br>
<p>
Produit TI
<p>
<img src="itsec.1.anc2.gif">-
<p>
Processus de d&eacute;veloppement et d'&eacute;valuation

<TABLE BGCOLOR="#FF9933"><TR><TD WIDTH=100%>
<CENTER>
<BR><A HREF="/document/criteres.html">Index de la documentation sur les critères</A> | 
<A HREF="/document/index.html">Index général de la documentation</A>
<BR>
<A HREF="/document/docs/ITSEC/itsec.html">Sommaire</A> |
<A HREF="/document/docs/ITSEC/itsec-0.html">Introduction</A> |
<A HREF="/document/docs/ITSEC/itsec-1.html">Champ d'application</A> |
<A HREF="/document/docs/ITSEC/itsec-2.html">Fonctionnalité</A> 
<A HREF="/document/docs/ITSEC/itsec-3.html">Efficacité</A> |
<A HREF="/document/docs/ITSEC/itsec-4.html">Conformité</A> |
<A HREF="/document/docs/ITSEC/itsec-E1.html">Conformité E1</A> |
<A HREF="/document/docs/ITSEC/itsec-E2.html">Conformité E2</A> |
<A HREF="/document/docs/ITSEC/itsec-E3.html">Conformité E3</A> |
<A HREF="/document/docs/ITSEC/itsec-E4.html">Conformité E4</A> |
<A HREF="/document/docs/ITSEC/itsec-E5.html">Conformité E5</A> |
<A HREF="/document/docs/ITSEC/itsec-E6.html">Conformité E6</A>
<A HREF="/document/docs/ITSEC/itsec-5.html">Résultats de l'évaluation</A> |
<A HREF="/document/docs/ITSEC/itsec-6.html">Glossaire</A> |
<A HREF="/document/docs/ITSEC/itsec-A.html">Exemples de classes de Fonctionnalité</A> |
<A HREF="/document/docs/ITSEC/itsec-B.html">"Claims language"</A> |

<BR><BR><a href="itsec.html"><img alt="[Début]" border=0 src="/images/top.gif"></a> <a href="itsec-0.html"><img alt="[Précédente]" border=0 src="/images/prev.gif"></a> <a href="itsec-2.html"><img alt="[Suivante]" border=0 src="/images/next.gif"></a> <a href="itsec-B.html"><img alt="[Fin]" border=0 src="/images/bottom.gif"></a>
<BR><BR>
</TD></TR></TABLE>
</TD></TR></TABLE>
<HR>

<SMALL><A HREF="/courrier.html">
webmaster@scssi.gouv.fr</A>

- Copyright &copy 1999 Service Central de la Sécurité des Systèmes d'Information
<BR>Dernière mise à jour le 17/06/99 à 17:03:23
</SMALL>
</body>
</html>
