<html><head><title>SCSSI : SCSSI : ITSEC v1.2 Assurance conformit&eacute; niveau E2</title></head>
<body bgcolor=#ffffff>

<TABLE >
<TR><TD WIDTH=161><A HREF="/index.html"><IMG SRC="/images/sigle2.gif" ALT="Retour Page de Garde" ALIGN="TOP" BORDER="0"></A>
</TD><TD WIDTH=100%><CENTER>PREMIER MINISTRE</CENTER>
<P>
<CENTER><B><FONT SIZE=5>Service Central</FONT></B> <B><FONT SIZE=5>de la S&eacute;curit&eacute; des Syst&egrave;mes d'Information</FONT></B></CENTER>
</TD>
</TR>

</TABLE><HR>
<!                      >
<!                      >
<!                      >

<TABLE>
<TR><TD BGCOLOR="#96c7f8" WIDTH=161 VALIGN="TOP">
<BR>
<TABLE WIDTH=161>
<TR><TD BGCOLOR="#ffffff" WIDTH=161 ALIGN="center"><B>DOCUMENTATION</B></TD></TR>
<TR><TD ALIGN="left"><SMALL>
<A HREF="/document/index.html">Index</A> de la documentation<BR><BR>
EVALUATION
</SMALL>

<UL=COMPACT type="square">
<SMALL>
<LI><A HREF="/document/certif.html">Critères d'évaluation</A>
<LI><A HREF="/document/certif.html">Schéma de certification</A>
<LI><A HREF="/document/docs/GARDE/garde.html">Guides GARDE</A>
<LI><A HREF="/document/certif.html">Certificats et PP</A>
</SMALL>
</UL>

<SMALL>REGLEMENTATION</SMALL>
<UL=COMPACT type="square">
<SMALL>
<LI><A HREF="/document/chiffre.html">Cryptologie</A>
<LI><A HREF="/document/tempest.html">Domaine tempest</A>
<LI><A HREF="/document/ssi.html">Systèmes d'information</A>
</SMALL>
</UL>

<SMALL>
<A HREF="/document/methodes.html">METHODES</A><BR><BR>
<A HREF="/document/fiches/index.html">FICHES DE SYNTHESE</A>
</SMALL>

</TD></TR></TABLE>
<HR>

<TABLE WIDTH=161>
<TR><TD BGCOLOR="#ffffff" WIDTH=161 ALIGN="center"><B>AILLEURS SUR LE SITE</B></TD></TR>
<TR><TD ALIGN="left"><UL=COMPACT type="square"><SMALL>
<LI><A HREF="/index.html">Retour à la page d'accueil</A>
<LI><A HREF="/present/index.html">Présentation du SCSSI</A>
<LI><A HREF="/pratiq/index.html">Informations pratiques</A>
<LI><A HREF="/rubriq/index.html">Rubriques</A>
<LI><A HREF="/courrier.html">Courrier des lecteurs</A>
</SMALL></TD></TR></TABLE>

<BR>
</TD>
<!                    >
<!                    >
<!                    >

<TD WIDTH=31></TD>
<TD WIDTH=100% VALIGN=TOP>
<TABLE WIDTH=100%><TR>
<TD BGCOLOR="#FF9933" VALIGN=MIDDLE>
<BR>
<H2><CENTER>SCSSI : ITSEC v1.2 Assurance conformit&eacute; niveau E2</H2>
<A HREF="/document/criteres.html">Index de la documentation sur les critères</A> | 
<A HREF="/document/index.html">Index général de la documentation</A>
<BR>
<A HREF="/document/docs/ITSEC/itsec.html">Sommaire</A> |
<A HREF="/document/docs/ITSEC/itsec-0.html">Introduction</A> |
<A HREF="/document/docs/ITSEC/itsec-1.html">Champ d'application</A> |
<A HREF="/document/docs/ITSEC/itsec-2.html">Fonctionnalité</A> 
<A HREF="/document/docs/ITSEC/itsec-3.html">Efficacité</A> |
<A HREF="/document/docs/ITSEC/itsec-4.html">Conformité</A> |
<A HREF="/document/docs/ITSEC/itsec-E1.html">Conformité E1</A> |
<A HREF="/document/docs/ITSEC/itsec-E2.html">Conformité E2</A> |
<A HREF="/document/docs/ITSEC/itsec-E3.html">Conformité E3</A> |
<A HREF="/document/docs/ITSEC/itsec-E4.html">Conformité E4</A> |
<A HREF="/document/docs/ITSEC/itsec-E5.html">Conformité E5</A> |
<A HREF="/document/docs/ITSEC/itsec-E6.html">Conformité E6</A>
<A HREF="/document/docs/ITSEC/itsec-5.html">Résultats de l'évaluation</A> |
<A HREF="/document/docs/ITSEC/itsec-6.html">Glossaire</A> |
<A HREF="/document/docs/ITSEC/itsec-A.html">Exemples de classes de Fonctionnalité</A> |
<A HREF="/document/docs/ITSEC/itsec-B.html">"Claims language"</A> |

<BR><BR>
<a href="itsec.html"><img alt="[Début]" border=0 src="/images/top.gif"></a> <a href="itsec-E1.html"><img alt="[Précédente]" border=0 src="/images/prev.gif"></a> <a href="itsec-E3.html"><img alt="[Suivante]" border=0 src="/images/next.gif"></a> <a href="itsec-B.html"><img alt="[Fin]" border=0 src="/images/bottom.gif"></a>
<BR><BR>
</TD></TR></TABLE>
<a name="73706">
<center><h3> ASSURANCE CONFORMITE - NIVEAU E2</h3></center>
</a><a name="73538">
<h4> Construction - Le processus de d&eacute;veloppement</h4>
</a>Le commanditaire doit fournir la TOE ainsi que la documentation suivante &#32;:<p>

<ul>
<li>la cible de s&eacute;curit&eacute; pour la TOE,

<li>la description informelle de l'architecture de la TOE,

<li><strong>la description informelle de la conception d&eacute;taill&eacute;e,</strong>-

<li><strong>la documentation de test,</strong>-

<li><strong>la biblioth&egrave;que des programmes de test et les outils utilis&eacute;s pour tester la TOE.</strong>-
</ul><a name="73545">
<h4> Phase 1 - Sp&eacute;cification des besoins</h4>
</a>Exigences concernant le contenu et la pr&eacute;sentation<p>

La cible de s&eacute;curit&eacute; doit pr&eacute;senter les fonctions d&eacute;di&eacute;es &agrave; la s&eacute;curit&eacute; qui doivent &ecirc;tre fournies par la TOE. Dans le cas d'un syst&egrave;me, la cible de s&eacute;curit&eacute; doit comprendre en outre une politique de s&eacute;curit&eacute; syst&egrave;me ou SSP (System Security Policy) qui identifie les objectifs de s&eacute;curit&eacute; ainsi que les menaces qui p&egrave;sent sur le syst&egrave;me. Dans le cas d'un produit, la cible de s&eacute;curit&eacute; doit inclure un argumentaire qui identifie le mode d'utilisation du produit, l'environnement envisag&eacute; et les menaces suppos&eacute;es &agrave; l'int&eacute;rieur de cet environnement. Les fonctions d&eacute;di&eacute;es &agrave; la s&eacute;curit&eacute; dans le cadre de la cible de s&eacute;curit&eacute; doivent &ecirc;tre sp&eacute;cifi&eacute;es en utilisant un style informel tel que d&eacute;crit au chapitre 2.<p>

Exigences concernant les &eacute;l&eacute;ments de preuve<p>

Dans le cas d'un syst&egrave;me, la cible de s&eacute;curit&eacute; doit pr&eacute;senter comment la fonctionnalit&eacute; propos&eacute;e satisfait aux objectifs de s&eacute;curit&eacute; et est ad&eacute;quate pour contrer les menaces identifi&eacute;es. Dans le cas d'un produit, la cible de s&eacute;curit&eacute; doit pr&eacute;senter comment la fonctionnalit&eacute; est appropri&eacute;e pour ce type d'emploi et ad&eacute;quate pour contrer les menaces suppos&eacute;es.<p>

T&acirc;ches de l'&eacute;valuateur<p>

V&eacute;rifier que les informations fournies satisfont &agrave; toutes les exigences concernant le contenu, la pr&eacute;sentation et les &eacute;l&eacute;ments de preuve. V&eacute;rifier qu'il n'y a pas d'incoh&eacute;rence dans la cible de s&eacute;curit&eacute;.<p>

<a name="73552">
<h4> Phase 2 - Conception g&eacute;n&eacute;rale</h4>
</a>Exigences concernant le contenu et la pr&eacute;sentation<p>

La description de l'architecture doit pr&eacute;senter la structure g&eacute;n&eacute;rale de la TOE. Elle doit pr&eacute;senter les interfaces externes de la TOE. Elle doit pr&eacute;senter tous les mat&eacute;riels et les microprogrammes n&eacute;cessaires &agrave; la TOE avec une pr&eacute;sentation de la fonctionnalit&eacute; des m&eacute;canismes de protection r&eacute;alis&eacute;s dans ces mat&eacute;riels et ces microprogrammes. <strong>Elle doit pr&eacute;senter la s&eacute;paration de la TOE entre les fonctions d&eacute;di&eacute;es &agrave; la s&eacute;curit&eacute; et les autres composants.</strong><p>

Exigences concernant les &eacute;l&eacute;ments de preuve<p>

La description de l'architecture doit pr&eacute;senter la mani&egrave;re dont seront fournies les fonctions d&eacute;di&eacute;es &agrave; la s&eacute;curit&eacute; de la cible de s&eacute;curit&eacute;.<strong> Elle doit pr&eacute;senter comment la s&eacute;paration entre les fonctions d&eacute;di&eacute;es &agrave; la s&eacute;curit&eacute; et les autres composants est r&eacute;alis&eacute;e.</strong><p>

T&acirc;ches de l'&eacute;valuateur<p>

V&eacute;rifier que les informations fournies satisfont &agrave; toutes les exigences concernant le contenu, la pr&eacute;sentation et les &eacute;l&eacute;ments de preuve. <strong>V&eacute;rifier que la s&eacute;paration entre les fonctions d&eacute;di&eacute;es &agrave; la s&eacute;curit&eacute; et les autres composants est valide.</strong><p>

<a name="73559">
<h4> Phase 3 - Conception d&eacute;taill&eacute;e</h4>
</a>Exigences concernant le contenu et la pr&eacute;sentation<p>

<strong>La conception d&eacute;taill&eacute;e doit pr&eacute;senter la r&eacute;alisation de toutes les fonctions d&eacute;di&eacute;es &agrave; la s&eacute;curit&eacute; ou touchant &agrave; la s&eacute;curit&eacute;. Elle doit identifier tous les m&eacute;canismes de s&eacute;curit&eacute;. Elle doit &eacute;tablir le lien entre les fonctions d&eacute;di&eacute;es &agrave; la s&eacute;curit&eacute; et les m&eacute;canismes ou les composants. Toutes les interfaces des composants d&eacute;di&eacute;s &agrave; la s&eacute;curit&eacute; ou touchant &agrave; la s&eacute;curit&eacute; doivent &ecirc;tre document&eacute;es en pr&eacute;sentant leur but et leurs param&egrave;tres. Des sp&eacute;cifications ou des d&eacute;finitions des m&eacute;canismes doivent &ecirc;tre fournies. Ces sp&eacute;cifications doivent convenir &agrave; l'analyse des relations entre les m&eacute;canismes employ&eacute;s. La fourniture de ces sp&eacute;cifications n'est pas n&eacute;cessaire pour les composants qui ne sont ni d&eacute;di&eacute;s &agrave; la s&eacute;curit&eacute;, ni touchant &agrave; la s&eacute;curit&eacute;. Lorsque plus d'un niveau de sp&eacute;cification est fourni, il doit exister une relation claire et hi&eacute;rarchique entre les diff&eacute;rents niveaux.</strong>-<p>

Exigences concernant les &eacute;l&eacute;ments de preuve<p>

<strong>La conception d&eacute;taill&eacute;e doit pr&eacute;senter la mani&egrave;re dont les m&eacute;canismes de s&eacute;curit&eacute; fournissent les fonctions d&eacute;di&eacute;es &agrave; la s&eacute;curit&eacute; sp&eacute;cifi&eacute;es dans la cible de s&eacute;curit&eacute;. </strong>Elle doit pr&eacute;senter les raisons pour lesquelles les composants dont la conception n'est pas d&eacute;crite ne peuvent &ecirc;tre consid&eacute;r&eacute;s ni comme d&eacute;di&eacute;s &agrave; la s&eacute;curit&eacute; ni comme touchant &agrave; la s&eacute;curit&eacute;.<p>

T&acirc;ches de l'&eacute;valuateur<p>

<strong>V&eacute;rifier que les informations fournies satisfont &agrave; toutes les exigences concernant le contenu, la pr&eacute;sentation et les &eacute;l&eacute;ments de preuve.</strong>-<p>

<a name="73566">
<h4> Phase 4 - R&eacute;alisation</h4>
</a>Exigences concernant le contenu et la pr&eacute;sentation<p>

<strong>La documentation de test doit contenir le plan, l'objectif, les proc&eacute;dures et les r&eacute;sultats des tests. La biblioth&egrave;que de programmes de test doit contenir les programmes de test et les outils permettant de reproduire tous les tests couverts par la documentation de test.</strong>-<p>

Exigences concernant les &eacute;l&eacute;ments de preuve<p>

<strong>La documentation de test doit pr&eacute;senter la correspondance entre les tests et les fonctions d&eacute;di&eacute;es &agrave; la s&eacute;curit&eacute; d&eacute;finies dans la cible de s&eacute;curit&eacute;.</strong>-<p>

T&acirc;ches de l'&eacute;valuateur<p>

<strong>V&eacute;rifier que les informations fournies sont conformes aux exigences concernant le contenu, la pr&eacute;sentation et les &eacute;l&eacute;ments de preuve. Utiliser la biblioth&egrave;que de programmes de test pour v&eacute;rifier par &eacute;chantillonnage les r&eacute;sultats des tests. V&eacute;rifier que les tests couvrent toutes les fonctions d&eacute;di&eacute;es &agrave; la s&eacute;curit&eacute; identifi&eacute;es dans la cible de s&eacute;curit&eacute;.</strong> R&eacute;aliser des tests compl&eacute;mentaires pour rechercher des erreurs.<p>

<a name="73573">
<h4> Construction - L'environnement de d&eacute;veloppement</h4>
</a>Le commanditaire doit fournir la documentation suivante &#32;:<p>

<ul>
<li>la liste de configuration identifiant la version de la TOE &agrave; &eacute;valuer,

<li><strong>des informations sur le syst&egrave;me de gestion de configuration,</strong>-

<li><strong>des informations sur la s&eacute;curit&eacute; de l'environnement de d&eacute;veloppement.</strong>-
</ul><a name="73578">
<h4> Aspect 1 - Gestion de configuration</h4>
</a>Exigences concernant le contenu et la pr&eacute;sentation<p>

<strong>Le processus de d&eacute;veloppement doit s'appuyer sur un syst&egrave;me de gestion de configuration. La liste de configuration fournie doit &eacute;num&eacute;rer tous les composants &eacute;l&eacute;mentaires &agrave; partir desquels la TOE est construite. La TOE, ses composants &eacute;l&eacute;mentaires ainsi que tous les documents fournis, y compris les manuels, doivent poss&eacute;der un identifiant unique. L'emploi de cet identifiant unique est obligatoire dans les r&eacute;f&eacute;rences. Le syst&egrave;me de gestion de configuration doit garantir que la TOE soumise &agrave; l'&eacute;valuation est conforme &agrave; la documentation fournie et que seuls les changements autoris&eacute;s sont possibles.</strong>-<p>

Exigences concernant les &eacute;l&eacute;ments de preuve<p>

<strong>Les informations sur le syst&egrave;me de gestion de configuration doivent pr&eacute;senter comment il est utilis&eacute; en pratique et appliqu&eacute; dans le processus de d&eacute;veloppement conform&eacute;ment aux proc&eacute;dures de gestion de la qualit&eacute; du d&eacute;veloppeur.</strong>-<p>

T&acirc;ches de l'&eacute;valuateur<p>

<strong>V&eacute;rifier que les proc&eacute;dures document&eacute;es sont appliqu&eacute;es.</strong> V&eacute;rifier que les informations fournies satisfont &agrave; toutes les exigences concernant le contenu, la pr&eacute;sentation et les &eacute;l&eacute;ments de preuve.<p>

<a name="73585">
<h4> Aspect 2 - Langages de programmation et compilateurs</h4>
</a>Exigences concernant le contenu et la pr&eacute;sentation<p>

Aucune.<p>

Exigences concernant les &eacute;l&eacute;ments de preuve<p>

Aucune.<p>

T&acirc;ches de l'&eacute;valuateur<p>

Aucune.<p>

<a name="73592">
<h4> Aspect 3 - S&eacute;curit&eacute; des d&eacute;veloppeurs</h4>
</a>Exigences concernant le contenu et la pr&eacute;sentation<p>

<strong>Le document portant sur la s&eacute;curit&eacute; de l'environnement de d&eacute;veloppement doit pr&eacute;senter les protections pr&eacute;vues pour assurer l'int&eacute;grit&eacute; de la TOE et la confidentialit&eacute; des documents associ&eacute;s. Des mesures de s&eacute;curit&eacute; physiques, organisationnelles, li&eacute;es au personnel ou autres, utilis&eacute;es par le d&eacute;veloppeur, doivent &ecirc;tre pr&eacute;sent&eacute;es.</strong>-<p>

Exigences concernant les &eacute;l&eacute;ments de preuve<p>

<strong>Les informations concernant la s&eacute;curit&eacute; de l'environnement de d&eacute;veloppement doivent pr&eacute;senter la mani&egrave;re dont l'int&eacute;grit&eacute; de la TOE et la confidentialit&eacute; de la documentation associ&eacute;e sont maintenues.</strong>-<p>

T&acirc;ches de l'&eacute;valuateur<p>

<strong>V&eacute;rifier que les proc&eacute;dures document&eacute;es sont appliqu&eacute;es. V&eacute;rifier que les informations fournies sont conformes aux exigences concernant le contenu, la pr&eacute;sentation et les &eacute;l&eacute;ments de preuve. Rechercher des erreurs dans les proc&eacute;dures.</strong>-<p>

<a name="73599">
<h4> Exploitation - La documentation d'exploitation</h4>
</a>Le commanditaire doit fournir les documents suivants &#32;:<p>

<ul>
<li>la documentation utilisateur,

<li>la documentation d'administration.
</ul><a name="73603">
<h4> Aspect 1 - Documentation utilisateur</h4>
</a>Exigences concernant le contenu et la pr&eacute;sentation<p>

La documentation utilisateur doit pr&eacute;senter les fonctions d&eacute;di&eacute;es &agrave; la s&eacute;curit&eacute; qui concernent l'utilisateur final. Elle doit aussi donner des lignes directrices suffisantes pour leur exploitation s&ucirc;re. Ces documents, par exemple les manuels de r&eacute;f&eacute;rence et les guides de l'utilisateur, doivent &ecirc;tre structur&eacute;s, avoir une coh&eacute;rence interne et &ecirc;tre compatibles avec tous les autres documents fournis &agrave; ce niveau.<p>

Exigences concernant les &eacute;l&eacute;ments de preuve<p>

La documentation utilisateur doit pr&eacute;senter comment un utilisateur final utilise la TOE de fa&ccedil;on s&ucirc;re.<p>

T&acirc;ches de l'&eacute;valuateur<p>

V&eacute;rifier que les informations fournies satisfont &agrave; toutes les exigences concernant le contenu, la pr&eacute;sentation et les &eacute;l&eacute;ments de preuve.<p>

<a name="73610">
<h4> Aspect 2 - Documentation d'administration</h4>
</a>Exigences concernant le contenu et la pr&eacute;sentation<p>

La documentation d'administration doit pr&eacute;senter les fonctions d&eacute;di&eacute;es &agrave; la s&eacute;curit&eacute; relevant d'un administrateur. Elle doit distinguer deux types de fonctions &#32;: celles qui permettent &agrave; un administrateur de contr&ocirc;ler les param&egrave;tres de s&eacute;curit&eacute; et celles qui lui permettent seulement d'obtenir des informations. Si un administrateur est n&eacute;cessaire, elle doit pr&eacute;senter tous les param&egrave;tres de s&eacute;curit&eacute; qui sont sous sa responsabilit&eacute;. Elle doit pr&eacute;senter tous les &eacute;v&eacute;nements relatifs &agrave; la s&eacute;curit&eacute; relevant des fonctions d'administration. Elle doit pr&eacute;senter, d'une fa&ccedil;on suffisamment d&eacute;taill&eacute;e pour leur utilisation, les proc&eacute;dures relevant de l'administration de la s&eacute;curit&eacute;. Elle doit donner des lignes directrices sur l'utilisation coh&eacute;rente et efficace des caract&eacute;ristiques de s&eacute;curit&eacute; de la TOE et sur la fa&ccedil;on dont ces caract&eacute;ristiques interagissent. Elle doit pr&eacute;senter les instructions sur la fa&ccedil;on dont le syst&egrave;me ou le produit devra &ecirc;tre install&eacute; et, le cas &eacute;ch&eacute;ant, sur la fa&ccedil;on dont il devra &ecirc;tre configur&eacute;. La documentation d'administration, par exemple les manuels de r&eacute;f&eacute;rence et les guides de l'administrateur, doit &ecirc;tre structur&eacute;e, avoir une coh&eacute;rence interne et &ecirc;tre compatible avec tous les autres documents fournis &agrave; ce niveau.<p>

Exigences concernant les &eacute;l&eacute;ments de preuve<p>

La documentation d'administration doit pr&eacute;senter comment la TOE est administr&eacute;e de fa&ccedil;on s&ucirc;re.<p>

T&acirc;ches de l'&eacute;valuateur<p>

V&eacute;rifier que les informations fournies satisfont &agrave; toutes les exigences concernant le contenu, la pr&eacute;sentation et les &eacute;l&eacute;ments de preuve.<p>

<a name="73617">
<h4> Exploitation - L'environnement d'exploitation</h4>
</a>Le commanditaire doit fournir les documents suivants &#32;:<p>

<ul>
<li>la documentation de livraison et de configuration,

<li>la documentation de d&eacute;marrage et d'exploitation.
</ul><a name="73621">
<h4> Aspect 1 - Livraison et configuration</h4>
</a>Exigences concernant les proc&eacute;dures et les normes<p>

Si diff&eacute;rentes configurations sont possibles, l'impact de ces configurations sur la s&eacute;curit&eacute; doit &ecirc;tre pr&eacute;sent&eacute;. Les proc&eacute;dures de livraison et de g&eacute;n&eacute;ration du syst&egrave;me doivent &ecirc;tre pr&eacute;sent&eacute;es.<strong> Une proc&eacute;dure approuv&eacute;e par l'organisme national de certification pour ce niveau d'&eacute;valuation doit &ecirc;tre suivie, afin de garantir l'authenticit&eacute; de la TOE livr&eacute;e. Pendant la g&eacute;n&eacute;ration de la TOE, toute option ou tout changement de g&eacute;n&eacute;ration doit &ecirc;tre audit&eacute; de telle fa&ccedil;on qu'il soit possible a posteriori de reconstituer exactement comment et quand la TOE a &eacute;t&eacute; g&eacute;n&eacute;r&eacute;e.</strong><p>

Exigences concernant les &eacute;l&eacute;ments de preuve<p>

Les informations fournies doivent pr&eacute;senter comment les proc&eacute;dures maintiennent la s&eacute;curit&eacute;.<p>

T&acirc;ches de l'&eacute;valuateur<p>

V&eacute;rifier que les informations fournies satisfont &agrave; toutes les exigences concernant le contenu, la pr&eacute;sentation et les &eacute;l&eacute;ments de preuve.<strong> V&eacute;rifier que les proc&eacute;dures de livraison sont correctement appliqu&eacute;es. Rechercher des erreurs dans les proc&eacute;dures de g&eacute;n&eacute;ration syst&egrave;me.</strong><p>

<a name="73628">
<h4> Aspect 2 - D&eacute;marrage et exploitation</h4>
</a>Exigences concernant les proc&eacute;dures et les normes<p>

Les proc&eacute;dures pour assurer un d&eacute;marrage et une exploitation s&ucirc;rs doivent &ecirc;tre pr&eacute;sent&eacute;es.<strong> Si une fonction d&eacute;di&eacute;e &agrave; la s&eacute;curit&eacute; peut &ecirc;tre d&eacute;sactiv&eacute;e ou modifi&eacute;e pendant le d&eacute;marrage, l'exploitation normale ou la maintenance, cela doit &ecirc;tre d&eacute;clar&eacute;. Si la TOE comprend des &eacute;l&eacute;ments mat&eacute;riels qui incluent des composants mat&eacute;riels d&eacute;di&eacute;s &agrave; la s&eacute;curit&eacute;, il doit exister des fonctions de diagnostic mises en oeuvre par l'administrateur, par l'utilisateur final, ou de fa&ccedil;on automatique, pouvant &ecirc;tre ex&eacute;cut&eacute;es sur la TOE dans son environnement d'exploitation.</strong><p>

Exigences concernant les &eacute;l&eacute;ments de preuve<p>

Les informations fournies doivent pr&eacute;senter comment les proc&eacute;dures maintiennent la s&eacute;curit&eacute;. <strong>Le commanditaire doit fournir des exemples de r&eacute;sultats de toutes les proc&eacute;dures de diagnostic des composants mat&eacute;riels d&eacute;di&eacute;s &agrave; la s&eacute;curit&eacute;. Le commanditaire doit fournir des exemples de toute trace d'audit g&eacute;n&eacute;r&eacute;e au cours du d&eacute;marrage ou de l'exploitation.</strong><p>

T&acirc;ches de l'&eacute;valuateur<p>

V&eacute;rifier que les informations fournies satisfont &agrave; toutes les exigences concernant le contenu, la pr&eacute;sentation et les &eacute;l&eacute;ments de preuve. <strong>V&eacute;rifier les exemples d'&eacute;l&eacute;ments de preuve exig&eacute;s pour le d&eacute;marrage et l'exploitation. Rechercher des erreurs dans les proc&eacute;dures.</strong><p>


<TABLE BGCOLOR="#FF9933"><TR><TD WIDTH=100%>
<CENTER>
<BR><A HREF="/document/criteres.html">Index de la documentation sur les critères</A> | 
<A HREF="/document/index.html">Index général de la documentation</A>
<BR>
<A HREF="/document/docs/ITSEC/itsec.html">Sommaire</A> |
<A HREF="/document/docs/ITSEC/itsec-0.html">Introduction</A> |
<A HREF="/document/docs/ITSEC/itsec-1.html">Champ d'application</A> |
<A HREF="/document/docs/ITSEC/itsec-2.html">Fonctionnalité</A> 
<A HREF="/document/docs/ITSEC/itsec-3.html">Efficacité</A> |
<A HREF="/document/docs/ITSEC/itsec-4.html">Conformité</A> |
<A HREF="/document/docs/ITSEC/itsec-E1.html">Conformité E1</A> |
<A HREF="/document/docs/ITSEC/itsec-E2.html">Conformité E2</A> |
<A HREF="/document/docs/ITSEC/itsec-E3.html">Conformité E3</A> |
<A HREF="/document/docs/ITSEC/itsec-E4.html">Conformité E4</A> |
<A HREF="/document/docs/ITSEC/itsec-E5.html">Conformité E5</A> |
<A HREF="/document/docs/ITSEC/itsec-E6.html">Conformité E6</A>
<A HREF="/document/docs/ITSEC/itsec-5.html">Résultats de l'évaluation</A> |
<A HREF="/document/docs/ITSEC/itsec-6.html">Glossaire</A> |
<A HREF="/document/docs/ITSEC/itsec-A.html">Exemples de classes de Fonctionnalité</A> |
<A HREF="/document/docs/ITSEC/itsec-B.html">"Claims language"</A> |

<BR><BR><a href="itsec.html"><img alt="[Début]" border=0 src="/images/top.gif"></a> <a href="itsec-E1.html"><img alt="[Précédente]" border=0 src="/images/prev.gif"></a> <a href="itsec-E3.html"><img alt="[Suivante]" border=0 src="/images/next.gif"></a> <a href="itsec-B.html"><img alt="[Fin]" border=0 src="/images/bottom.gif"></a>
<BR><BR>
</TD></TR></TABLE>
</TD></TR></TABLE>
<HR>

<SMALL><A HREF="/courrier.html">
webmaster@scssi.gouv.fr</A>

- Copyright &copy 1999 Service Central de la Sécurité des Systèmes d'Information
<BR>Dernière mise à jour le 17/06/99 à 17:03:50
</SMALL>
</body>
</html>
