<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.06 [fr] (WinNT; I) [Netscape]">
   <TITLE>Preface</TITLE>
</HEAD>
<BODY BGCOLOR="#DDDDDD">
<A NAME="preface"></A>
<P>RFC: 1034
<BR>Statut : Standard
<CENTER>
<H1>
DOMAIN NAME SYSTEM</H1></CENTER>

<CENTER>
<H2>
Concepts de base</H2></CENTER>

<HR>Cr&eacute;dits : P. Mockapetris, ISI
<BR>Traduction : <A HREF="mailto:Valery.Fremaux@eisti.fr">Val&eacute;ry
G. FREMAUX</A>
<BR>Edition originale : Novembre 87 / Version FR : Avril 1998
<BR>Remplace : RFC882, RFC883, RFC973
<HR>
<H2>
<FONT COLOR="#000088">AVANT-PROPOS</FONT></H2>

<P><BR><B><I>Note du Traducteur :</I></B>
<P><I>Le texte suivant est la traduction int&eacute;grale de la sp&eacute;cification
du syst&egrave;me DNS, telle qu'&eacute;dit&eacute;e par les auteurs originaux
du protocole, sans ajouts, commentaires, ni omissions.</I>
<P><I>Concernant les droits de traduction de ce texte : Toute reproduction
de cette traduction est autoris&eacute;e &agrave; titre personnel ou &eacute;ducatif.
Par contre, &eacute;tant donn&eacute; la quantit&eacute; de travail que
cette mise en oeuvre repr&eacute;sente, le traducteur se r&eacute;serve
le droit d'autoriser une reproduction partielle ou totale de cette traduction
dans tout ouvrage &agrave; caract&egrave;re commercial.</I>
<P><I>NOTE SPECIALE : Dans l'ensemble de ce document appara&icirc;t un
acronyme local "RR" signifiant Enregistrement de Ressource. Nous faisons
ici ce rappel pour tous ceux qui ne souhaiteraient consulter uniquement
que quelques parties de ce document.</I>
<H2>
<FONT COLOR="#000080">1. STATUT DE CE MEMO</FONT></H2>

<P><BR>Cette RFC est une introduction au syst&egrave;me de noms de domaines
(Domain Name System) DNS, et passe sous silence de nombreux d&eacute;tails
qui pourront &ecirc;tre trouv&eacute;s dans une RFC compl&eacute;mentaire,
"Domain Names - Implementation and Specification" [RFC-1035]. Cette derni&egrave;re
suppose que le lecteur est d&eacute;j&agrave; familiaris&eacute; avec les
concepts &eacute;nonc&eacute;s dans le pr&eacute;sent.
<P>Un sous-ensemble des fonctions DNS et des types de donn&eacute;es associ&eacute;s
constitue un protocole officiel. Le protocole officiel comprend la d&eacute;finition
des requ&ecirc;tes standard et des r&eacute;ponses qui y sont faites ainsi
que la plupart des formats de classes de donn&eacute;es Internet (ex.,
adresses d'h&ocirc;tes).
<P>Cependant, le syst&egrave;me de domaines est intentionnellement extensible.
Les chercheurs proposent continuellement, impl&eacute;mentent et exp&eacute;rimentent
de nouveaux types de donn&eacute;es, types de requ&ecirc;tes, classes,
fonctions, etc. De ce fait, alors que les constituants du protocole officiel
sont suppos&eacute;s rester stables et pouvoir &ecirc;tre utilis&eacute;s
en exploitation, des comportements exp&eacute;rimentaux pourront &ecirc;tre
observ&eacute;s au del&agrave; des limites de la d&eacute;finition officielle.
Les RFC concern&eacute;es mentionnent clairement les fonctions exp&eacute;rimentales,
ou obsol&egrave;tes, et l'information qui y est report&eacute;e doit toujours
&ecirc;tre consid&eacute;r&eacute;e avec pr&eacute;caution.
<P>Il est signal&eacute; au lecteur de ne jamais consid&eacute;rer les
valeurs donn&eacute;es &agrave; titre d'exemple comme op&eacute;rationnelles
ou compl&egrave;tes, dans la mesure o&ugrave; leur utilisation n'est faite
que dans un but p&eacute;dagogique. La distribution de ce m&eacute;mo est
illimit&eacute;e.
<BR>
<HR>
</BODY>
</HTML>
